{
    "12345": {
        "body": "<p>The weather is hot. We can't play today</p>",
        "viewcount": "12"
    },
    "23456": {
        "body": "It's raining today. We can go out and play out. It's a nice weather"
    },
    "12567": {
        "body": "I bought a new android phone but it's not running properly when connected to my PC"
    },
    "5678": {
        "body": "I've noticed that I don't gain any experience anymore for certain kinds of monsters, at least there appears no entry in the combat journal. I suspect that the XP formula is level-dependent, so that you don't gain any XP anymore for monsters far below your own level.</p>\n\n<p>Is there anything known about how the experience point system works in the Witcher 2? </p>\n"
    },
    "9087": {
        "body": "We are working on a web project in php that has a password reset feature.</p>\n\n<p>Now the problem is, between \"Password Reset Mail\" and \"Reset Password Mail\", which is better?</p>\n"
    },
    "1269": {
        "body": "I've managed to setup the chroot but I'm unsure how to get the chroot to recognise usb devices. I'll be doing so work with microcontrollers hence I neeed to to recognise my usb based programmer.</p>\n\n<p>For starters how do I populate the dev directory with the host dev directory(android)?</p>\n\n<p>Is it then just a matter of getting the right kernel modules loaded?</p>\n\n<p>I'm running prime1.5 firmware on the asus transformer</p>\n"
    },
    "6789": {
        "body": "How do we kill those monsters in Mortal Combat 5. I cannot find any entry in the war zone."
    },
    "4500": {
        "body": "The weather forecast predicted a heavy storm today. Is it advisabel to stay inside?"
    },
    "67809": {
        "body": "<p>I'm making a web site for a small hotel in php. The hotel owners want a reservation system that uses paypal. They want people to see a calendar and choose a date to make a reservation. They also want the passwrod authntication for each user. If the day has vacancy, they want the user to request booking a room. This would then require the hotel owner to accept the purchase.</p>\n\n<p>I have not worked on a project that has this \"request to purchase\" method of buying with paypal. Is this possible? Does anyone know of an open php system that handles this?</p>\n"
    },
    "34987": {
        "body": "I am trying to make a web application for a college to manage its students details in php. The password is causing a problem. How can I make the authentication better."
    },
    "2167": {
        "body": "What's your Supreme Combat 2 build order. I don't just want \"6 mass extractors, 2 power and a factory in this level\". List of building and units out to the second or third factory, please. </p>\n"
    },
    "548765": {
        "body": "I am playing around with my brand new Android phone Motorola Defy and trying to find a way to manage my contacts on the drive.\nOf course it synced every contact in my Google account... I want to hide some of them, you know, those people you don't contact often but whose coordinates you want to keep in case you ever need to."
    }
}