{"18913":{"body":"<p>I have a Samsung Galaxy S, using the default firmware (version 2.2).  It is configured to select \"Mass Storage\" when plugged in via micro USB.</p>\n\n<p>When I plug the phone into the cable, I receive the \"Click here to connect via USB\" button.</p>\n\n<p>However, when I click it, the phone thinks for a bit and then tells me that it's connected; yet Windows makes no mention of it and the drives are not accessible from the computer.  It has worked in the past, but has apparently decided I am no longer worthy or something.</p>\n\n<p>I have rebooted both the phone and the computer with no change in behaviour.</p>\n\n<p>What am I doing wrong?  Is there something obvious I've missed?</p>\n","viewcount":922,"dups":[],"title":"Phone not mounting as a drive when \"Connect USB storage\" is clicked","tags":["usb-connection-mode"],"userid":"7209","related":[],"score":3,"answers":["18916"],"acceptedanswer":false,"creationdate":"2012-01-30T23:27:50.593","favoritecount":2,"comments":[]},"55418":{"body":"<p>Is there a way to root a samsung galaxy stellar (4.1.2 jb)? I've searched all over google and have come up inconclusive.</p>\n","viewcount":581,"dups":[],"title":"Samsung galaxy stellar root","tags":["root"],"userid":"17483","related":["53601"],"score":1,"answers":["55453"],"acceptedanswer":false,"creationdate":"2013-10-20T02:24:45.207","favoritecount":0,"comments":[]},"18910":{"body":"<p>I have the Incredible and here are the specs:</p>\n\n<p>CyanogenMod 7.1.0 Stable\nBaseband: 2.15.00.07.28</p>\n\n<p>I can't seem to get my GPS to run in a stable manner. Sometimes it works and sometimes it doesn't.</p>\n\n<p>I've installed all the diagnostic GPS apps: GPS Essentials, GPS Status, GPS Test, GPS Fix, and doesn't make a difference. Cleared the AGPS, d/l new AGPS, etc...</p>\n\n<p>When I use any of those, or my speedometer apps - Speedview and UlyssesSpeedometer - the GPS icon doesn't even blink. It's as if it can't hook the GPS command to turn on.</p>\n\n<p>When it does work, it's great, a fix in about 3 seconds and 10 or 11 satellites. </p>\n\n<p>I've run Fix Permissions in Rom Manager, and that seemed to help right away, but nothing since then, and I've ran that after I've installed new apps unrelated to anything GPS, and still to no avail.</p>\n\n<p>How can I fix this to get a stable GPS on my phone?? Any help would be greatly appreciated, so frustrating.</p>\n","viewcount":1013,"dups":[],"title":"CM7 GPS works randomly, no rhyme or reason, is there a fix?","tags":["cyanogenmod","settings","gps","htc-droid-incredible"],"userid":"8800","related":[],"score":2,"answers":["19083","18915"],"acceptedanswer":"19083","creationdate":"2012-01-30T21:52:43.977","favoritecount":0,"comments":[]},"55411":{"body":"<p>I got excited about the prospect of writing code for a watch and ordered a Samsung Galaxy Gear. Currently the device does nothing unless paired with a Samsung phone running the proper version of the official software.</p>\n\n<p>My goal is to enable debug mode and use adb to install apps, not necessarily use all the phone-gear functionalities.</p>\n\n<p>Any idea on how to do anything without a Galaxy phone? The obvious answer is no, but I'm hoping some clever hacker in this site may have found a way.</p>\n","viewcount":6003,"dups":[],"title":"Can I use a Galaxy Gear without a Samsung Phone?","tags":["samsung-galaxy-gear"],"userid":"43599","related":[],"score":4,"answers":["55678","55930","59790"],"acceptedanswer":"59790","creationdate":"2013-10-19T23:42:53.877","favoritecount":2,"comments":["74569","74580","74584","74586","74588","74590","74925","77593"]},"55413":{"body":"<p>Is there an official list or something? :D</p>\n\n<p>I'd like to remove some of them to improve battery life, but not sure which are safe to remove</p>\n","viewcount":280,"dups":[],"title":"What system apps can be safely removed with Titanium backup on Nexus 4?","tags":["applications","nexus-4","uninstallation","titanium-backup"],"userid":"43575","related":[],"score":1,"answers":["55509"],"acceptedanswer":false,"creationdate":"2013-10-20T00:33:37.480","favoritecount":0,"comments":[]},"55414":{"body":"<p>Glass on my Nexus 4 is broken (touch doesn't work) after it falled from relatively small bed (just about 50 centimeters from the floor).</p>\n\n<p>I purshased Nexus 4 on google play, can they fix this by warranty or for pay (how much?)</p>\n\n<p>I've tried to call US support team from <a href=\"https://support.google.com/googleplay/answer/3053039\" rel=\"nofollow\">here</a> but it is not possible. When I press '3' in Skype they do not recognize that and keep asking me to make a decision.</p>\n\n<p><img src=\"http://i.stack.imgur.com/pFudu.jpg\" alt=\"broken nexus 4 photo\"></p>\n","viewcount":294,"dups":[],"title":"how to ask google to repair nexus 4?","tags":["google-play-store","nexus-4"],"userid":"43600","related":[],"score":1,"answers":["55415"],"acceptedanswer":false,"creationdate":"2013-10-20T00:48:06.780","favoritecount":0,"comments":[]},"55416":{"body":"<p>I'm running MIUI 3.9.27 on my HTC Desire S.</p>\n\n<p>I accidentally froze my miui launcher (com.miui.home) and after reboot, phone stuck on boot animation, but seems everything running except miuiHome.</p>\n\n<p>I know that for defrosting app from <code>adb</code> I should run <code>adb shell pm enable com.miui.home</code> but it'd say <code>Killed</code> and nothing happen. I read somewhere that I should run it as superuser but when I run <code>su</code> adb wait for phone root access approval, and since phone stucked on boot animation I couldn't approve root access.</p>\n\n<p>Is there anyway to access superuser without approving it from phone? or doing pm from recovery?</p>\n\n<p>P.S: I think if I could push LBE Guard data (that adb root access has been granted and remembered) into /data/data it may work but I don't know how I could do this</p>\n","viewcount":173,"dups":[],"title":"adb shell superuser access without approve from phone","tags":["adb","superuser"],"userid":"8205","related":[],"score":2,"answers":[],"acceptedanswer":false,"creationdate":"2013-10-20T02:10:44.070","favoritecount":0,"comments":[]},"56140":{"body":"<p>Is there any way to delete cookies, history and other private data in the Google Chrome browser on Android? There is no such option in the Android version of the browser.</p>\n","viewcount":81,"dups":[],"title":"How to clear cookies, history and other private data in the Chrome browser?","tags":["privacy","cache","delete"],"userid":"43495","related":[],"score":0,"answers":["56142"],"acceptedanswer":"56142","creationdate":"2013-11-01T07:20:56.847","favoritecount":0,"comments":[]},"56147":{"body":"<p>I recently had to capture my <code>logcat</code> for my HTC EVO 4G device to try and identify the reason why updates sometimes fail claiming there is insufficient memory (<a href=\"http://android.stackexchange.com/questions/55770/insufficient-storage-available-during-update\"><strong>issue discussed more extensively here</strong></a>).</p>\n\n<p>However, the log captures EVERYTHING which means you have a lot of unnecessary information as well which makes it hard to look at the raw data without getting overwhelmed with the amount of data. I am trying to isolate the data relevant to the updating process so we can see what's going on that is triggering the error when there is enough space on the internal storage that can't be exhausted by the size of the installer and/or application size.</p>\n\n<p>Does anyone have a suggestion for a LogCat viewer or recommendation? What solution works best? Preferably a visual (GUI) tool that can process the file with filtering capability and hopefully intelligent grouping and so on.</p>\n","viewcount":257,"dups":[],"title":"What Options Are Available For Viewing the LogCat?","tags":["logging"],"userid":"40214","related":["55770","55770"],"score":0,"answers":["56159"],"acceptedanswer":false,"creationdate":"2013-11-01T08:52:40.180","favoritecount":0,"comments":[]},"51245":{"body":"<p>The <em>Locations</em> feature on Google+ running on Cyanogenmod is not showing a Map. I am not sure what's the cause of this, but as of <a href=\"https://jira.cyanogenmod.org/browse/CYAN-1193\" rel=\"nofollow\">CYAN-1193</a> the fix is to convert Google+ to a system app. I did this successfully with Titanium Pro with just one click. After Google+ became a system app, the map was shown.</p>\n\n<p>Now I have a dozen other devices without the pro version of Titanium where I want to do the same. Surely there is a way with <em>root</em> and <code>adb</code>. Can you guide me?</p>\n","viewcount":562,"dups":[],"title":"How can I convert Google+ to a system app without buying Titanium Pro?","tags":["cyanogenmod","google-plus"],"userid":"440","related":[],"score":1,"answers":["51251"],"acceptedanswer":"51251","creationdate":"2013-08-14T19:59:48.697","favoritecount":0,"comments":[]},"51247":{"body":"<p>When I connect the android tablet to windows 7 I get 2 external devices, one of them (H) doesn't open.<br/><br/>\n<img src=\"http://i.stack.imgur.com/hFKyL.png\" alt=\"enter image description here\"></p>\n\n<p>When I open G:, I get this </p>\n\n<p><img src=\"http://i.stack.imgur.com/A5ZO0.png\" alt=\"enter image description here\"></p>\n\n<p>If I want to copy an app (adobe reader) to the tablet, to which folder should I copy it?</p>\n\n<p>This is the screen of the tablet:</p>\n\n<p><img src=\"http://i.stack.imgur.com/W6lgg.jpg\" alt=\"enter image description here\"></p>\n\n<p>Where should I access the folders and files from?</p>\n","viewcount":291,"dups":[],"title":"How to copy file from PC to android tablet?","tags":["usb","file-transfer"],"userid":"39419","related":["42474"],"score":3,"answers":["51284","51257","51254"],"acceptedanswer":false,"creationdate":"2013-08-14T21:03:43.073","favoritecount":2,"comments":["69041","69042","69043","69045","69054"]},"51249":{"body":"<p>Phone: Samsung Galaxy SIII<br>\nOS: Android Jelly Bean 4.1.2</p>\n\n<p>I've tried talking to Samsung, AT&amp;T, and reading forums looking for a good answer to this, and I seem to be the only person experiencing this exact problem.</p>\n\n<p>When someone sends me a group message from iMessage on an iPhone, one of 3 things happens.</p>\n\n<ol>\n<li>I receive the message from the original sender, no evidence of other people on the message, and receive a message from 'Anonymous' at the same time that says \"Message not found.\"</li>\n<li>I receive the message from the original sender twice, sometimes with the error message, sometimes not.</li>\n<li>I only receive \"Message not found\" and the actual message never reaches me.</li>\n</ol>\n\n<p>All I want is to see the group message from iMessage without an error or a duplication, and it would be nice to know it's a group message. Icing on the cake would be to actually reply all and even see who else it was sent to. I have not seen anyone else report this particular error. This has been an on-going problem, not a recent one, that I was only very recently able to diagnose. Today's advice has ranged from telling every one of my iOS friends to turn off Android messaging in iMessage, to deleting my phone number from the Apple Support page (which does not and never has had an iPhone attached to it), to resetting my device.</p>\n\n<p>Even if the answer is <code>This is a common issue because Samsung and Apple love to feud and piss off their customers, so they make it impossible for you to communicate with the enemy</code>, I would love to hear that.</p>\n","viewcount":205,"dups":[],"title":"Errors when receiving iMessage group texts","tags":["samsung-galaxy-s-3","sms"],"userid":"39423","related":[],"score":1,"answers":[],"acceptedanswer":false,"creationdate":"2013-08-15T00:40:13.640","favoritecount":0,"comments":[]},"51248":{"body":"<p>How do I use music stored for offline playing from Google Play as ringtone/alarm?</p>\n\n<p>I have tried the following:  </p>\n\n<blockquote>\n  <p>Then when you go to set your ringtone/alarm/notification, use the ES\n  File Explorer entry that pops up. Then navigate to\n  <code>/sdcard/Android/data/com.google.android.music/files/music</code> and select\n  the right song.</p>\n</blockquote>\n\n<p>However, this appears to be empty. </p>\n","viewcount":275,"dups":[],"title":"Use music stored for offline playing from Google Play as ringtone/alarm","tags":["ringtone","google-play-music"],"userid":"39420","related":[],"score":1,"answers":[],"acceptedanswer":false,"creationdate":"2013-08-14T21:13:49.370","favoritecount":0,"comments":[]},"61152":{"body":"<p>I am an Android developer and I have been using my SGS2 for a while and I was accessing the debugging mode without any problem, until I broke my phone's screen. I found a repairer who replaced the screen with another. Since that day I cannot access my S2 neither on Debugging mode, nor on USB File Transfer mode. </p>\n\n<p>How can I fix this?</p>\n\n<p><strong>EDIT</strong></p>\n\n<p>It still charges when connected to PC, but no feedback in my Win 7. I tried with other computers and getting the same things ... </p>\n","viewcount":248,"dups":[],"title":"SGS2 can't connect to PC for USB file transfer or Debugging mode","tags":["samsung-galaxy-s-2","usb-connection-mode","usb-debugging"],"userid":"50846","related":[],"score":0,"answers":["61243"],"acceptedanswer":"61243","creationdate":"2014-01-14T11:33:39.170","favoritecount":0,"comments":["82850","82851","82856","82873","82874","82893","82942","82945"]},"61153":{"body":"<p>I'm creating a computer system for telemarketing.\nI'm using adb commands to dial numbers <a href=\"http://stackoverflow.com/a/4927028/1016772\">Link</a>\nIs it possible to get last dialled number and call duration via adb?\nIf it is, how?</p>\n","viewcount":328,"dups":[],"title":"How can I get the last dialled number and call duration via adb?","tags":["adb","call-history"],"userid":"18795","related":[],"score":1,"answers":["61160"],"acceptedanswer":false,"creationdate":"2014-01-14T11:41:08.770","favoritecount":0,"comments":[]},"61150":{"body":"<p>How can I manage the position of my favorite links in the grid of chrome?</p>\n\n<p>I have several favorite in the default grid, but the position is determined by the order of saving. I would like to order my favourites by needed (by use for e.g.).</p>\n\n<p>I use chrome with no extensions on Nexus 4 with Kitkat 4.4.3</p>\n","viewcount":32,"dups":[],"title":"How to manage browser favorites with Chrome?","tags":["nexus-4","4.4-kitkat","chrome-for-android"],"userid":"43163","related":[],"score":1,"answers":[],"acceptedanswer":false,"creationdate":"2014-01-14T10:43:13.763","favoritecount":1,"comments":[]},"61154":{"body":"<p>My note 10.1 N8000 is restarting the moment I press the pasting button on my keyboard ( the one in the right corner next to the earth ) what shall I do ? This bitton is really useful but the reboot issue is really annoying.  Any help is appreciated</p>\n","viewcount":58,"dups":[],"title":"samsung galaxy note 10.1 rebooting","tags":["reboot","samsung-galaxy-note-10.1"],"userid":"50853","related":[],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2014-01-14T12:09:38.520","favoritecount":0,"comments":[]},"61155":{"body":"<p>I have a Galaxy Nexus with the stock firmware, it's a device that has been powered off for a long time. Currently I can't update any existing apps nor can I install new ones. I have tried with Chrome, Firefox Beta and Opera Mini, I also tried updating existing ones with no luck. Also there are apps that have updates available but Play Store doesn't offer the option to update (for example the version of Firefox is 16), others (actually just one) are listed as having available updates.</p>\n\n<p>There are two different behaviors that occur.</p>\n\n<p><strong>When trying to install  Chrome</strong></p>\n\n<p>The Google Play says that the app is not compatible with the device, i don't think is the case. The same happens with Firefox which is listed as a supported device in the <a href=\"https://support.mozilla.org/en-US/kb/will-firefox-work-my-mobile-device\" rel=\"nofollow\">mozilla page</a> </p>\n\n<p><strong>When trying to update an app or install Opera Mini</strong></p>\n\n<p>When trying to update an app with updates available or installing Opera Mini my device is recognized as supported but after clicking install and accepting the permissions an error occur, it says:</p>\n\n<pre><code>Error retrieving information from server. [RPC:S-3]\n</code></pre>\n\n<p>I have already deleted the Google Account and recreated it (password works)</p>\n\n<p>Android version is 4.1.2 build number JZO54K. No carrier and no SIM, connected over a working wifi (I can surf the net with firefox)</p>\n\n<p>Any ideas?</p>\n","viewcount":2544,"dups":["59861"],"title":"Can't update apps nor install apps","tags":["google-play-store","update","samsung-galaxy-nexus","installation"],"userid":"50851","related":["59861"],"score":2,"answers":["61157"],"acceptedanswer":"61157","creationdate":"2014-01-14T12:19:59.353","favoritecount":0,"comments":["82875"]},"25007":{"body":"<p>My Thunderbolt created two text messages and sent them to wife's phone...made them up!!\nI have had a problem with live wallpaper.  Starts Flashing. Shut down is only way I could get to stop.  Last time, upon completion of re-boot, I found two text messages to wife that I did not create!  Time stamp on messages was when I was re-booting.  Anybody had this or something similar happen?</p>\n","viewcount":27,"dups":[],"title":"Thunderbolt creating text messages","tags":["htc-thunderbolt"],"userid":"16444","related":[],"score":1,"answers":[],"acceptedanswer":false,"creationdate":"2012-06-29T01:25:12.077","favoritecount":0,"comments":[]},"25002":{"body":"<p>I'm having problems with websites where the only way to access a page is by hovering over a menu. Is there any way of doing that in android? Maybe an app which allows the screen to be used as if a touch pad on a laptop. </p>\n\n<p>Thanks</p>\n","viewcount":1734,"dups":[],"title":"web browser / plugin with mouse hover mode","tags":["mouse"],"userid":"5476","related":[],"score":2,"answers":["25015","25003"],"acceptedanswer":"25003","creationdate":"2012-06-28T22:29:29.160","favoritecount":1,"comments":[]},"56429":{"body":"<p>I did a factory reset on a Samsung Galaxy S2 like this:</p>\n\n<ul>\n<li>switch off phone</li>\n<li>hold down buttons Volume Up, Home and Power until phone boots into \"Android System Recovery\" mode</li>\n<li>select wipe/factory reset and confirm all questions</li>\n</ul>\n\n<p>As expected, after the factory reset, all apps were not installed anymore.</p>\n\n<p>But this does not seem to have worked for the file system: On the file system of the internal USB memory (/storage/sdcard0), I see many folders of previously installed apps and also some which I had manually created before the factory reset. I think that a factory reset should delete all these folders, because e.g. the WhatsApp folder contains all my personal messages. I think that if a function is called a factory reset, then afterwards personal messages should be deleted. So what's wrong here?</p>\n","viewcount":15963,"dups":[],"title":"How to properly factory-reset a Samsung Galaxy S2?","tags":["samsung-galaxy-s-2","factory-reset","internal-sd"],"userid":"44629","related":[],"score":2,"answers":["81975","56442"],"acceptedanswer":"56442","creationdate":"2013-11-06T01:32:25.157","favoritecount":0,"comments":[]},"25008":{"body":"<p>The charger that came with my Galaxy Nexus phone outputs 5 volts at 1 amp. I have another charger that outputs 5v at 2 amps. Is it safe to use this charger? What's the limit I can use without damaging the phone?</p>\n","viewcount":5041,"dups":[],"title":"What's the safe limit on charger output for a Galaxy Nexus","tags":["samsung-galaxy-nexus","charging"],"userid":"336","related":["418"],"score":8,"answers":["45448","25018"],"acceptedanswer":"25018","creationdate":"2012-06-29T01:35:02.680","favoritecount":1,"comments":["30023","30026","30028","57221"]},"20118":{"body":"<blockquote>\n  <p><strong>Possible Duplicate:</strong><br>\n  <a href=\"http://android.stackexchange.com/questions/18111/how-can-i-do-development-on-my-android-device\">How can I do development on my Android device?</a>  </p>\n</blockquote>\n\n\n\n<p>OK, so I've just got a new Kindle Fire (which I love), and I've been wondering:</p>\n\n<p><strong>Can I develop Java programs on my Kindle?</strong></p>\n\n<p>Is this even possible? Can a Gingerbread tablet do this?  I am looking for an offline solution.</p>\n\n<p><em>Note: This is not a programming question, so it would be off-topic on any other SE site</em></p>\n","viewcount":44,"dups":["18111"],"title":"Code/Program Java on Kindle Fire","tags":["amazon-kindle-fire","java"],"userid":"13009","related":["18111"],"score":2,"answers":[],"acceptedanswer":false,"creationdate":"2012-03-01T22:44:58.753","favoritecount":0,"comments":["23301","23304","23306"]},"82208":{"body":"<p>Phone model : SGH-I317M\nNetwork : Rogers</p>\n\n<p>I made a backup of the /efs folder right after rooting my phone. (Using EFSPro). </p>\n\n<p>Since then I have played around with downgrading to android 4.1(downloaded from samsmmobile) from the official android 4.4 release before. Due to bootloader issues I was unable to do this. </p>\n\n<p>To fix my phone I downloaded android 4.4  from Samsmobile. The phone boots fine, but I have no network connectivity. The IMEI and baseband are unknown. I tried restoring the EFS backup but it did not work. After a bit of debugging here is what I found:</p>\n\n<p>1) After restoring the EFS backup I took another backup and compared the MD5 for my original backup and the backup take right after restore. They matched.\n2) Then I rebooted my phone and did another backup, this time the MD5's did not match.</p>\n\n<p>Hence Something during the boot process is rewriting my EFS folder. I tried doing a format of the /efs parition before restoring but the format failed.</p>\n\n<p>Any help/ideas would be appreciated.</p>\n","viewcount":13,"dups":[],"title":"Unable to restore /EFS from backup on galaxy note II","tags":["samsung-galaxy-note-2","odin","imei"],"userid":"72745","related":[],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2014-09-09T00:05:31.457","favoritecount":0,"comments":[]},"65389":{"body":"<p>I have rooted my Nexus 5 and am trying to move an apk to the system/apps directory but keep getting \"Operation Failed\". I am trying to move from the /data/app directory to the /system/app directory to give access to system only settings.</p>\n\n<p>I have changed /system and /system/app to permissions of 777 with \"Root Browser\".</p>\n\n<p>What needs to be changed to allow for this?</p>\n","viewcount":4361,"dups":[],"title":"Moving apk to system/app. Operation failed","tags":["root","file-system","apk"],"userid":"56038","related":[],"score":1,"answers":["65397","65464"],"acceptedanswer":false,"creationdate":"2014-03-13T14:41:09.940","favoritecount":0,"comments":[]},"9918":{"body":"<p>Recently a friend of mine showed be his Desire HD, and it has an option on the Wireless settings section, which is something like \"USB and Portable Tethering\". So when it's activated, it creates a wireless network.</p>\n\n<p>He also has Android 2.2 (not a custom ROM). I've searched every option in my phone, and I don't have \"portable tethering\" only usb.</p>\n\n<p>I tried downloading an app called \"Wireless Tethering\", but it creates an ad-hoc and it doesn't work very good.</p>\n\n<p>So, can I do something, or I have to change my ROM to another 2.2 or even 2.3?</p>\n","viewcount":333,"dups":[],"title":"Can't do wireless tethering. HTC Hero with 2.2 ROM","tags":["2.2-froyo","htc-hero","rom","wifi-tethering","wi-fi"],"userid":"5582","related":[],"score":1,"answers":["9937"],"acceptedanswer":"9937","creationdate":"2011-06-01T07:51:31.993","favoritecount":0,"comments":[]},"65382":{"body":"<p>I just updated my phone samsung galaxy s3 to JellyBean from ICS. I like to debug my application as I am android developer. But on setting screen I could not found the Developer options. So where can I find it and enable usb debugging. </p>\n","viewcount":13,"dups":["33496"],"title":"missing USB debugging options in jelly bean","tags":["4.1-jelly-bean","usb-debugging"],"userid":"55253","related":["33496"],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2014-03-13T13:19:27.630","favoritecount":0,"comments":[]},"82205":{"body":"<p>I was very sceptical about Google Text-to-Speech but I tried it and the word recognition is pretty good. What drives me crazy however, is that it does not recognise any of the given commands for punctuation, capitalisation or any other dictation commands.</p>\n\n<p>It writes only in lowercase, even for common first names (e.g. James) and for the start of sentences, and it always puts \"i\" in lowercase. This alone renders it useless for dictation for anything except personal texting or private note taking. You can forget using it to dictate a business email.</p>\n\n<p>It also chooses very strange word recognition options. For example saying \"send to\" yielded \"casna\", but in the drop down was the option to change the word to \"send to\". Why would Google choose a made up word over a well-known phrase? </p>\n\n<p>Voice commands for capitalisation and punctuation clearly worked in the past, so what has changed, and more importantly when is it going to be fixed?</p>\n\n<p>Google also autocorrects \"www.\" to \"wee\", meaning that it is impossible to dictate a web address. That alone makes the \"OK Google\" function useless for browsing.</p>\n","viewcount":7,"dups":[],"title":"Why don't the commands for punctuation, capital letters or other speech-to-text functions work?","tags":["speech-to-text"],"userid":"72740","related":[],"score":-2,"answers":[],"acceptedanswer":false,"creationdate":"2014-09-08T23:22:24.890","favoritecount":0,"comments":["105289"]},"82204":{"body":"<p>I just bought a TrekStor Surftab Xiron 7.0, and I was trying to use it to test apps. It's the first time I do this, so maybe I'm just doing something wrong.\nI turned on the developer settings and the USB debug, connected the tablet to the computer and tried to install the Google drivers (The ones in the SDK), it didn't work. Then I tried to search for drivers on the TrekStor website, but they don't seem to have download links. I tried another couple of drivers I found online, but none of them worked.\nDoes anybody know where I can find working drivers? The Android version is 4.2.2 (Jelly Bean).</p>\n","viewcount":20,"dups":[],"title":"Drivers for TrekStor Surftab Xiron 7.0 3G","tags":["4.2-jelly-bean","tablet","usb-drivers","development"],"userid":"72741","related":[],"score":1,"answers":[],"acceptedanswer":false,"creationdate":"2014-09-08T23:20:53.827","favoritecount":0,"comments":[]},"65385":{"body":"<p>I read the Wikipedia article but it's not totally clear on how Android updates are pushed to devices. This is what I understood but am not certain which is correct so please add details to approve or disapprove my statements.</p>\n\n<p>Case A\nPhone has some service that periodically checks manufacturers servers (with some sort of polling) then if there is a new update it informs the user with a notification.\nUser than clicks the notification and downloads and installs update from manufacturers server</p>\n\n<p>Case B\nOS updates are just like ordinary software updates, there is a Google Cloud Messaging or similar broadcast receiver active on the phone and manufacturers just send message using this which shows user a notification.\nUser than clicks the notification and downloads and installs update from manufacturers server</p>\n\n<p>Case C\nPhone is notified about the updates by the mobile network (over-the-air provisioning (OTAP) like MMS and WAP settings) and than it shows a notification of the update.\nUser than clicks the notification and downloads and installs update from his/hers mobile network provider </p>\n\n<p>These all seem probable but consider these cases:\nWhat would happen if phone is not registered on network for a long time and internet is disabled (think of a tablet without internet access for example)?\nWhy are phones with same version (international version) of firmware getting new updates at different times on different networks?</p>\n\n<p>NOTE: I recently found out that CyanogenMod has OverTheAir updates in newer versions, how are they doing this, I doubt they have mobile network providers support?</p>\n","viewcount":271,"dups":[],"title":"How does Over-the-air updates (OTA) work","tags":["ota-update"],"userid":"52174","related":[],"score":2,"answers":["65390"],"acceptedanswer":false,"creationdate":"2014-03-13T13:52:27.597","favoritecount":1,"comments":["88773","88774","88777"]},"64479":{"body":"<p>I am using LG OPtimus L5 and when I use Google Now I speak into the mic ,but it just transfers what I say to web search. I want it to take some commands, like add this, call this person, etc., but it doesn't. Is it the version stock of Google Now that comes doesn't have these commands programmed, or do I need new version, etc.? Settings? Can't Google Now be used as a personal assistant like Siri?</p>\n","viewcount":57,"dups":[],"title":"Google Now not replying to voice commands, just parsing the words to search terms in browser","tags":["4.1-jelly-bean","voice-command","google","lg-optimus-l5"],"userid":"54872","related":[],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2014-02-27T20:27:52.880","favoritecount":0,"comments":["87421","87428"]},"64477":{"body":"<p>Android Phones in question: </p>\n\n<ul>\n<li><a href=\"http://www.gsmarena.com/xolo_q800-5531.php\" rel=\"nofollow\">Xolo Q800</a></li>\n<li><a href=\"http://www.gsmarena.com/xolo_q800_x_edition-5845.php\" rel=\"nofollow\">Xolo Q800 X-Edition</a></li>\n</ul>\n\n<p>I own X-Edition version &amp; aGPS is unable to find first-fix since the '<strong>day one</strong>'. When on Google-maps, location defaults to tower(GSM mobile Transceiver, BTS) co-ordinates.</p>\n\n<ol>\n<li><p>Installed <code>GPS Test</code> app, I noticed all packets received were portrayed as <strong>gray bars</strong> on the SNR graph of the utility.</p></li>\n<li><p>Installed <code>GPS Status</code> app, reset GPS data/cache &amp; downloaded it afresh. Still first-fix was nowhere in sight.</p></li>\n<li><p>Checked Xolo website for s/w upgrade, although there is an update to 4.2 most Xolo-Q800 are complaining about buggy update on various forums. I'm reluctant to upgrade or try out custom ROMs.</p></li>\n<li><p>Came across this <a href=\"http://android.stackexchange.com/questions/6981/how-can-i-fix-the-gps-on-my-samsung-galaxy-s\">Fixing the GPS on my Samsung Galaxy S?</a>. The procedure is totally different &amp; aGPS is a solution over here.</p></li>\n</ol>\n\n<p>I found <code>agps_profiles_conf.xml</code> file at location <code>/system/etc/</code>. It's full of aGPS server details.</p>\n\n<p>Can this be addressed? Please push me in right direction to fix this glitch.</p>\n\n<p>PS: I also own Sony Xperia SP, GLONASS works flawlessly on it.</p>\n\n<p>file <code>agps_profiles_conf.xml</code> content:</p>\n\n<pre><code>&lt;?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"yes\"?&gt;\n&lt;agps_profiles version=\"1\"&gt;\n\n    &lt;!--  slp_name: default slp name to be shown in AGPS\n    backup_slp_name_var: mui slp name variable in string.xml(optional) \n    address: SLP address\n    show_type: whether show this profile or not, 0:always show  1:only show in engineer mode  2:show according to current operator\n   --&gt;\n\n    &lt;!-- Spirent Lab --&gt;\n    &lt;agps_profile code=\"\"\n      slp_name=\"Lab - Spirent\"\n      backup_slp_name_var=\"Spirent\"\n      address=\"www.spirent-lcs.com\"\n      port=\"7275\"\n      tls=\"1\"\n      show_type=\"1\"\n  /&gt;\n\n    &lt;!-- R&amp;S Lab --&gt;\n    &lt;agps_profile code=\"\"\n      slp_name=\"Lab - RnS\"\n      backup_slp_name_var=\"RS\"\n      address=\"slp.rs.de\"\n      port=\"7275\"\n      tls=\"1\"\n      show_type=\"1\"\n  /&gt;\n\n    &lt;!-- CMCC Lab --&gt;\n    &lt;agps_profile code=\"\"\n      slp_name=\"Lab - CMCC\"\n      backup_slp_name_var=\"CMCC\"\n      address=\"218.206.176.50\"\n      port=\"7275\"\n      tls=\"1\"\n      show_type=\"1\"\n  /&gt;\n\n    &lt;!-- Andrew Lab --&gt;\n    &lt;agps_profile code=\"\"\n      slp_name=\"Lab - Andrew\"\n      backup_slp_name_var=\"Andrew\"\n      address=\"slp1acva.andrew.com\"\n      port=\"7275\"\n      tls=\"1\"\n      show_type=\"1\"\n  /&gt;\n\n    &lt;!-- Ericsson  Lab --&gt;\n    &lt;agps_profile code=\"\"\n      slp_name=\"Lab - Ericsson\"\n      backup_slp_name_var=\"Ericsson\"\n      address=\"172.22.1.100\"\n      port=\"7275\"\n      tls=\"1\"\n      show_type=\"1\"\n  /&gt;\n\n\n\n    &lt;!-- NOKIA--&gt;\n    &lt;agps_profile code=\"NOKIA\"\n      slp_name=\"NOKIA\"\n      backup_slp_name_var=\"NOKIA_SPL_Name\"\n      address=\"supl.nokia.com\"\n      port=\"7275\"\n      tls=\"1\"\n      show_type=\"0\"\n  /&gt;\n\n    &lt;!-- GOOGLE--&gt;\n    &lt;agps_profile code=\"GOOGLE\"\n      slp_name=\"GOOGLE\"\n      backup_slp_name_var=\"GOOGLE_SPL_Name\"\n      address=\"supl.google.com\"\n      port=\"7275\"\n      tls=\"1\"\n      show_type=\"0\"\n  /&gt;\n\n    &lt;!-- ORANGE 00--&gt;\n    &lt;agps_profile code=\"20800\"\n      slp_name=\"ORANGE 00\"\n      backup_slp_name_var=\"ORANGE00_SPL_Name\"\n      address=\"agpss.orange.fr\"\n      port=\"7275\"\n      tls=\"1\"\n      show_type=\"2\"\n  /&gt;\n    &lt;!-- ORANGE 01--&gt;\n    &lt;agps_profile code=\"20801\"\n      slp_name=\"ORANGE 01\"\n      backup_slp_name_var=\"ORANGE01_SPL_Name\"\n      address=\"agpss.orange.fr\"\n      port=\"7275\"\n      tls=\"1\"\n      show_type=\"2\"\n  /&gt;\n    &lt;!-- ORANGE 02--&gt;\n    &lt;agps_profile code=\"20802\"\n      slp_name=\"ORANGE 02\"\n      backup_slp_name_var=\"ORANGE02_SPL_Name\"\n      address=\"agpss.orange.fr\"\n      port=\"7275\"\n      tls=\"1\"\n      show_type=\"2\"\n  /&gt;\n\n    &lt;!-- CMCC--&gt;\n    &lt;agps_profile code=\"46000\"\n      slp_name=\"China Mobile AGPS server\"\n      backup_slp_name_var=\"CMCC_SPL_Name\"\n      address=\"221.176.0.55\"\n      port=\"7275\"\n      tls=\"1\"\n      show_type=\"2\"\n      app_id=\"ap0004\"\n      provider_id=\"221.176.0.55\"\n      default_apn=\"CMCC WAP\"\n      optional_apn=\"CMNET\"\n      optional_apn_2=\"\"\n      address_type=\"IPv4address:port\"\n  /&gt;\n\n    &lt;!-- CMCC2--&gt;\n    &lt;agps_profile code=\"46002\"\n      slp_name=\"China Mobile AGPS server\"\n      backup_slp_name_var=\"CMCC_SPL_Name\"\n      address=\"221.176.0.55\"\n      port=\"7275\"\n      tls=\"1\"\n      show_type=\"2\"\n      app_id=\"ap0004\"\n      provider_id=\"221.176.0.55\"\n      default_apn=\"CMCC WAP\"\n      optional_apn=\"CMNET\"\n      optional_apn_2=\"\"\n      address_type=\"IPv4address:port\"\n  /&gt;\n\n    &lt;!-- CMCC TD--&gt;\n    &lt;agps_profile code=\"46007\"\n      slp_name=\"China Mobile AGPS server\"\n      backup_slp_name_var=\"CMCC_SPL_Name\"\n      address=\"221.176.0.55\"\n      port=\"7275\"\n      tls=\"1\"\n      show_type=\"2\"\n      app_id=\"ap0004\"\n      provider_id=\"221.176.0.55\"\n      default_apn=\"CMCC WAP\"\n      optional_apn=\"CMNET\"\n      optional_apn_2=\"\"\n      address_type=\"IPv4address:port\"\n  /&gt;\n\n    &lt;!-- Telstra--&gt;\n    &lt;agps_profile code=\"Telstra\"\n      slp_name=\"Telstra\"\n      backup_slp_name_var=\"Telstra_SPL_Name\"\n      address=\"agps.supl.telstra.com\"\n      port=\"7275\"\n      tls=\"1\"\n      show_type=\"1\"\n  /&gt;\n\n    &lt;!-- Vodafone\n  &lt;agps_profile code=\"Vodafone\"\n      slp_name=\"Vodafone\"\n      backup_slp_name_var=\"Vodafone_SPL_Name\"\n      address=\"supl.vodafone.com\"\n      port=\"7275\"\n      tls=\"1\"\n      show_type=\"0\"\n      mcc_mnc=\"22010\"\n  /&gt;\n  --&gt;\n\n    &lt;!-- CHUAN HWA\n  &lt;agps_profile code=\"46692\"\n      slp_name=\"Chunghwa\"\n      backup_slp_name_var=\"CHUANHWA_SPL_Name\"\n      address=\"10.1.101.137\"\n      port=\"8025\"\n      tls=\"0\"\n      show_type=\"2\"\n  /&gt;\n    --&gt;\n\n    &lt;!-- China Unicom Test \n  &lt;agps_profile code=\"46001\"\n      slp_name=\"China Unicom\"\n      backup_slp_name_var=\"CU_SPL_Name\"\n      address=\"172.0.0.1\"\n      port=\"8025\"\n      tls=\"0\"\n      show_type=\"2\"\n  /&gt;\n  --&gt;\n\n    &lt;!-- Profile for CDMA--&gt;\n    &lt;cdma_profile name=\"CDMA1\"\n    mcp_enable=\"no\"\n    mcp_addr=\"10.199.2.165\"\n    mcp_port=\"6066\"\n    pde_addr_valid=\"no\"\n    pde_ip_type=\"0\"\n    pde_ip4_addr=\"11.11.11.11\"\n    pde_ip6_addr=\"001.002.003.004.005.006.007.008.009.010.011.012.013.014.015.016\"\n    pde_port=\"1111\"\n    pde_url_valid=\"no\"\n    pde_url_addr=\"www.mediatek.com\"\n  /&gt;\n\n    &lt;cdma_profile name=\"CDMA2\"\n    mcp_enable=\"no\"\n    mcp_addr=\"2.2.2.2\"\n    mcp_port=\"222\"\n    pde_addr_valid=\"no\"\n    pde_ip_type=\"1\"\n    pde_ip4_addr=\"22.22.22.22\"\n    pde_ip6_addr=\"001.002.003.004.005.006.007.008.009.010.011.012.013.014.015.116\"\n    pde_port=\"2222\"\n    pde_url_valid=\"no\"\n    pde_url_addr=\"www.mediatek.com2\"\n  /&gt;\n\n    &lt;cdma_profile name=\"CDMA3\"\n    mcp_enable=\"no\"\n    mcp_addr=\"3.3.3.3\"\n    mcp_port=\"333\"\n    pde_addr_valid=\"yes\"\n    pde_ip_type=\"1\"\n    pde_ip4_addr=\"33.33.33.33\"\n    pde_ip6_addr=\"001.002.003.004.005.006.007.008.009.010.011.012.013.014.015.226\"\n    pde_port=\"3333\"\n    pde_url_valid=\"no\"\n    pde_url_addr=\"www.mediatek.com3\"\n  /&gt;\n\n    &lt;!-- The following parameters are provided for customer to \n    configure A-GPS default value.\n--&gt;\n    &lt;!--  \n   agps_enable:(for CP/UP)\n      whether to permit enable A-GPS when the first boot up.\n      Available value: yes, no (case sensitive)\n\n   ca_enable: (for UP only)\n      enable or disable  the certification\n      Available value: yes, no (case sensitive)\n\n   cdma_agps_preferred: (for CDMA only)\n      when CDMA network and WCDMA network are available, which AGPS protocol you prefer?\n      Avaialbe value: 0 (WCDMA AGPS protocol is preferred)\n      Avaialbe value: 1 (CDMA AGPS protocol is preferred)\n      Avaialbe value: 2 (FORCE CDMA AGPS protocol)\n\n   cp_auto_reset: (for CP only)\n     enable or disable PMTK997_5 for CP reset flow\n     Available value: yes, no (case sensitive)\n\n   cp_gemini_pref_sim: (for CP only)\n      This parameter indicates which SIM you want to use for CP MO-LR and \n    it is used only when two available SIMs are ready.\n      Available value: 1 (it means use sim1 as prefrerred) \n      Available value: 2 (it means use sim2 as prefrerred if your platform supports two or more SIM)\n      Available value: 3 (it means use sim3 as prefrerred if your platform supports three or more SIM)\n      Available value: 4 (it means use sim4 as prefrerred if your platform supports four or more SIM)\n\n   cp_up_selection: (for CP/UP)\n      choose which agps protocol (CP/UP) you want to use for SI case if UP selected or MOLR case if CP selected\n      Available value: cp (Control Plane is used for MOLR, case sensitive)\n      Available value: up (User Plane is used for SI, case sensitive)\n\n   default_cdma_profile: (for CDMA only)\n      the default CDMA profile when device first boot up, please assign the name in cdma_profile name\n      Available value: CDMA1\n\n   default_profile:(for UP only)\n      the default profile when device first boot up. please assign the slp_name \n      Available value: NOKIA, GOOGLE \n\n   disable_after_reboot:(for CP/UP)\n      whether to enable A-GPS when device sencond boot up.\n      Available value: yes, no (case sensitive)\n\n   ecid_enable: (for UP only)\n      enable or disable eCID functionality for UP\n      Available value: yes, no (case sensitive)\n\n   gpevt: (for CP/UP)\n     enable or disable the GPEVT message forwarding functionality from AGPSD to MNL\n     Available value: yes, no (case sensitive)\n\n   log_file_max_num: (for UP only)\n      the max number of log file can be saved in /data/agps_supl/log.\n      Available vaule: 1~100\n\n   ni_request:(for CP/UP)\n      whether to accept the network request for SET's location \n      Available value: yes, no (case sensitive)\n\n   notify_timeout: (for UP only)\n      determine how long does A-GPS Dialog for notification type need to show\n      Available value: 0~20\n\n   roaming: (for UP only)\n      whether to use A-GPS when device is under roaming\n      Available value: yes, no (case sensitive)\n\n   si_mode:(for UP only)\n      set si mode to ma or mb\n      Available value: ma, mb (case sensitive)\n\n   supl_version: (for UP only)\n     choose which SUPL version you want to use\n     Available value: 1, 2\n\n   verify_timeout: (for UP only)\n      determine how long does A-GPS Dialog for verification type need to show\n      Available value: 0~20     \n  --&gt;\n    &lt;agps_conf_para\n    agps_enable=\"no\"\n    ca_enable=\"no\"\n    cdma_agps_preferred=\"0\"\n    cp_auto_reset=\"no\"\n    cp_gemini_pref_sim=\"1\"\n    cp_up_selection=\"up\"\n    default_cdma_profile=\"CDMA1\"\n    default_profile=\"GOOGLE\"\n    disable_after_reboot=\"no\"\n    ecid_enable=\"yes\"\n    gpevt=\"no\"\n    log_file_max_num=\"10\"\n    ni_request=\"no\"\n    notify_timeout=\"8\"\n    roaming=\"no\"\n    si_mode=\"mb\"\n    supl_version=\"1\"\n    verify_timeout=\"8\"\n  /&gt;\n&lt;/agps_profiles&gt;\n</code></pre>\n\n<p>I see default points to <code>GOOGLE</code>, <code>supl.google.com:7275</code>. Will changing port to <code>7276</code> has any significance? </p>\n","viewcount":415,"dups":[],"title":"aGPS on Xolo Q800(X-Edition) unable to find 'first-fix'","tags":["gps"],"userid":"33904","related":["6981"],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2014-02-27T19:18:35.600","favoritecount":0,"comments":["87415","87429","87430","87459"]},"64474":{"body":"<p>I have an Android Device running Android 2.3.7 . The device is locked due to exceeding pattern attempts. So now Android is prompting me to enter my gmail id and password. The problem is, the WiFi is turned off and the Data is turned off. </p>\n\n<p>I have found using this <a href=\"http://stackoverflow.com/questions/10282484/android-adb-turn-on-wifi-via-adb\">thread</a> that you it is possible to turn on wifi using ADB. But on my device, even usb debugging is not turned on. So, I cannot access the device using adb.</p>\n\n<p>So, I figured may be you can access device using adb in recovery mode ( my phone is not rooted ). But so far, in recovery mode, running <code>adb devices</code> does not list my device. </p>\n\n<p>Is it possible to access a device using adb if your usb debugging is turned off ( on a non rooted phone ) ? How about in recovery mode ?</p>\n","viewcount":5948,"dups":[],"title":"Using ADB with usb debugging disabled, and no root","tags":["wi-fi","adb","locked-out"],"userid":"54863","related":["12834","35847"],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2014-02-27T18:42:20.713","favoritecount":0,"comments":["87404","87408","87411","87413","87432","87507","87567","87569","87637","87638"]},"16277":{"body":"<p>Google Maps always shows me distance values for direction results / navigation in miles, although it does show me a scale on the map itself in metric units. I rather prefer to get my direction distances in metres/kilometres. Is there any way to achieve this in Google Maps? I searched a bit for this and suggestions seem to be to change locale in Settings > Language and Keyboard. Mine is currently set to English UK.</p>\n","viewcount":8398,"dups":[],"title":"How can I get Google Maps on Android to show metric units?","tags":["google-maps","localization"],"userid":"6973","related":[],"score":13,"answers":["26497","38477","16320"],"acceptedanswer":"26497","creationdate":"2011-11-30T01:30:02.593","favoritecount":4,"comments":[]},"51866":{"body":"<p>I have a Samsung Galaxy Ace GT-S5830L and I a few days ago downloaded and installed a custom ROM 4.2.2 the name of the file is (cm-10.1-20130503-NIGHTLY-cooper), It worked good at first, but then the apps didn't download it used a lot of memory, it crashed/hanged and it became annoying, So I'm trying to return to my previous original version 2.3.4, but It doesn't work... I made a backup with clockworks, but it doesn't work. I tried downloading one from the internet and using thor (i think that was its name) to install it, but it doesn't connect succeed anytime I try... I also tried with kies, but It didn't work, it just staid there for hours without doing anything...</p>\n\n<p>So what are my options to restore the original ROM?, I really need to get back to it, this version is just to buggy and annoying for me to stay with it.</p>\n","viewcount":365,"dups":[],"title":"How to get my original ROM working again?","tags":["samsung-galaxy-ace","rom"],"userid":"39973","related":[],"score":1,"answers":[],"acceptedanswer":false,"creationdate":"2013-08-24T07:26:49.650","favoritecount":0,"comments":["69936","69937","69946","69974"]},"51863":{"body":"<p>I bought a Bluetooth keyboard and it worked beautifully for 2 days. I then unpaired it to use on my friend's tablet and it worked amazingly well on hers as well. When I went to re-pair the keyboard to my Note 10.1 it shows up in the Bluetooth devices list, but the box to type in the code will not come up and there is no settings cog next to the name like there should be. So the keyboard has become useless as I can not for the life of me find a way to re-pair and connect it to my tablet. I am running android 4.1.2. Please help as I need this to work for school. I purchased this to take notes in class.</p>\n","viewcount":3146,"dups":[],"title":"Bluetooth keyboard won't re-pair to my Galaxy Note 10.1","tags":["bluetooth","external-keyboard","samsung-galaxy-note-10.1"],"userid":"39967","related":[],"score":2,"answers":["51897"],"acceptedanswer":false,"creationdate":"2013-08-24T04:00:04.863","favoritecount":0,"comments":["69924","69925","69927"]},"16272":{"body":"<p>My Windows 7 doesn't recognize my android phone. HTC Wildfire S</p>\n\n<p>Are there any updates of drivers that I need?</p>\n\n<p>If I use VMWare it works properly here's what it showed in VMWare. </p>\n\n<p><img src=\"http://i.stack.imgur.com/WA5IE.gif\" alt=\"\"></p>\n\n<p><strong>But here's what happens in device manager on my windows 7 on the same computer</strong></p>\n\n<p><img src=\"http://i.stack.imgur.com/7DNkz.gif\" alt=\"enter image description here\"></p>\n\n<p>Please help!! I've installed HTC Sync and tried connecting, my phone and the PC fails to connect. Help!!!</p>\n","viewcount":2761,"dups":[],"title":"Connecting Android to Windows 7 fails","tags":["windows","htc-wildfire"],"userid":"10102","related":[],"score":3,"answers":["16306","16363","16275"],"acceptedanswer":"16363","creationdate":"2011-11-29T21:02:42.520","favoritecount":0,"comments":["19203"]},"16278":{"body":"<p>After every call/message, my service provider (airtel) displays a popup which has the last call cost and current balance. Is there a way I could log them automatically and have the latest balance displayed as a widget in home screen? Is it possible to capture that using code? I am using a Galaxy S phone.</p>\n","viewcount":226,"dups":[],"title":"Is there a way to save pop up alerts?","tags":["samsung-galaxy-s","logging"],"userid":"3471","related":[],"score":7,"answers":["19858"],"acceptedanswer":false,"creationdate":"2011-11-30T01:40:27.320","favoritecount":0,"comments":["21337","22996","23002"]},"995":{"body":"<blockquote>\n  <p><strong>Possible Duplicate:</strong><br>\n  <a href=\"http://android.stackexchange.com/questions/8449/how-can-i-receive-phone-calls-through-wifi-on-an-android-phone\">How can I receive phone calls through WiFi on an Android phone?</a>  </p>\n</blockquote>\n\n\n\n<p>I have an unlocked Nexus One.  I barely use the voice function, mostly just use data.  However, I'd like to have the voice function just in case.  </p>\n\n<p>Is it possible to use something else (possibly VOIPish) to replace the voice plan that I am currently paying?  Perhaps Skype, or Google Voice or something else.  Has anyone had an experience with this?</p>\n\n<p>Thanks</p>\n","viewcount":173,"dups":[],"title":"Is it possible to have a phone without a voice plan?","tags":["voip"],"userid":false,"related":[],"score":3,"answers":["997","996","998"],"acceptedanswer":false,"creationdate":"2010-08-16T00:59:30.513","favoritecount":1,"comments":["45238"]},"36866":{"body":"<p>I have Samsung Galaxy Ace. </p>\n\n<p>I listen to music using headphones. If I press button on headphones, it pauses/plays music. It is really annoying that I need to take phone out of my pocket, unlock the screen, and skip a song. </p>\n\n<p>Is there a way to press a button on headphone, have it skip the current song and move to the next song like on Nokia phones? Is there any music player supporting this?</p>\n\n<p>Thanks in advance.</p>\n","viewcount":4746,"dups":[],"title":"Skipping audio track using headphones","tags":["music","samsung-galaxy-ace","headphones"],"userid":"26130","related":[],"score":0,"answers":["36868"],"acceptedanswer":false,"creationdate":"2013-01-04T10:09:31.397","favoritecount":0,"comments":["48255"]},"36862":{"body":"<p>I have a Samsung Galaxy S2, and a PC with Windows XP (I do not have WiFi). I want to transfer a 2.1 GB file from the computer to the phone. If I transfer the file as usual, I have the following error: </p>\n\n<blockquote>\n  <p>Failed to copy the selected files. Not enough free space on the\n  device.</p>\n</blockquote>\n\n<p>I think my problem is related to the type of the file system. What is the solution of my problem is there?</p>\n","viewcount":492,"dups":[],"title":"Transfer a large file from PC to smartphone","tags":["usb","file-transfer","file-system"],"userid":"26127","related":["27471"],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2013-01-04T09:08:15.933","favoritecount":1,"comments":["48233","48234","48236","48237","48247","48279","48443"]},"36863":{"body":"<p>I am trying to install BusyBox on panda board which has an ICS Android kernel.</p>\n\n<p>I used the steps below:</p>\n\n<ol>\n<li>Download binary file which supports the panda board</li>\n<li>Push it into <code>/system/busybox</code> folder</li>\n<li>Install the BusyBox command line tools on the target by executing the following commands on booted filesystem:<pre>\npc ./adb shell\ntarget$ cd /system/busybox\ntarget$ ./busybox --install .\ntarget$ ./sh  #here i am getting error like ./sh: precmd: not found</pre></li>\n<li>Save the original sh executable by renaming it, and then create a soft-link to BusyBox sh:<pre>target$ cd /system/bin\ntarget$ mv sh sh.android\ntarget$ ln -s /system/busybox/sh sh</pre></li>\n<li>Export<pre>\nexport PATH=$PATH:/system/busybox:/sbin:/vendor/bin:/system/sbin:/system/bin:/system/xbin</pre></li>\n</ol>\n\n<p><code>Step 3</code> is to install BusyBox, and <code>step 4</code> is to make BusyBox shell as default shell. But I am getting an error in the 3rd step. I want to make BusyBox shell as default shell, so I can run scripts on panda board.</p>\n\n<p>I appreciate any type of suggestions or solutions. Thanks in advance.</p>\n","viewcount":751,"dups":[],"title":"Installation of BusyBox on panda board on Android ICS kernel","tags":["4.0-ice-cream-sandwich","installation","busybox"],"userid":"26128","related":[],"score":0,"answers":["41600","52225"],"acceptedanswer":false,"creationdate":"2013-01-04T09:23:56.023","favoritecount":0,"comments":[]},"36860":{"body":"<p>My Android device screen got broken and I can't see what I'm doing. That's the only wrong thing with my device, the rest is apparently working OK. <strong>Is there any way to send my device screen to my computer?</strong><br>\nI don't want to work blindly anymore!</p>\n","viewcount":19215,"dups":[],"title":"My screen got broken, how to see on the computer what I'm doing in my device?","tags":["usb","screen","screenshots"],"userid":"12677","related":["36758"],"score":5,"answers":["56823","36861"],"acceptedanswer":"36861","creationdate":"2013-01-04T08:44:56.667","favoritecount":3,"comments":[]},"58891":{"body":"<p>I have a Nexus 7 (2013) which comes with five homescreens, however I want to remove most of these but I'm unable to find an option to do so. </p>\n\n<p>Most of the sites I've looked on so far suggest simply tapping and holding on the homescreen, but this prompts me to change my wallpaper.</p>\n\n<p>How can you remove homescreens on the Nexus 7 (2013)?</p>\n","viewcount":15513,"dups":[],"title":"How can you remove homescreens on the Nexus 7 (2013)","tags":["nexus-7","home-screen","4.4-kitkat"],"userid":"48087","related":[],"score":3,"answers":["71434","58892"],"acceptedanswer":"58892","creationdate":"2013-12-13T12:37:15.273","favoritecount":0,"comments":["79932","79933"]},"21270":{"body":"<p>Whenever I connect my device to my PC, it asks me on connection for the type of connection I want. If I select Samsung kies in the device it shows me connected, but in the kies it keeps connecting <em>(with spinner...)</em>.</p>\n\n<p>I have tried the solutions described on <a href=\"http://android.stackexchange.com/q/4322/16265\">this question</a> answers, but no avail.</p>\n\n<p>The problem from the mentioned question is different from what I'm experiencing, so I ask your ideas about this?</p>\n\n<h1>Relevant details</h1>\n\n<p>Device</p>\n\n<blockquote>\n  <p>Device : Samsung Galaxy i5801;<br>\n     OS : android 2.2;<br>\n     Baseband version : I5801DDJP2;<br>\n     Build Number : FROYO.DDJP6;<br>\n     Kernel Version : 2.6.32.9.</p>\n</blockquote>\n\n<p>kies Information</p>\n\n<blockquote>\n  <p>Interestingly when i go to help section of kies and click on kies information it freezes with some semi transparent layer on it so cant find its version <em>(need to close it from task manager)</em></p>\n</blockquote>\n\n<p>PC Information</p>\n\n<blockquote>\n  <p>Microsoft Windows Xp Service Pack 3</p>\n</blockquote>\n","viewcount":1401,"dups":[],"title":"Samsung Galaxy 3 (GT-i5801) is not being detected in Kies","tags":["2.2-froyo","samsung-kies","usb-connection-mode","samsung-galaxy-apollo"],"userid":"1034","related":["4322"],"score":1,"answers":["26486"],"acceptedanswer":false,"creationdate":"2012-04-02T07:04:00.913","favoritecount":0,"comments":["44096"]},"21276":{"body":"<p>Gingerbread comes with a cool SIP / VoIP integration. However, this feature drains the battery quite a bit.</p>\n\n<p>So I'm looking for a shortcut to enable SIP. So far, I always have to go deep into Settings to disable/enable it.</p>\n\n<p>Is there a cool shortcut, widget or app which helps to enable/disable the native SIP/VoIP-Feature of Android 2.3?</p>\n","viewcount":1562,"dups":[],"title":"Shortcut to enable / disable VoIP/SIP on Gingerbread?","tags":["2.3-gingerbread","voip","sip"],"userid":"7551","related":[],"score":7,"answers":["21303"],"acceptedanswer":"21303","creationdate":"2012-04-02T09:06:30.917","favoritecount":1,"comments":["24776","29782","29783","29784"]},"9096":{"body":"<p>Started getting this error in the last few days. It is stopping various things like Gmail, Market and Listen from syncing.</p>\n\n<p>I've read that it can be caused by bad data in records and that you should clear the data on the phone and then edit it on the server, but that's tricky if you don't know which item it is or even which app it is in.</p>\n\n<p>Any suggestions? I've switched it off/on several times. The error occurs when I do just about anything in Listen and can't get my Gmail up at all. Only thing I noticed is that one podcast was showing some error in Listen. Dropped it from the queue, but still getting the problem.</p>\n\n<p>HTC Tattoo on V1.6. Not rooted. No new apps added recently.</p>\n","viewcount":478,"dups":[],"title":"Process com,google.process.gapps stopped unexpectedly","tags":["sync"],"userid":"766","related":[],"score":5,"answers":["9521"],"acceptedanswer":"9521","creationdate":"2011-05-09T20:30:15.343","favoritecount":1,"comments":["10928","11135","11174","19274"]},"9091":{"body":"<p>I was playing with Android Bluetooth API on HTC Desire. Bluetooth was working fine, then suddenly it stopped. Now I cannot turn it on, even manually from the Settings menu. Here is something from Logcat,</p>\n\n<pre><code>01-06 07:34:37.208: ERROR/bluedroid(96): bluetoothd stop timed out\n01-06 07:34:47.215: ERROR/bluedroid(96): btld start timed out\n01-06 07:34:47.215: ERROR/bluedroid(96): $#$#$#$#$# Stopping btld because of starting btld fail...\n</code></pre>\n\n<p>What should I do? Please help!! :(</p>\n","viewcount":1015,"dups":[],"title":"HTC Desire - cannot turn Bluetooth on!","tags":["htc-desire","bluetooth"],"userid":"2284","related":[],"score":1,"answers":["10386"],"acceptedanswer":"10386","creationdate":"2011-05-09T19:06:32.480","favoritecount":0,"comments":["10925","10926","10927","10930"]},"9092":{"body":"<p>I'm sending my (unrooted) nexus s off repair under under warranty, and was just wondering if there any precautions I can take to limit the amount of personal info on the device, lest the engineers take a look through my contacts/emails etc.? (ideally without resetting phone to factory defaults)</p>\n\n<p>Main ideas I've had so far are:</p>\n\n<ul>\n<li>Associating the phone with a brand new google account and deleting the old ones</li>\n<li>Moving all sd card content to computer</li>\n<li>Clearing caches</li>\n</ul>\n","viewcount":182,"dups":[],"title":"Preparation steps for sending a phone back under warranty","tags":["privacy"],"userid":"4978","related":[],"score":1,"answers":["9094","9093"],"acceptedanswer":"9093","creationdate":"2011-05-09T19:15:45.670","favoritecount":0,"comments":[]},"49363":{"body":"<p>I want to install Cyanogenmod on my HTC One x+. In the <a href=\"http://www.cyanogenmod.org/\" rel=\"nofollow\">Official Website</a> there is no official release for HTC One X+. Can I install from the <a href=\"http://wiki.cyanogenmod.org/w/Endeavoru_Info\" rel=\"nofollow\">HTC One X Version</a> or the <a href=\"http://wiki.cyanogenmod.org/w/Evita_Info\" rel=\"nofollow\">HTC One XL Version</a> ?? and there is an <a href=\"http://forum.xda-developers.com/showthread.php?t=2067325&amp;\" rel=\"nofollow\">Unofficial release for HTC One X+ Cyanogenmod</a> or should I install this version ?? Is there any particular reason or defect why Cyanogen didn't release one officially for HTC One X+ ??</p>\n\n<p>Can you please give me the way to Install Cyanogenmod on my Phone ?? I'm a <em>Newbie</em></p>\n","viewcount":142,"dups":[],"title":"Install Cyanogenmod on HTC One X+","tags":["cyanogenmod","4.2-jelly-bean","custom-rom","htc-one-x+"],"userid":"28288","related":["49220"],"score":1,"answers":["49366"],"acceptedanswer":"49366","creationdate":"2013-07-18T11:48:22.877","favoritecount":0,"comments":["66601","66644"]},"49364":{"body":"<p>How do I get the WiFi toggle to show up in the notifications area on the Samsung Galaxy S4 - Verizon - 4.2.2 - Build VRUAME7?</p>\n\n<p><a href=\"http://i.stack.imgur.com/2YsXo.png\" rel=\"nofollow\"><img src=\"http://i.stack.imgur.com/EcJhs.png\" alt=\"Screenshot\"></a></p>\n\n<p>When I click on the pencil icon to edit it takes me here which doesn't scroll or allow me to edit the notifications except move the order around:</p>\n\n<p><a href=\"http://i.stack.imgur.com/R2Xs4.png\" rel=\"nofollow\"><img src=\"http://i.stack.imgur.com/Iszgp.png\" alt=\"Screenshot\"></a></p>\n","viewcount":287,"dups":[],"title":"Searching for WiFi toggle","tags":["wi-fi","4.2-jelly-bean","notification-bar","samsung-galaxy-s-4","verizon"],"userid":"28670","related":["49322"],"score":1,"answers":["49365"],"acceptedanswer":"49365","creationdate":"2013-07-18T12:04:18.353","favoritecount":0,"comments":[]},"22858":{"body":"<p>I just discovered about the command <code>adb push</code> and <code>adb pull</code> which supposedly lets people push and pull data from within the internal memory. Now my question is, can this be used on non-rooted phones? For example, i want to change the default camera shutter sound found on <code>/system/media/audio/camera/</code>, can I use adb to push and pull the audio files? And also, is this an act of rooting that could void my warranty? The main reason why I'm holding back on rooting was because I still had a full year before my warranty runs out.</p>\n","viewcount":2097,"dups":[],"title":"Does ADB push and pull work on non-rooted phones?","tags":["2.3-gingerbread","adb"],"userid":"14368","related":[],"score":3,"answers":["22861"],"acceptedanswer":"22861","creationdate":"2012-05-09T06:41:28.733","favoritecount":2,"comments":[]},"22852":{"body":"<p>If i understand correctly, exposure is the measure of lightness in a picture. In my phone, there are no settings by which I can set it manually (it does it automatically), I use to put my hand on camera and then remove it suddenly and take a shot to get higher exposure when needed. For low exposure I use to face camera towards a lights source then suddenly back to the point and take a shot.</p>\n\n<p>This is an ugly way to do it, is there any software or technique which can do that??</p>\n","viewcount":437,"dups":[],"title":"How to change Exposure when it is not possible","tags":["camera"],"userid":"5156","related":[],"score":-1,"answers":["25577","22917"],"acceptedanswer":false,"creationdate":"2012-05-09T01:32:38.783","favoritecount":0,"comments":["26808","27001","27008","27024"]},"2665":{"body":"<p>I want to report a bug / RFE with the official GMail app, but I'm finding it hard to find the right place to do this - all the forums / discussion groups I've found so far seem to be moribund (eg not much activity since 2008).</p>\n\n<p>What's the recommended place?</p>\n","viewcount":909,"dups":[],"title":"Where's the best place to report bugs with the GMail app?","tags":["gmail"],"userid":"464","related":[],"score":9,"answers":["6663","2666"],"acceptedanswer":"6663","creationdate":"2010-11-06T11:09:20.203","favoritecount":0,"comments":[]},"2661":{"body":"<p>I recently got HTC Wildfire from 3. On the webpage &amp; in shop they told me that I will be able to do Skype talks. After doing some research I found out that:</p>\n\n<ol>\n<li>HTC Wildfire is not officilly supported</li>\n<li>Some claims that installing the Skype from apk just works</li>\n</ol>\n\n<p>Hence I have following questions:</p>\n\n<ol>\n<li>Is it legal to install Skype in such way (according to UK or English law)? On one hand it is advertised feature of phone (or at least it looks like it is) on the other hand Skype is propertary.</li>\n<li>Which apk files I need?</li>\n</ol>\n","viewcount":1993,"dups":[],"title":"Can I get Skype on my HTC Wildfire in 3?","tags":["skype","htc-wildfire"],"userid":"537","related":[],"score":3,"answers":["3771","2708","2663"],"acceptedanswer":"2663","creationdate":"2010-11-06T02:06:03.573","favoritecount":2,"comments":["2510","2574","2581"]},"20986":{"body":"<p>I've been trying to reinstall the TouchWiz calendar on my Sidekick 4G with no luck.</p>\n\n<p>I got the calendar apk <a href=\"https://spreadsheets.google.com/spreadsheet/pub?hl=en_US&amp;hl=en_US&amp;key=0Ag43oj7rLQP4dENZcmhGN0ZUa3pHSENVeXlqUm5vV0E\" rel=\"nofollow\">here</a>, and put it on my sd card then moved it to system/app using RootExplorer, and once I clicked install I got the normal install prompts then a message that said \"Application not installed\".</p>\n\n<p>How can I fix this? Do I need to reinstall a stock ROM?</p>\n","viewcount":1465,"dups":[],"title":"Reinstall TouchWiz Calendar","tags":["calendar","samsung-touchwiz","t-mobile-sidekick-4g"],"userid":"9521","related":[],"score":0,"answers":["20989"],"acceptedanswer":"20989","creationdate":"2012-03-24T16:56:50.987","favoritecount":0,"comments":[]},"20984":{"body":"<p>Why does Play Store (formerly Android Market) mark for update twice in a row the same app to the same version?</p>\n\n<p>Here is a typical example of what happens. Yesterday I checked the My Apps section from Play Store, saw that version 3.5.1.1 of the Kindle app was available for update, and updated it. Today I checked the My Apps section again. Play Store showed as available for update the same 3.5.1.1 version of Kindle with the same release notes. I updated the app again.</p>\n\n<p>The same often happens with other apps, both on Android Market in the past and Play Store now. The second update is available the day after the first (I check daily for updates). In all cases the apps are correctly donwloaded and updated, and run fine. All my apps are set to manual update.</p>\n\n<p>I have an unrooted Nexus S running Android 2.3.6 and my phone carrier is Vodafone Italy. I have Play Store 3.4.7. The issue happens with both 3G and Wi-Fi.</p>\n","viewcount":1240,"dups":[],"title":"Why does Play Store update twice in a row the same app to the same version?","tags":["applications","google-play-store"],"userid":"11474","related":[],"score":1,"answers":["20994"],"acceptedanswer":false,"creationdate":"2012-03-24T16:29:34.873","favoritecount":1,"comments":["24437"]},"20985":{"body":"<p>Is there a way to have contact groups in this phone?\nI know it is possible on other phones, but this one does not give you the ability to make them.</p>\n","viewcount":202,"dups":[],"title":"Contact groups in 2.3.4 - xperia?","tags":["2.3-gingerbread","sony-ericsson-xperia-neo"],"userid":"9833","related":[],"score":0,"answers":["32507"],"acceptedanswer":"32507","creationdate":"2012-03-24T16:44:42.980","favoritecount":0,"comments":[]},"20980":{"body":"<p>I have Galaxy Tab 7 inch which has some installed apps and I don't have the APK files. I would like to move the apps to a new Galaxy Tab Plus 7 inch.</p>\n\n<p>Is there a way to move my installed apps from one device to another without reinstalling every app from Android Market?</p>\n","viewcount":397,"dups":[],"title":"Is there a way to move installed apps from one device to another?","tags":["applications"],"userid":"705","related":[],"score":3,"answers":["20981"],"acceptedanswer":"20981","creationdate":"2012-03-24T14:16:40.473","favoritecount":0,"comments":[]},"71801":{"body":"<p>I have a Serioux s101 tablet and when I'm connecting it to my TV(Toshiba P1300D) it works fine but my tablet's screen becomes blank. Is there a way to see both screens?</p>\n","viewcount":36,"dups":[],"title":"Cannot see tablet screen while it ts connected to the TV","tags":["4.1-jelly-bean","screen","hdmi"],"userid":"62528","related":[],"score":0,"answers":["72941"],"acceptedanswer":false,"creationdate":"2014-06-08T12:26:26.767","favoritecount":0,"comments":[]},"71802":{"body":"<p>Whatsapp has been nagging me for the past few days that I have to upgrade it to continue using it. With the Facebook acquisition and the Play Store no longer marking the permissions that are \"NEW\" separately, I'm on a toss up between an upgrade and an uninstall; I'm hoping further information about the permissions will help. </p>\n\n<p>First of all, does anyone know which permissions were added after Facebook's acquisition?<br>\nAnd among the permissions listed, what does \"find accounts on this device\" allow the app to do? Does \"receive text messages\" allow the app to read any existing or new incoming SMS messages? And as a minor curiosity, why would it need the \"retrive running apps\" list? </p>\n\n<p>Here's the permission list from the Play Store:</p>\n\n<blockquote>\n  <p>This app has access to:  </p>\n  \n  <p><strong>In-app purchases</strong>  </p>\n  \n  <p><strong>Device &amp; app history</strong>  </p>\n  \n  <ul>\n  <li>retrieve running apps  </li>\n  </ul>\n  \n  <p><strong>Identity</strong>  </p>\n  \n  <ul>\n  <li>find accounts on the device  </li>\n  <li>add or remove accounts  </li>\n  <li>read your own contact card  </li>\n  </ul>\n  \n  <p><strong>Contacts/Calendar</strong>  </p>\n  \n  <ul>\n  <li>read your contacts  </li>\n  <li>modify your contacts  </li>\n  </ul>\n  \n  <p><strong>Location</strong>  </p>\n  \n  <ul>\n  <li>approximate location (network-based)  </li>\n  <li>precise location (GPS and network-based)  </li>\n  </ul>\n  \n  <p><strong>SMS</strong>  </p>\n  \n  <ul>\n  <li>receive text messages (SMS)  </li>\n  <li>send SMS messages  </li>\n  </ul>\n  \n  <p><strong>Phone</strong>  </p>\n  \n  <ul>\n  <li>directly call phone numbers  </li>\n  </ul>\n  \n  <p><strong>Photos/Media/Files</strong>  </p>\n  \n  <ul>\n  <li>modify or delete the contents of your USB storage  </li>\n  <li>test access to protected storage  </li>\n  </ul>\n  \n  <p><strong>Camera/Microphone</strong>  </p>\n  \n  <ul>\n  <li>record audio  </li>\n  <li>take pictures and videos  </li>\n  </ul>\n  \n  <p><strong>Wi-Fi connection information</strong>  </p>\n  \n  <ul>\n  <li>view Wi-Fi connections  </li>\n  </ul>\n  \n  <p><strong>Device ID &amp; call information</strong>  </p>\n  \n  <ul>\n  <li>read phone status and identity  </li>\n  </ul>\n  \n  <p><strong>Other</strong>  </p>\n  \n  <ul>\n  <li>receive data from Internet  </li>\n  <li>read sync statistics  </li>\n  <li>prevent device from sleeping  </li>\n  <li>full network access  </li>\n  <li>control vibration  </li>\n  <li>run at startup  </li>\n  <li>view network connections  </li>\n  <li>connect and disconnect from Wi-Fi  </li>\n  <li>use accounts on the device  </li>\n  <li>create accounts and set passwords  </li>\n  <li>modify system settings  </li>\n  <li>read sync settings  </li>\n  <li>toggle sync on and off  </li>\n  <li>install shortcuts  </li>\n  <li>uninstall shortcuts  </li>\n  <li>read Google service configuration  </li>\n  <li>change your audio settings  </li>\n  </ul>\n</blockquote>\n","viewcount":1729,"dups":[],"title":"Help understanding Whatsapp's permissions","tags":["whatsapp-messenger","permissions"],"userid":"9754","related":["38369"],"score":0,"answers":["73245","72816","71807"],"acceptedanswer":"73245","creationdate":"2014-06-08T12:28:13.080","favoritecount":0,"comments":[]},"71806":{"body":"<p>My screen is broken and I need to copy files to computer. \"Turn on USB storage\" is displayed on screen but as it's broken I can`t click on it.</p>\n\n<p>My device is a Haier tablet.</p>\n","viewcount":18,"dups":[],"title":"How to transfer files to PC with damaged touchscreen","tags":["usb-storage"],"userid":"62534","related":[],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2014-06-08T12:49:41.863","favoritecount":0,"comments":["95490","96494"]},"71808":{"body":"<p>In my Micromax A47 Android Mobile, I lost all my contacts but when I tried to call my recent contacts through my mobile it's showing their name. When I tried  to see my sim and phone contacts its showing only two but I had more contacts. When I inserted that sim in another mobile ( Not Android OS ) it's showing all my contacts. Why it's showing like this? Does this happens because of my mobile problem or OS problem?    </p>\n","viewcount":79,"dups":[],"title":"Contact details are not showing in Micromax A47 Android Mobile?","tags":["contacts"],"userid":"37077","related":[],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2014-06-08T13:13:12.527","favoritecount":0,"comments":[]},"58273":{"body":"<p>I am having trouble with Bluetooth Low Energy (BT 4.0) on a Nexus 7.  I think I may have a 2012 model.</p>\n\n<p>How to tell if I have a 2012 or 2013 version of the Nexus 7?</p>\n","viewcount":815,"dups":[],"title":"How to distinguish Nexus 7 (2012) and Nexus 7 (2013)","tags":["nexus-7"],"userid":"47524","related":[],"score":16,"answers":["58276"],"acceptedanswer":"58276","creationdate":"2013-12-04T12:57:48.857","favoritecount":0,"comments":["79083","79086","79087","79179","89989"]},"58271":{"body":"<p>I'm trying to run OmniROM on Android Emulator but I'm facing some problems.\nReally, I'm able to build the nightlies (homemade) without problems and run the standard Android \"vanilla\" that comes with SDK, but I just don't know how to boot OmniROM on Android Emulator.</p>\n\n<p>I created an avd with Nexus 5 configurations, I copied all img files in <code>out/target/product/hammerhead</code> to <code>~/.android/avd/hammerhead.avd/</code> but when I run the emulator all I get is a black screen (monitor shows device offline).</p>\n\n<p>I also tried to run <code>make</code> in <code>~/android/omni</code> and then open emulator, same black screen and device offline.</p>\n\n<p>Could someone point me the right direction?</p>\n","viewcount":854,"dups":[],"title":"How to boot custom ROM on Android Emulator?","tags":["custom-rom","android-emulator"],"userid":"47519","related":["54674","4486"],"score":2,"answers":[],"acceptedanswer":false,"creationdate":"2013-12-04T12:20:12.750","favoritecount":0,"comments":["79112","79114","79192"]},"37804":{"body":"<p>My address book is not Google Contacts, but <a href=\"https://play.google.com/store/apps/details?id=cz.psencik.simple\" rel=\"nofollow\">Local Sync</a>. All of my contacts belong to it. <a href=\"https://play.google.com/store/apps/details?id=com.viber.voip\" rel=\"nofollow\">Viber</a> sees many of my contacts as Viber-enabled from LocalSync. However, I'm sure that it's missing some of them.</p>\n\n<p>By simply going to Viber's \"All\" contacts tab I see missing entries. These entries appear in stock <code>Contacts</code> app. Viber is up to date to the latest version. These people told me that they have Viber and I can get calls from them (however they are detected as <code>Unknown</code>)</p>\n\n<p>How can I let Viber actually see all contacts in my address book?</p>\n","viewcount":12571,"dups":[],"title":"Viber contacts out of date - not all contacts displayed in \"All\" tab","tags":["contacts","viber"],"userid":"7813","related":[],"score":3,"answers":["45051","38279","52258"],"acceptedanswer":"38279","creationdate":"2013-01-17T11:03:59.930","favoritecount":1,"comments":[]},"37803":{"body":"<p>How can I change camera button functionally and use it (or any other physical button) to pause/resume mp3 in a media player app? It is very important for my, because I want be able to pause/resume mp3 without looking to screen of the phone.</p>\n\n<p>Actually my phone (Xperia Mini Pro) has a hardware keyboard with 42 keys, but a few apps use this button as a keyboard shortcut (X-plore is one of few programs that uses hardware keyboard properly).</p>\n","viewcount":486,"dups":[],"title":"How can I use the camera button to pause/resume mp3?","tags":["keyboard","buttons","keyboard-shortcuts","mp3-player"],"userid":"14015","related":["1080"],"score":0,"answers":["37808"],"acceptedanswer":"37808","creationdate":"2013-01-17T10:58:42.243","favoritecount":0,"comments":["50885"]},"78604":{"body":"<p>I often work just with the smartphone (Galaxy Note 3, Android Kitkat 4.4, no root) without any computer.</p>\n\n<p><strong>After opening a landscape powerpoint-presentation with the smartphone, I want to print it in portrait mode (2 slides per page). Is there any solution?</strong></p>\n\n<p>If there is no direct printer app with Remote Print it would also be very nice if there would exist a conversion app to save a conversed ppp in portrait mode as a new pdf. I'm searching since several months and would be so thankful and happy if there would be a solution!</p>\n","viewcount":18,"dups":[],"title":"conversion printing app from landscape to portrait mode","tags":["applications","printing"],"userid":"68212","related":[],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2014-08-02T09:33:12.643","favoritecount":0,"comments":["101958"]},"78605":{"body":"<p>Can't connect ot SSH server via Connectbot.\nOn all attemps, after typing password I get answer 'unsuccessful attempt of \"password\" authorization' (translation).</p>\n\n<p>SSH Client connects good. And connection from PC is ok.</p>\n\n<p>What can be wrong?</p>\n","viewcount":23,"dups":[],"title":"Can't connect to servers via ConnectBot and ssh with password","tags":["samsung-galaxy-s-3","connection-issues","ssh"],"userid":"68740","related":[],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2014-08-02T09:40:30.180","favoritecount":0,"comments":["101959"]},"78600":{"body":"<p>all of a sudden when i choose an app or a file on my android 4.1.2 rooted LG Optimus F7 running simplicity ROM. I have lost the ability to choose a default app. When I tried going to settings>apps> clear defaults the button is there, but it's grey'd out not allowing clicking action. I've been rooted for a while and never had this happen before. It just happened out of no where.... anyone with any suggestions to help?</p>\n","viewcount":11,"dups":[],"title":"selecting default apps ability has disappeared","tags":["lg"],"userid":"68732","related":[],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2014-08-02T07:31:56.333","favoritecount":0,"comments":["101980"]},"3166":{"body":"<p>I have a tablet here that appears to be a NuPad / HAIPAD M701.</p>\n\n<p><img src=\"http://i.stack.imgur.com/nTSJy.jpg\" alt=\"My Tablet\"></p>\n\n<p>I have downloaded a .RAR with FWDN. When I run FWDN the \"Area Map\" always shows \"Unknown\".</p>\n\n<p>I have tried this on both a Windows 7 x64 and a Windows XP x32 machine. </p>\n\n<p>I have run the VTC driver installer on XP (it doesn't work on x64).</p>\n\n<p>What does it mean when Area Map says Unknown, and how do I fix it?</p>\n\n<p><img src=\"http://i.stack.imgur.com/hZCOA.png\" alt=\"FWDN is blank\"></p>\n","viewcount":2122,"dups":[],"title":"Why won't FWDN see my cheap Chinese tablet?","tags":["tablet"],"userid":"865","related":[],"score":1,"answers":["3205"],"acceptedanswer":"3205","creationdate":"2010-11-27T03:03:26.627","favoritecount":0,"comments":["35169"]},"3167":{"body":"<p>I have rooted my phone and currently have an older version of Cyanogen mod on my Sprint HTC Hero.  When I try to perform a backup using Rom Manager, the phone tries to reboot, but it never finishes booting.  Any ideas what is causing that and how I can back up my phone in order to upgrade to the latest version of Cyanogen? </p>\n","viewcount":299,"dups":[],"title":"Why does my phone keep getting stuck when performing a backup?","tags":["cyanogenmod","custom-rom","backup"],"userid":"23","related":[],"score":3,"answers":["3174"],"acceptedanswer":"3174","creationdate":"2010-11-27T07:14:03.183","favoritecount":0,"comments":[]},"3165":{"body":"<p>I need to send in my Garminfone to T-Mobile. I've rooted it and installed the 2.1 upgrade. The master reset doesn't restore it to 1.6. I know Super One Click will unroot it. Does anyone know how to revert back to 1.6? Thanks.</p>\n","viewcount":1134,"dups":[],"title":"How do I downgrade Android 2.1 to 1.6 on a Garminfone?","tags":["2.1-eclair"],"userid":"1233","related":[],"score":4,"answers":["5935","5925"],"acceptedanswer":false,"creationdate":"2010-11-27T00:53:44.487","favoritecount":0,"comments":["3109"]},"3163":{"body":"<blockquote>\n  <p><strong>Possible Duplicate:</strong><br>\n  <a href=\"http://android.stackexchange.com/questions/13461/how-to-gift-my-paid-application-to-some-people\">How to gift my paid application to some people</a>  </p>\n</blockquote>\n\n\n\n<p>I am an app developer and I have a paid app. I'd like to give one free copy to a specific person. Is this possible to do, and if so, how?</p>\n","viewcount":1426,"dups":[],"title":"How can I give away a free copy of my paid app?","tags":["google-play-store","paid-apps"],"userid":"1232","related":[],"score":12,"answers":["3164"],"acceptedanswer":false,"creationdate":"2010-11-26T22:36:05.727","favoritecount":0,"comments":[]},"27518":{"body":"<p>I have tried a factory reset and messed with all the settings, no luck. I even tried an external keypad app. It just keeps texting numbers when I use the samsung 3 x 4 keypad even when its on the ABC setting. Please help!!!</p>\n","viewcount":109,"dups":[],"title":"My Galaxy S has had a software upgrade and now it only types digits on the 3 x 4 keypad","tags":["keyboard"],"userid":"18059","related":[],"score":1,"answers":["27525"],"acceptedanswer":false,"creationdate":"2012-08-13T11:02:28.717","favoritecount":0,"comments":[]},"27519":{"body":"<p>I'm about to upgrade my Desire HD to ICS so that I can use the full disk encryption functionality.</p>\n\n<p>Does anyone know if its possible to still use the device as a removable disk when plugged in via a USB cable?</p>\n\n<p>If this is possible, am I right in assuming that the device will need to be unlocked with the PIN/password before being mounted (as this surely defeats the purpose of it, if you can access the SD card without unlocking)?</p>\n","viewcount":367,"dups":[],"title":"Android disk encryption - using as a removable device","tags":["4.0-ice-cream-sandwich","encryption"],"userid":"18061","related":[],"score":3,"answers":["37620"],"acceptedanswer":false,"creationdate":"2012-08-13T12:06:09.460","favoritecount":1,"comments":["33971","34193"]},"27516":{"body":"<p>Is it possible to download YouTube Videos on my New Samsung Galaxy Y android phone and have it stored in my SD card?</p>\n","viewcount":681,"dups":[],"title":"Download YouTube Videos from Mobile?","tags":["downloading","youtube","download-manager"],"userid":"16112","related":[],"score":6,"answers":["61733","27517"],"acceptedanswer":"61733","creationdate":"2012-08-13T10:38:41.347","favoritecount":2,"comments":["33958"]},"27510":{"body":"<p>I have got a new 8 GB SD card, but the catch is I have done the app2sd stuff. So what are the steps to be followed for the data and apps transfer without loss of anything.</p>\n\n<p>Will a simple copy and paste including all hidden files be enough?</p>\n","viewcount":718,"dups":[],"title":"Transfer of files and apps from old sd card to new sdcard","tags":["app2sd"],"userid":"18052","related":[],"score":3,"answers":["27513"],"acceptedanswer":"27513","creationdate":"2012-08-13T08:24:20.170","favoritecount":0,"comments":["33951","34031","34081","34784"]},"67121":{"body":"<p>I'm really confused about Android memory management.</p>\n\n<p>I just read <a href=\"http://lifehacker.com/5650894/android-task-killers-explained-what-they-do-and-why-you-shouldnt-use-them\">here</a> that killing apps by swiping from recent list or using task killers won't save your battery but drain more because this cause the OS to load the apps all over again next time you launch it or startup by themselves. They also said the actually thing we should worry is CPU usage, not RAM usage.</p>\n\n<p>Is that mean using too much RAM doesn't drain battery? As RAM is a hardware, holding something on it shouldn't drain battery? What if I was playing Temple Run and just press home button so the app will load faster next time I launch? Or should we just press back button until the app exit as we always do? I've also searched the internet but some said it would drain battery as it sits on RAM, some said there is no difference between RAM holds actual data or nothing. Should we let go of our app-killing habit and just feel relax? </p>\n\n<p>Some precise answers would be greatly appreciated. Thanks. :)</p>\n","viewcount":3068,"dups":[],"title":"Can using too much RAM drain battery?","tags":["battery","ram"],"userid":"55397","related":[],"score":13,"answers":["67180","67246","67132","67129","67126","67123"],"acceptedanswer":"67123","creationdate":"2014-04-08T07:34:33.647","favoritecount":2,"comments":["90753","91014"]},"67122":{"body":"<p>I needed to send SMS from my PC because my hands finger's are fat then normal, which does not fit with smartphone small tiny buttons while i type large sentences, it takes me while to complete a small sentence.</p>\n\n<p>So i searched and found this handy apps, i installed it, i got email i went to the web link but its not working</p>\n\n<p><a href=\"https://play.google.com/store/apps/details?id=com.texty.sms\" rel=\"nofollow\">https://play.google.com/store/apps/details?id=com.texty.sms</a></p>\n\n<p>Is it a Trojan horse, malware or its trusted apps?</p>\n\n<p>EDIT: this is the email</p>\n\n<pre><code>Welcome to MightyText!\n\nHi - Thanks for signing up with MightyText. You've joined over 1 Million people who use MightyText to text from their computer or tablet, using their Android phone number. To get you started, we've started syncing some recent text messages from your phone to MightyText. \n\nNOTE: You will still get SMS text messages on your phone as you normally would, and when texting on your phone you can keep using the same SMS texting app you've been using. \n\n\nGetting started - SMS from your computer now\n\nTo start texting from your computer, see instructions for your browser:\n\nGoogle Chrome:\n\n1 - Start Google Chrome browser, and install the MightyText Chrome Extension\n2 - Launch the MightyText Web App on your computer: https://mightytext.net/app\n\nFirefox:\n\n1 - Install this third party Firefox Add-on to get notifications. (Firefox doesn't support HTML Notifications natively)\n2 - NOTE: For Firefox Mac users only -- you'll also need to install Growl Notifications for Mac. Download free version of Growl here.\n3 - Launch the MightyText Web App on your computer: https://mightytext.net/app\n\nInternet Explorer, Safari, Opera\n\nFollow the steps here \n\n\nSMS from your Android Tablet\n\nOn your tablet, install using this link or search for mightytext on the Google Play Store from your tablet.\n\nAny questions? Just reply to this email.\n\nthank you and happy texting,\n\nThe MightyText Team\n follow us on Twitter | MightyText on Facebook\n</code></pre>\n","viewcount":310,"dups":[],"title":"MightyText isn't working. Is it malware?","tags":["sms","malware","mightytext"],"userid":"9531","related":[],"score":0,"answers":["67124"],"acceptedanswer":"67124","creationdate":"2014-04-08T07:38:21.560","favoritecount":0,"comments":["90614","90616","90617","90618"]},"66293":{"body":"<p>Why does my Samsung Galaxy S3 make a weird beep beep sound when I'm on a phone call? It started yesterday when the call started.</p>\n","viewcount":1041,"dups":[],"title":"Why is my Galaxy S3 making a weird beep beep noise during calls?","tags":["samsung-galaxy-s-3"],"userid":"57105","related":[],"score":1,"answers":["66321","66325"],"acceptedanswer":false,"creationdate":"2014-03-27T03:03:18.727","favoritecount":0,"comments":["89687"]},"49326":{"body":"<p>My Samsung Galaxy S4 (Verizon) running 4.2.2 (with the <a href=\"http://forum.xda-developers.com/showthread.php?t=2359090\" rel=\"nofollow\">VRUAME7</a> Build, so root is not an option currently) has both the WiFi and 4G/mobile data symbols in the notification bar, occasionally the mobile data symbol will go away, but it is there more often then not. </p>\n\n<p><img src=\"http://i.stack.imgur.com/ckcKV.png\" alt=\"enter image description here\"></p>\n\n<p>So I have read through <a href=\"http://forums.androidcentral.com/verizon-samsung-galaxy-s4/281533-4g-lte-symbol-wifi-symbol-both-displaying-when-wifi.html\" rel=\"nofollow\">this forum</a> and it says that by turning off the Caller Name ID app that this should remove the mobile data from the notifications. I have done this and it has not removed the symbol. </p>\n\n<p><strong>Questions</strong></p>\n\n<p>My phone does not <em>seem</em> to be using the mobile data, but I would like to know if it is in fact using the mobile data while connected to WiFi?</p>\n\n<p>Shouldn't/Does the mobile data turn off when connected to WiFi? </p>\n\n<p>If it does not turn off the mobile data, why not and can I fix this with <a href=\"https://play.google.com/store/apps/details?id=net.dinglisch.android.taskerm&amp;hl=en\" rel=\"nofollow\">Tasker</a>? That is a HUGE waste of battery!</p>\n","viewcount":1433,"dups":[],"title":"Is my phone using both WiFi and 4G?","tags":["wi-fi","4.2-jelly-bean","notification-bar","samsung-galaxy-s-4","mobile-network"],"userid":"28670","related":[],"score":0,"answers":["49331"],"acceptedanswer":"49331","creationdate":"2013-07-17T23:16:22.253","favoritecount":0,"comments":[]},"25854":{"body":"<blockquote>\n  <p><strong>Possible Duplicate:</strong><br>\n  <a href=\"http://android.stackexchange.com/questions/14628/whats-the-difference-between-an-aosp-rom-and-a-stock-rom\">What&#39;s the difference between an AOSP ROM and a stock ROM?</a>  </p>\n</blockquote>\n\n\n\n<p>When referring to Android ROMs or kernels (etc.), what is the difference between:</p>\n\n<ul>\n<li>AOSP (\"vanilla\")</li>\n<li>Stock</li>\n</ul>\n","viewcount":1726,"dups":["14628"],"title":"What is the difference between AOSP/vanilla and stock?","tags":["stock-android","vanilla-android"],"userid":"16994","related":["14628"],"score":3,"answers":["25856","25858"],"acceptedanswer":false,"creationdate":"2012-07-15T07:32:20.887","favoritecount":0,"comments":["31388","31397","31399","31507","31509"]},"43752":{"body":"<p>How to merge more than 5 contacts in the default contacts app? It gives the error saying \"Unable to join contact.Maximum number of joined contacts is 5\"</p>\n\n<p>And in gmail (browser) you can go to contacts section and merge them. But Here in the phone is there a way that I can join/merge the 2 contacts in gmail?</p>\n","viewcount":1808,"dups":[],"title":"Merging Contacts","tags":["contacts","4.1-jelly-bean"],"userid":"31853","related":[],"score":2,"answers":["43754"],"acceptedanswer":false,"creationdate":"2013-04-16T11:58:43.200","favoritecount":0,"comments":[]},"25851":{"body":"<p>I cant sync my business email on my Android mobile (a Galaxy S3 with Android 4.0.4).</p>\n\n<p>I tried to set up a business email account but all I get is <em>unable to connect to server</em> after I'm done with the set up. I'm pretty sure server and configuration details are correct.</p>\n\n<p>I'm trying to connect to Microsoft exchange 2010.</p>\n\n<p>Any idea how I can fix this issue?</p>\n","viewcount":1721,"dups":[],"title":"Galaxy S3 Active Sync is not working, any help?","tags":["exchange","connection-issues","active-sync"],"userid":"16996","related":[],"score":1,"answers":["42230"],"acceptedanswer":false,"creationdate":"2012-07-15T06:51:36.793","favoritecount":0,"comments":["35499"]},"25859":{"body":"<p>When I'm updating a custom ROM, there's always an instruction to <em>wipe the Dalvik cache</em>. I don't see a reason why this is necessarily.</p>\n\n<p>Watching the logcat while the system is booting I can clearly see that if an app changed, its <code>dex</code> file is invalidated and then regenerated. Yet still when I mention this anywhere I'm met with silence. As if not even some ROM developers are aware of this and they're only doing this because everyone else does.</p>\n\n<p>So the questions:  </p>\n\n<ul>\n<li><strong>Was there an Android version where Dalvik files were not invalidated during boot?</strong></li>\n<li><strong>Is there any advantage in doing this yourself, instead of letting the system do the work it's supposed to do?</strong></li>\n</ul>\n\n<p>An ideal answer would include references to the relevant code, so I would have a reference the next time this comes up.</p>\n","viewcount":55148,"dups":[],"title":"Why Do I Need to Wipe Dalvik Cache?","tags":["custom-rom","rom-flashing","dalvik"],"userid":"13391","related":[],"score":26,"answers":["25865"],"acceptedanswer":"25865","creationdate":"2012-07-15T12:04:42.153","favoritecount":4,"comments":[]},"81008":{"body":"<p>I have buyed an Alcatel One Touch POP 8 tablet and found, that it has only 2 GB internal storage instead of announced 4 GB(I have seen this on Android Settings page). What causes this problem? Can you offer me an app or something like this, that can show precisely the memory size?</p>\n","viewcount":89,"dups":[],"title":"Smaller internal memory, than expected","tags":["internal-storage","partition","internal-sd"],"userid":"71279","related":[],"score":0,"answers":["81009"],"acceptedanswer":"81009","creationdate":"2014-08-21T09:35:36.090","favoritecount":0,"comments":["103597","103598","103600","103602","103605"]},"29165":{"body":"<blockquote>\n  <p><strong>Possible Duplicate:</strong><br>\n  <a href=\"http://android.stackexchange.com/questions/15645/how-to-read-out-the-data-in-htc-desire-sms-backup-file\">How to read out the data in HTC Desire SMS backup file?</a>  </p>\n</blockquote>\n\n\n\n<p>I made a backup of my SMSes before doing a reset on my phone HTC Desire S (Android 2.3.5; HTC sense 3.0) to my SD card.</p>\n\n<p>Now I cant restore it, there are 6000+ SMSes in it, but the restore works for hours and doesn't go past the 2300 SMSes. I've even tried to let it run for hours.</p>\n\n<p>I've tried to open the backed up file with <a href=\"http://android.stackexchange.com/questions/15645/how-to-read-out-the-data-in-htc-desire-sms-backup-file\">SQLite Database Browser</a>, but it shows me an error saying that is not an SQLite database file.</p>\n\n<p>Is there any solution, how to open/restore the file? I tried many apps related to backup/restore category.</p>\n","viewcount":17,"dups":["15645"],"title":"How to open or fully import a previously made backup file of SMSes?","tags":["backup","restore"],"userid":"19121","related":["15645"],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2012-09-11T14:07:18.640","favoritecount":0,"comments":["36504","36505","38229","38230"]},"29168":{"body":"<p>Can Sony Xperia U be connected to a Y-Cable to provide extra power for OTG to avoid phone battery consumption?</p>\n\n<p>I'm asking this because the phone is already giving power ,will that make a short circuit or it's normal?</p>\n","viewcount":2488,"dups":[],"title":"can sony xperia u(st25i) 's otg be connected to external power?","tags":["2.3-gingerbread","battery","charging","usb-host-mode","sony-xperia-u"],"userid":"15788","related":[],"score":1,"answers":["29173"],"acceptedanswer":"29173","creationdate":"2012-09-11T14:25:04.660","favoritecount":1,"comments":[]},"66748":{"body":"<p>Currently galaxy nexus fits my image for all 5 of my screens, but I want my image to fill the whole screen, on every screen, so when u scroll between screens its the same background, and its the full image, not just parts of it. How can i Achieve this?</p>\n","viewcount":26,"dups":[],"title":"Set background to fill single screen on galaxy nexus","tags":["samsung-galaxy-nexus","screen","background"],"userid":"57614","related":[],"score":2,"answers":[],"acceptedanswer":false,"creationdate":"2014-04-02T13:48:09.167","favoritecount":0,"comments":["90184","90196","90232"]},"66749":{"body":"<p>In my car i have a 7\" analog monitor with two s-video inputs. One is connected to a reverse camera, and I would like to connect my cell phone to the second input in order to have to phone display on my monitor.\nAny suggestions?</p>\n","viewcount":28,"dups":[],"title":"connect my android mobile phone to 7\" analog monitor","tags":["connection-issues"],"userid":"57615","related":[],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2014-04-02T13:48:41.227","favoritecount":0,"comments":["90181"]},"74978":{"body":"<p>Does Nexus4 supports a use a USB pendrive (up to 64Gb)?</p>\n\n<p>If yes, with the USB OTG is I can navigate in the folders of the pendrive from the smartphone?</p>\n\n<p>Is it possible to copy file from pendrive to N4 and from N4 to pendrive?</p>\n","viewcount":76,"dups":[],"title":"Pendivre USB OTG on Nexus4?","tags":["nexus-4","insufficient-memory","usb-on-the-go"],"userid":"43163","related":[],"score":0,"answers":["74995","75015"],"acceptedanswer":"75015","creationdate":"2014-06-27T05:52:19.293","favoritecount":0,"comments":[]},"74976":{"body":"<p>There are good and bad choices available for the design of my system and MySQL seems to be the best available.  I need it to run client/server and support stored procedures &amp; triggers and a host of other features.  But I also need a database that will run single-user on mobile devices when off-line, then synchronize with the on-line server when reconnected to the Internet.  The only database provided with Android is SQLite - which doesn't even come close to providing the features required.  Also, installing MySQL on Android devices would mean that I wouldn't have to support any incompatibilities between two different databases.  I do not need other features installed (HTML server, PHP, etc)... just MySQL.  How can I get that installed (and with my apps(s)) and have it work easily and efficiently (and not have to root or install a new ROM on the device)?</p>\n","viewcount":44,"dups":[],"title":"How can I install MySQL on my Android device(s)?","tags":["applications","installation","internet","offline","app-data"],"userid":"64985","related":[],"score":0,"answers":["74981"],"acceptedanswer":false,"creationdate":"2014-06-27T04:54:28.433","favoritecount":0,"comments":[]},"66743":{"body":"<p>I've a Sony Xperia Z with Android 4.2.2 and need to lock my screen but keep the (voice/turn-byturn) navigation active. How can I achieve that?</p>\n\n<p>As it's currently, as soon as I lock the screen, GPS seems to be disabled instantely (at least when I unlock the phone, it needs to reaquire a GPS fix) and turn-by-turn navigation in Google Maps is instantly disabled.</p>\n\n<p>How can I keep both things activated?</p>\n\n<p>Background: I want to travel by bike without needing to look at my smartphone every few crossroads. Since I don't have a handlebar mount for my smartphone I've to keep it in one of the pockets of my pants. For some reason (I guess the fabric is too thin) the phone registers touches all the time, leading to 'butt-dials' and similiar things.</p>\n","viewcount":662,"dups":[],"title":"Lock screen but keep Google Maps turn-by-turn navigation and GPS active","tags":["4.2-jelly-bean","lock-screen","google-maps-navigation"],"userid":"23704","related":[],"score":2,"answers":["66756"],"acceptedanswer":"66756","creationdate":"2014-04-02T11:43:49.187","favoritecount":0,"comments":["90174","90176","90178","90195","90198"]},"66740":{"body":"<p>My <a href=\"https://en.wikipedia.org/wiki/Nexus_4\" rel=\"nofollow\">Nexus&nbsp;4</a> running on Android 4.4.2 (<a href=\"https://en.wikipedia.org/wiki/Android_version_history#Android_4.4_KitKat_.28API_level_19.29\" rel=\"nofollow\">KitKat</a>) uses mobile data even when the mobile data is turned off, and I turn on the <a href=\"http://en.wikipedia.org/wiki/Global_Positioning_System\" rel=\"nofollow\">GPS</a>. When the GPS is turned on I get the carrier message that data is used and the balance is reduced. Why is this happening?</p>\n","viewcount":301,"dups":[],"title":"Nexus 4 GPS uses mobile data even when data is turned off","tags":["nexus-4","4.4-kitkat"],"userid":"29120","related":["1522"],"score":1,"answers":["66742"],"acceptedanswer":"66742","creationdate":"2014-04-02T11:16:37.163","favoritecount":0,"comments":[]},"74975":{"body":"<p>As of lately i have not being able to update / install SDKs from Android SDK Manager.</p>\n\n<p>I get the following errors:</p>\n\n<pre><code>Preparing to install archives\nDownloading Android SDK Platform-tools, revision 20\nURL not found: C:\\Program Files (x86)\\Android\\android-studio\\sdk\\temp\\platform-tools_r20-windows.zip (Access is denied)\nDownloading Android SDK Build-tools, revision 19.1\nURL not found: C:\\Program Files (x86)\\Android\\android-studio\\sdk\\temp\\build-tools_r19.1-windows.zip (Access is denied)\nDownloading Google APIs (x86 System Image), Android API 19, revision 5\nURL not found: C:\\Program Files (x86)\\Android\\android-studio\\sdk\\temp\\google_apis_x86-19_r05.zip (Access is denied)\nDownloading Glass Development Kit Preview, Android API 19, revision 8\nURL not found: C:\\Program Files (x86)\\Android\\android-studio\\sdk\\temp\\google-gdk.zip (Access is denied)\nSkipping 'Android SDK Tools, revision 23'; it depends on 'Android SDK Platform-tools, revision 20' which was not installed.\nDone. Nothing was installed.\n</code></pre>\n\n<p>I have given full right permissions on the directory that the SDK manager is installed as well as the <code>temp</code> directory</p>\n","viewcount":920,"dups":[],"title":"URL Not Found Error in SDK Manager","tags":["android-sdk"],"userid":"11924","related":[],"score":0,"answers":["81026","82144"],"acceptedanswer":false,"creationdate":"2014-06-27T04:50:00.510","favoritecount":0,"comments":["97867","97875","97888","97897","97926"]},"74972":{"body":"<p>My phone misbehaved last evening and went on to show that my internal sd card is faulty. It gave me the option to format, which I did.</p>\n\n<p>After that I realised that some apps are in my internal sd card. Now I believe that some of those apps getting removed due to formatting is the reason why the phone is crippled. Now I can't see which apps/components are missing, for, by the time I open any app, the phone reboots. However the reason can be anything, I am not sure. I even tried removing and re-inserting the sd card. Please help.</p>\n\n<p>P.S.: I have now switched my phone off so that the battery doesn't get drained and I can debug the phone.</p>\n","viewcount":49,"dups":[],"title":"My Android JellyBean Lenovo A600e stuck repeatedly reboots when on","tags":["4.2-jelly-bean","reboot"],"userid":"24020","related":[],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2014-06-27T04:23:23.420","favoritecount":0,"comments":["97877","97923","97925"]},"74973":{"body":"<p>I've got a new phone (Samsung) and want to transfer my Whatsapp chat history from my old device to it. Is this possible, and how to do it? I have a Whatsapp backup file for that date.</p>\n","viewcount":141,"dups":[],"title":"Transfer Whatsapp chat history to new device","tags":["whatsapp-messenger","data-transfer"],"userid":"64987","related":["52684"],"score":1,"answers":["74994"],"acceptedanswer":false,"creationdate":"2014-06-27T04:40:34.283","favoritecount":0,"comments":["97876"]},"74970":{"body":"<p>In a 2012 thread about a case of OsmAnd being slow at rendering, one person advises this:</p>\n\n<blockquote>\n  <p>verify that you use Native Library (which definitely speed up rendering process)</p>\n</blockquote>\n\n<p>And the replies seems to imply it works:</p>\n\n<blockquote>\n  <p>I selected the Native Library and deleted Ind.cache file. It has nearly doubled the rendering speed of my map.</p>\n</blockquote>\n\n<p>I have the same problem of slow rendering, but I can't find the Native Library setting.</p>\n\n<p><strong>QUESTION:</strong> How to enable the Native Library in recent OsmAnd?</p>\n","viewcount":62,"dups":[],"title":"How to enable the Native Library in OsmAnd?","tags":["osmand"],"userid":"501","related":[],"score":1,"answers":[],"acceptedanswer":false,"creationdate":"2014-06-27T02:36:14.550","favoritecount":0,"comments":[]},"34572":{"body":"<p>I'd like to be able to use my Asus Transformer for a presentation using the HDMI out and I'd like to be able to draw on the screen over videos, pictures and over a powerpoint presentation.  Obviously I can't be drawing and navigating simultaneously with touch but I guess I'm envisioning an \"always on top\" floating dock or tool bar to toggle between the \"paint\" function and the normal touch input.  </p>\n\n<p>To be clear I'm not interested in specific \"drawing\" apps, I'm looking for the ability to draw persistently over any and every open app.  </p>\n\n<p>Is there an app or hack that will accomplish this?</p>\n","viewcount":1002,"dups":[],"title":"How can I draw over other apps?","tags":["drawing"],"userid":"137","related":[],"score":4,"answers":["44756","34574"],"acceptedanswer":"44756","creationdate":"2012-12-02T18:34:34.223","favoritecount":0,"comments":[]},"34573":{"body":"<blockquote>\n  <p><strong>Possible Duplicate:</strong><br>\n  <a href=\"http://android.stackexchange.com/questions/13448/is-my-phone-liable-to-explode-if-i-charge-it-with-a-charger-that-came-with-a-dif\">Is my phone liable to explode if I charge it with a charger that came with a different phone?</a><br>\n  <a href=\"http://android.stackexchange.com/q/4494/1465\">Are Android chargers universal in terms of power (Voltage, amperage)?</a>  </p>\n</blockquote>\n\n\n\n<p>As in, I know that all Droids have the micro USB charging connector. But what if I used a charger of HTC make, or for that matter of fact a charger of RIM (BlackBerry) make, to charge my Android phone (which is not of aforementioned brands) to charge my phone? Will this cause (short/long term) harm to my battery? If so, why and how? </p>\n","viewcount":2838,"dups":["13448"],"title":"Is using chargers of phone not meant for it harmful to the battery?","tags":["battery","battery-life","charging"],"userid":"14568","related":["13448","4494"],"score":2,"answers":["34579"],"acceptedanswer":"34579","creationdate":"2012-12-02T18:35:11.610","favoritecount":0,"comments":["44730"]},"81100":{"body":"<p>I am trying to pull data off a Droid Razr XT912 with a broken digitizer and screen from last summer which has been under pattern lock since then. I purchased a Micro-to-HDMI cable, which successfully displays the phone's unlock screen on my TV. I also purchased a Mini-to-USB cord so I could enter the pattern on the screen with a USB mouse. The phone, however, is not recognizing the mouse, regardless of whether it is wired or wireless.</p>\n\n<p>Interestingly, plugging the Mini-to-USB into my XT907 which I got to replace the old phone makes the mouse boot right up, even though that phone has its own pattern lock. </p>\n\n<p>I'm completely lost as to why the newer model cannot recognize the device when the older one can. My only guesses are as follows:</p>\n\n<ol>\n<li>The operating platform has been updated since last year to support the USB mouse connection. The XT907, having been in operation until April 2014, would have received the update while the XT912 was locked with no SIM since August 2013.</li>\n<li>The phone does not support a simultaneous connection to the HDMI (via Micro) and the USB Mouse (via Mini).</li>\n<li>The phone does not supply adequate power to the mouse. </li>\n</ol>\n\n<p>Any thoughts on how I might solve this riddle? If #3 is the culprit, does anyone know which adapter do I need to supply external power to a USB mouse in \"on-the-go\" mode? Last, is this a fool's errand and should I just ante up for a new digitizer?</p>\n\n<p>Thank you in advance! </p>\n","viewcount":25,"dups":[],"title":"Unlocking Droid XT912 with a Fully Broken Screen/Digitizer","tags":["usb-host-mode","usb-on-the-go","motorola-droid-razr"],"userid":"71408","related":[],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2014-08-22T18:22:54.687","favoritecount":0,"comments":["103770"]},"50382":{"body":"<p>I have all of my settings up all the way for haptic feedback and all the other notifications' vibration. About a month ago it stopped working all together. I have no idea why. I rely on vibration for phone ringers and stuff like that while in class or at work. If anyone knows why this is happening or can offer any suggestions I'd be glad to take them. </p>\n","viewcount":200,"dups":[],"title":"Vibration Not Working on Samsung Galaxy SIII","tags":["samsung-galaxy-s-3","vibration"],"userid":"38655","related":["35758"],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2013-08-01T23:58:48.510","favoritecount":0,"comments":["67824","67825","67830","67833"]},"50385":{"body":"<p>My phone (HTC One X) can't get internet when connected to my office wifi network.</p>\n\n<p>My office's wifi has no problem for me and my workers.</p>\n\n<p>By default, my phone uses DHCP mode when connected to local network. However, it adamantly picks the same IP that conflicts with another server in the network. In DHCP mode, I get no internet.</p>\n\n<p>I switch my phone to static IP (along with the correct gateway and DNS). Even with a good internal IP address (no conflict, I checked in the router), I still get no access to internet. I used Fing on Android to ping machines within the network successfully, but pinging any domain name at all would fail.</p>\n\n<p>I even tried switch DNS on my phone to 8.8.8.8 and it won't work. Pinging any external IP would fail</p>\n\n<p>I have no problem connecting to my home wifi (DHCP mode) that has the same router model.</p>\n\n<p>I'm out of ideas. Anyone?</p>\n","viewcount":287,"dups":[],"title":"Android on wifi - only local network, no internet","tags":["networking","wi-fi","htc"],"userid":false,"related":[],"score":0,"answers":["50386"],"acceptedanswer":false,"creationdate":"2013-06-26T10:27:50.150","favoritecount":0,"comments":["67820","67821","67822"]},"50388":{"body":"<p>I just purchased a used Nexus 4 online and it came with Android 4.2.2 (stock, as far as I can tell).  The phone does have an unlocked boot-loader and is was rooted.  I was able to un-root using supersu, but the OTA update to 4.3 still fails.  It starts to install, then it just shows a screen that says \"Error\" with a dead robot.</p>\n\n<p>Is there anything else I might need to do in order to allow this upgrade to go through?  I don't care about keeping the unlocked bootloader or anything.</p>\n","viewcount":439,"dups":[],"title":"OTA update to Jelly Bean 4.3 fails (Nexus 4)","tags":["nexus-4","ota-update","4.3-jelly-bean"],"userid":"17591","related":[],"score":1,"answers":["50392"],"acceptedanswer":"50392","creationdate":"2013-08-02T00:59:36.810","favoritecount":0,"comments":[]},"55353":{"body":"<p>When a Bluetooth keyboard is connected, Android doesn't show the soft keyboard in the lower part of the screen. This seems reasonable, but then, if the soft keyboard isn't visible, how does one start Google Voice Typing, an operation normally done with the \"microphone key\" on the soft keyboard?</p>\n","viewcount":135,"dups":[],"title":"How to start Google Voice Typing with a Bluetooth keyboard connected?","tags":["external-keyboard","voice-recognition"],"userid":"24836","related":[],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2013-10-18T20:49:22.797","favoritecount":0,"comments":["74185"]},"55352":{"body":"<p>I have purchased a BobjGear USB to RJ45 Compact Fast Ethernet Adapter made for Android Tablets, as well as a I-Tech USB 2.0 Fast Ethernet Adapter.</p>\n\n<p>I also purchased an Adapter Cable OTG for the Samsung Galaxy TAB Android 10.1, GT-P 7500.</p>\n\n<p>Both USB Ethernet Adapters come with a Driver (CD)</p>\n\n<p>I have installed the Drivers to my PC Windows 7 and also installed the Drivers to my wifes MAC.</p>\n\n<p>QUESTION IS: HOW DO I INSTALL THE DRIVERS ON MY TAB ? As it seems that I need the Driver in order to make it work.</p>\n\n<p>Is there anyone out there who can help me  ?</p>\n\n<p>Thank you in advance.</p>\n","viewcount":120,"dups":[],"title":"To connect a Samsung 10.1 Tab, Model GT-P 7500 to the Ethernet","tags":["samsung","samsung-galaxy-note-10.1"],"userid":"43527","related":[],"score":1,"answers":[],"acceptedanswer":false,"creationdate":"2013-10-18T20:17:23.493","favoritecount":0,"comments":[]},"55350":{"body":"<p>I have a Galaxy S4. I'm trying to copy some .ebook files from my PC to the eBooks folder on my phone. When I drag them into my phone's folder, the loading bar pops up, and then it just sits there forever. The file is never transferred, I never get an error message. My phone works just fine during this. I also get this issue if I try to move files between folders on the phone, i.e. a file that was already on my phone to another folder on my phone. </p>\n\n<p>I've used the task manager on my phone to close all applications. My phone's memory is far from being used up. The phone itself is only a couple of weeks old. I have the latest drivers and my phone is completely up-to-date. How can I troubleshoot this?</p>\n","viewcount":49,"dups":[],"title":"My phone just hangs when I try to copy ebook files from my PC. How can I troubleshoot this?","tags":["samsung-galaxy-s-4"],"userid":"4203","related":[],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2013-10-18T20:10:00.947","favoritecount":0,"comments":[]},"55355":{"body":"<p>I have a rooted Android 4.0 phone but the ringer volume and vibration strength for incoming calls is too low/weak for me.</p>\n\n<p>Can I increase the ringer volume and vibration strength beyond the currently allowed maximum level?</p>\n","viewcount":174,"dups":[],"title":"How to increase sound and vibration","tags":["4.0-ice-cream-sandwich","audio","vibration"],"userid":"43525","related":["1262","17319","19426","30527","28851","34952"],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2013-10-18T23:56:27.677","favoritecount":1,"comments":["74196","74197","74200"]},"55359":{"body":"<p>The speaker on my Nexus 4 suddenly stopped playing audio a few days ago. No sound at all, no music, ringtones, etc.</p>\n\n<p>Is this software problem or hardware?</p>\n\n<p>If I reinstall Android 4.3 again manually, will it unmute the speaker?</p>\n","viewcount":2317,"dups":[],"title":"Nexus 4 speaker no longer playing any audio","tags":["nexus-4","speaker"],"userid":"43548","related":[],"score":0,"answers":["78635","55383","71755","77005"],"acceptedanswer":false,"creationdate":"2013-10-19T08:25:56.837","favoritecount":0,"comments":["74199","74210","74215","74435","102005"]},"55358":{"body":"<p>Is there a way to skip songs/music with hardware buttons and without having to turn on the phones screen?</p>\n\n<p>A while ago, I had a phone with a custom ROM that allowed me to skip between songs by long pressing the volume buttons. Long press in VOL+ changed to the next track, and in VOL - to previous track. It was very useful, specially when I was driving, having my phone connected via a simple 3.5 plug to plug cable (to the aux. port), so i could just grab the phone, and press the keys without having to even look at it.</p>\n\n<p>Now, with my new phone, and stock ROM (4.1.2) , I don't have that option, so are there some apps or hacks that i could use to allow such functionality?</p>\n\n<p>I am already rooted, but there are (currently) no custom roms for my device (a motorola RAZR D3 XT919), </p>\n\n<p>so what is my best option?</p>\n","viewcount":333,"dups":[],"title":"How to skip music tracks with screen off?","tags":["4.1-jelly-bean","music-player","volume-control"],"userid":"20416","related":[],"score":0,"answers":["55576"],"acceptedanswer":false,"creationdate":"2013-10-19T04:52:02.150","favoritecount":0,"comments":["74191","74198"]},"6634":{"body":"<p>I have 2 Android (2.2) Galaxy Tab mini tablets with android 2.2 I am setting them up for show presentations.</p>\n\n<p>I put on both of them a directory filled with content. The directory is identical in both devices.</p>\n\n<p>On one I set up many home screen shortcuts to the files in that directory.</p>\n\n<p>How do i COPY all the short cuts from one device to the other ? Where are these shortcuts physically located ? in some kind of home application settings file ? where is it on the file system ?</p>\n","viewcount":827,"dups":[],"title":"how to copy android home shortcuts from one device to another?","tags":["2.2-froyo","home-screen","samsung-galaxy-tab","home-screen-shortcuts"],"userid":"13137","related":[],"score":4,"answers":["6640"],"acceptedanswer":false,"creationdate":"2010-11-17T09:07:24.083","favoritecount":0,"comments":[]},"6637":{"body":"<p>I is there an app wherein I can switch on my laptop camera from my andorid phone, and view the camera output on my phone. I am running windows 7 on my laptop.</p>\n","viewcount":321,"dups":[],"title":"How can I switch on my laptop's camera from my android device?","tags":["camera"],"userid":false,"related":[],"score":0,"answers":["68247","6638"],"acceptedanswer":false,"creationdate":"2011-03-03T20:46:07.980","favoritecount":0,"comments":[]},"24726":{"body":"<p>I <a href=\"http://android.stackexchange.com/questions/24041/is-there-an-android-calendar-with-limited-security-permissions/\">recently asked</a> about the availability of calendars with limited sandbox permissions, since I felt that most of them ask for access that is too wide, and hence are not as secure as I'd like. I also explored in that question what options were available to sync only to local computers, and to <em>definitively</em> prevent the device from syncing private data (calendar, contacts, todos) to Google. I plan to do my own backups locally.</p>\n\n<p>Side note: not syncing private data with Google is a little trickier than a new user would expect. This is because a Google account is required to use the marketplace, and once the phone has that account, it cannot be removed without a factory reset (at least in version 2.2). The sync to it <em>can</em> be disabled, but if one accidentally turns it on - easily done momentarily, in my view - contacts and calendar are likely to whoosh to the cloud in short order.</p>\n\n<p>One of course has to balance security requirements with usability, and my favourite calendars thus far (Business Calendar, aCalendar) do not offer their own private calendar repositories (they just work with any calendar sync provider). Ergo, they are equally at risk of accidental cloud synching as the stock Calendar application.</p>\n\n<p>So, I am wondering if rooting the device and installing a firewall would be the way to go? I was originally of the view that I could grant application permissions to Market/Play to contact Google, but not Calendar. However I see in the DroidWall FAQ, if one wishes to continue using the market after installing the firewall:</p>\n\n<blockquote>\n  <p>Enable the following applications:</p>\n  \n  <ul>\n  <li>\"Market\";</li>\n  <li>\"Media Storage, DRM Protected Content Storage, Download Manager\" and</li>\n  <li>\"Calendar Sync Adapter, Google Services Framework, Contacts Sync Adapter\"</li>\n  </ul>\n</blockquote>\n\n<p>It seems odd that, to use the market one needs to grant permissions to the latter, but would be entirely in keeping with Google's policy of making it hard to avoid their services. Any root owners here have thoughts as to whether it is possible? I'm hoping I can filter+block on <code>calendar.google.com</code> etc whilst permitting <code>play.google.com</code> - or similar.</p>\n\n<p>(I suppose the easiest answer to this Q is \"try it!\", but I'm looking for expertise before I risk rooting my phone).</p>\n","viewcount":2885,"dups":[],"title":"Can Google services be firewall-filtered (market yes, sync no)?","tags":["sync","root","firewall","google-play-services"],"userid":"15844","related":["8260","24041","8598"],"score":0,"answers":["24730"],"acceptedanswer":false,"creationdate":"2012-06-24T13:58:18.483","favoritecount":0,"comments":[]},"50653":{"body":"<p>Device: Samsung Galaxy S3</p>\n\n<p>A person I followed had a cool video they posted on Instagram, but then deleted it later. I was wondering if there was a backup of the video in the temp folder, since I watched it earlier?</p>\n","viewcount":129,"dups":[],"title":"Download or get the Instagram video I saw earlier","tags":["samsung-galaxy-s-3","instagram"],"userid":"38898","related":["22022"],"score":1,"answers":["65157","62059"],"acceptedanswer":false,"creationdate":"2013-08-06T03:00:35.807","favoritecount":0,"comments":["68175"]},"50654":{"body":"<p>I decided that I wanted to try out Ubuntu touch, but I don't want to put it on my current phone, so I decided to try to put it on my old Droid 3.</p>\n\n<p>I followed these instructions to root the phone:</p>\n\n<p><strong><a href=\"http://wiki.cyanogenmod.org/w/Install_CM_for_solana\" rel=\"nofollow\">How To Install CyanogenMod Android for Motorola Droid 3</a></strong></p>\n\n<p>All of the scripts were successful and I am able to run SafeStrap under root permissions. I installed the Recovery. BootStrap says that Safe System is not active.</p>\n\n<p>When I reboot, the Safe Strap screen pops up. I press the menu button to start the recovery and I get a black screen. I noticed that when it starts up it says <code>SafeStrap: Disabled</code> in red.</p>\n\n<p>How can I get SafeStrap to work?</p>\n","viewcount":255,"dups":[],"title":"Why is SafeStrap disabled on my Motorola Droid 3 (Verizon)?","tags":["rooting","motorola-droid-x"],"userid":"32427","related":[],"score":1,"answers":[],"acceptedanswer":false,"creationdate":"2013-08-06T03:43:24.920","favoritecount":0,"comments":[]},"24728":{"body":"<p>I've noticed that Verizon offers 2 versions of the Galaxy S3: 16 GB and 32 GB. I'm trying to determine if it would be worthwhile to get the larger storage.</p>\n\n<p>Is the device storage an extension of the primary device memory, or is it treated as a separate memory area that can only be used for data storage (similar to an SD card) but not for running programs?</p>\n","viewcount":5847,"dups":[],"title":"How is the internal storage of the Galaxy S III allocated?","tags":["internal-storage","samsung-galaxy-s-3"],"userid":"8202","related":[],"score":1,"answers":["24732","24772","24777","24796"],"acceptedanswer":"24777","creationdate":"2012-06-24T14:03:46.867","favoritecount":1,"comments":[]},"50656":{"body":"<p>Have been playing about flashing modded firmware to an older android device which has an arm v6 processor and have been disappointed in not being able to view any media through bbciplayer either through the app or online.</p>\n\n<p>Checking out the bbc help pages regarding this is confusing as they confirm bbciplayer should run on android 2.1 and up.  The fairly recent addition of needing the bbcmediaplayer installed to play any bbc media through either the bbciplayer app or their website means that this device appears to be unable to play bbciplayer media at all.  After researching on bbc's help pages this is due to bbciplayer using adobe air 3 for which demands arm v7 minimum specification.</p>\n\n<p>Is it possible to run adobe air 3 on an arm v6 device?  </p>\n","viewcount":77,"dups":[],"title":"Is it possible to get bbciplayer working on an arm v6 device?","tags":["media-player","adobe-air","armv6"],"userid":"38783","related":[],"score":1,"answers":["50679"],"acceptedanswer":false,"creationdate":"2013-08-06T03:57:01.467","favoritecount":0,"comments":[]},"61215":{"body":"<p>I'm trying to connect to my home's wireless router with my new <strong>LG G2 (running version 4.2.2)</strong> and it keeps saying \"Obtaining IP address...\" for three minutes, then momentarily saying \"Saved, secured\", before cycling through all over again. It does this about 5 times and then eventually stops trying and says \"Avoided poor Internet connection\".</p>\n\n<p>It seems that the problem is only affecting my Android device. My laptop can connect; my mother's and girlfriend's iPhones can both connect; and this is the second Android device I've had with this connection issue (my old Droid 4 had it too).</p>\n\n<p>I can't figure out what the problem could be. I've tried changing the broadcast channels on the router with no luck, and I'm too worried to mess around with the network settings much more, for fear of messing up the network for more devices.</p>\n\n<p>On top of this, with the recent phone upgrade and data transfer, I'm at 90% of my monthly data usage, with half a month yet to go. :[</p>\n\n<p>What can I do to connect to the wireless, short of getting a new phone or new router?</p>\n\n<p><em><strong>[EDIT 1]</em></strong> OK. So now I've tried using my desktop as a mobile hotspot, and this is still not working. Perhaps the most troubling part is that it isn't working even when I bypass the router altogether, and plug the computer directly into the modem. It even failed both with and without encryption.</p>\n\n<p><em><strong>[EDIT 2]</em></strong> Here is a screenshot of the Advanced Wi-Fi settings, as requested.</p>\n\n<p><a href=\"http://i.stack.imgur.com/oGt2U.png\" rel=\"nofollow\"><img src=\"http://i.stack.imgur.com/oGt2Um.png\" alt=\"advanced wi-fi\"></a><br>\n<sup>Click image for larger variant</sup></p>\n","viewcount":5271,"dups":[],"title":"\"Avoided poor Internet connection\" on LG G2","tags":["wi-fi","connection-issues","lg-g2"],"userid":"50926","related":[],"score":1,"answers":["61217"],"acceptedanswer":false,"creationdate":"2014-01-15T03:49:33.533","favoritecount":0,"comments":["93372"]},"61210":{"body":"<p>I lost my phone recently and I found the app AndroidLost which allows you to download the app via desktop <em>to</em> your lost phone, by downloading it on your computer and texting via SMS message.  If the phone becomes registered, you can access the website AndroidLost.com and track your phone.  But if your phone battery is dead, will it still download AndroidLost?  PLEASE HELP!</p>\n","viewcount":6,"dups":[],"title":"Can you remotely download AndroidLost to your phone if your phone battery is dead?","tags":["samsung-galaxy-s-3","lost-phone"],"userid":"50925","related":[],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2014-01-15T02:16:25.237","favoritecount":0,"comments":[]},"61213":{"body":"<p>I'm using K-9 mail on my Nexus 10 tablet. It is a good client, but it does not fetch images in HTML messages for offline reading. It has a setting for fetch images, which I have set, but I'm not really sure what it does. Images in HTML messages are still not fetched. At the moment the message is displayed the images are loaded. If there is no Internet connection at that time, there are no images.  </p>\n\n<p>Is there any Android email client that can be configured to fetch images when fetching the messages?</p>\n","viewcount":72,"dups":[],"title":"Is there any Android email client that fully supports offline reading?","tags":["email","images","html"],"userid":"2583","related":[],"score":1,"answers":[],"acceptedanswer":false,"creationdate":"2014-01-15T02:44:55.397","favoritecount":0,"comments":[]},"61212":{"body":"<p>If your phone is dead, will it still download apps that you try to remotely install thru desktop?  I'm trying to download a tracking device to find my phone but I think the battery is dead and I don't know if it'll still remotely install onto my phone.</p>\n","viewcount":102,"dups":["61210"],"title":"Can you remotely install apps to your phone if your phone is dead?","tags":["lost-phone"],"userid":"50925","related":["61210"],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2014-01-15T02:34:01.360","favoritecount":0,"comments":["82904"]},"24535":{"body":"<p>I have a Galaxy S2 running on ICS. It is not rooted.</p>\n\n<p>Recently it keeps crashing. No app will start with the exception of lock screen and the notification curtain. My menu button does not work so during my research on this problem the \"download GO Launcher and set as default > clear data\" solution will not work. I want to keep this post as short as possible so here are some links on my <em>first</em> problem:</p>\n\n<p><a href=\"http://forum.xda-developers.com/showthread.php?t=1417244\" rel=\"nofollow\">http://forum.xda-developers.com/showthread.php?t=1417244</a></p>\n\n<p><a href=\"http://forum.xda-developers.com/showthread.php?t=1541223\" rel=\"nofollow\">http://forum.xda-developers.com/showthread.php?t=1541223</a></p>\n\n<p>(These two posters fixed their problems due to their menu buttons being able to function).</p>\n\n<p>Looks like my only fix is to do a factory reset (though if anyone has a few suggestions, please post them!).</p>\n\n<p>Unfortunately not being able to access any apps means <strong>I cannot do back ups</strong>. I want to restore my phone to the pre-crash state as much as possible. I have a valuable memo on the \"Memo\" app that comes with TouchWiz. Can this be done?</p>\n\n<p>EDIT: Forgot to mention that it's best not to void my warranty by flashing or rooting. My S2 has some screen burn ins that I need to get fixed and they'll be checking.</p>\n","viewcount":7374,"dups":[],"title":"All of my launchers keep crashing, my only fix is to factory reset. I need help for backing up valuable data","tags":["samsung-galaxy-s-2","backup"],"userid":"6161","related":[],"score":4,"answers":["24545","33343"],"acceptedanswer":"24545","creationdate":"2012-06-21T11:56:05.400","favoritecount":3,"comments":["29223","29237"]},"22075":{"body":"<p>Many apps on my phone, especially browsers, have awful touch accuracy. I wondering whether touch accuracy was based more on the design of the app, or the hardware of the phone. Some apps work better than others, but I also found that some phones had better touch accuracy for the same kinds of apps. </p>\n\n<p>Does touch accuracy depend more on the phone's hardware than the design of an app?</p>\n","viewcount":177,"dups":[],"title":"Is touch accuracy based on a phone's hardware or the application?","tags":["touchscreen"],"userid":"13634","related":[],"score":3,"answers":["22076"],"acceptedanswer":"22076","creationdate":"2012-04-21T05:06:52.183","favoritecount":0,"comments":["25768"]},"22077":{"body":"<p>If the GPS is enabled (in the notification view at the top, the GPS icon is enabled), but the app doesn't use it, does it drain battery? I understand that GPS drains battery because it requires a different component to be charged up. Or does the fact that the GPS is enabled only mean that the App can use it?</p>\n","viewcount":1297,"dups":[],"title":"When the GPS is enabled but not in use, does it drain battery?","tags":["gps","battery-life"],"userid":"14454","related":[],"score":6,"answers":["22080","22079"],"acceptedanswer":false,"creationdate":"2012-04-21T07:24:48.827","favoritecount":2,"comments":[]},"22070":{"body":"<p>I just got the HTC One X and I cannot find a way to select all my emails and delete them in one go. I have to select them one by one the delete them, after which I have to repeat the process again the clear the trash bin. I had the HTC Desire before and that did it with no problems.</p>\n\n<p>Has anyone found a solution or am I missing something?</p>\n","viewcount":2854,"dups":[],"title":"How can I delete multiple emails on the HTC One X?","tags":["email","htc-one-x"],"userid":"14451","related":[],"score":0,"answers":["22441"],"acceptedanswer":false,"creationdate":"2012-04-20T21:09:07.813","favoritecount":0,"comments":["26179"]},"22073":{"body":"<p>I have a brand new Galaxy Tab 10.1 and I can't figure out how I remove some of the desktop panes.</p>\n","viewcount":1452,"dups":[],"title":"Removing desktop panes on Galaxy Tab 10.1","tags":["samsung-galaxy-tab-10","3.1-honeycomb"],"userid":"8943","related":["4594","4676"],"score":0,"answers":["22081"],"acceptedanswer":false,"creationdate":"2012-04-21T02:10:12.540","favoritecount":0,"comments":["25952"]},"31926":{"body":"<p>For last 2 days, I am trying to connect my new Xperia-Tipo phone to PC but unable to connect. My PC's OS is Windows XP - SP3. </p>\n\n<ol>\n<li>When I connect to PC, it is asking for PC companion installation.  But when I double click on Setup.exe its doing nothing.</li>\n<li>So I downloaded PC companion (Version 2.1) and I tried to connect, but its not detecting my phone. </li>\n</ol>\n\n<p>In trouble shooting its saying please check its properly connected or not. Yes its connected and my phone is charging too. I switch off my phone &amp; tried its waste of time. If i see in my computer its not detecting any drive for USB.</p>\n","viewcount":18850,"dups":[],"title":"Unable to connect Xperia-Tipo to PC?","tags":["sony-xperia-tipo"],"userid":"22510","related":[],"score":3,"answers":["39018","31938","35937","36756","35861"],"acceptedanswer":false,"creationdate":"2012-10-17T04:24:35.853","favoritecount":0,"comments":[]},"31925":{"body":"<p>Samsung Galaxy Nexus (Verizon) with Android 4.1.1 (unrooted).</p>\n\n<p>I seem to be having unusually frequent reboots of my phone; sometimes multiple times in a day. Certainly much more frequent than with Ice Cream Sandwich (4.0.4).</p>\n\n<p>Additionally, my battery life seems to be lower since the upgrade from 4.0.4. (It might be my imagination, but it might be running hotter than I remember, too.)</p>\n\n<p>I've been looking for some common denominator but I'm baffled.</p>\n\n<p>What can I do to try to find out what is causing these crashes?</p>\n\n<p>(No suggestions that require rooting, please.)</p>\n","viewcount":511,"dups":[],"title":"How to track reboots in Jelly Bean","tags":["4.1-jelly-bean","reboot","crashes"],"userid":"267","related":[],"score":5,"answers":["35589"],"acceptedanswer":false,"creationdate":"2012-10-17T04:01:18.790","favoritecount":1,"comments":["46263","46264","46267","50789"]},"31923":{"body":"<p>I have a Samsung Galaxy Ace, running on its official CM7 ROM. I have an 8gb sd card and I just want to make a clean install of everthing starting with the sd card's partition.</p>\n\n<p>I've had sd-ext partition troubles when I partitioned my sd card using CWM, so I went and did it using GParted. Currently it has:</p>\n\n<ol>\n<li>6+ Gb FAT32 primary partition</li>\n<li>1 Gb EXT4 logical partition</li>\n</ol>\n\n<p>It gets recognized by my laptop, no problem. But my phone won't even detect it. Any ideas why this is happening? Thanks.</p>\n","viewcount":681,"dups":[],"title":"Why is it that whenever I partition my sd card outside CWM it doesn't get recognized by my phone?","tags":["cyanogenmod","external-sd","partition","ext4","sd-ext"],"userid":"10520","related":[],"score":1,"answers":["32525"],"acceptedanswer":"32525","creationdate":"2012-10-17T03:00:08.263","favoritecount":0,"comments":[]},"31921":{"body":"<p>I have an HOTT MD500 MID. Previously, when I plugged this into my computer, <code>Thunar</code> found two storage spaces, the first being the microSD card, the second, another storage space inside the device. Recently, I wanted to reinstall the device, so I first used <code>gparted</code> to reformat both of these storage spaces to <code>FAT32</code> filesystems, then used the factory reset option on the device.</p>\n\n<p>During the reformatting with <code>gparted</code>, and error appeared preventing me from reformatting the internal storage. Now, when I plug the device into my computer, Thunar no longer can see the internal storage space. Also, when I go to <code>Settings</code> --> <code>SD card &amp; MID storage</code>, Internal Flash Storage reports Available Space 0, while the MID system storage reports Available Space 79 MB.</p>\n\n<p>I found some similar threads at <a href=\"http://android.stackexchange.com/questions/8485/formatting-internal-storage-harmfull\">Formatting internal storage harmfull?</a>, which did not work for me, and <a href=\"http://android.stackexchange.com/questions/19912/missing-internal-flash-memory-and-sd-card-does-not-mount\">Missing internal flash memory and SD card does not mount</a>, which provides instructions specific to another model, but which I do not know how to adapt these instructions to my model of MID. Using the factory reset option in my device did not seem to help.</p>\n\n<ul>\n<li>Why is the internal storage no longer visible in <code>Thunar</code>? How can I restore it to its original state?</li>\n<li>Is that normal that Internal Flash Storage is reported as 0? Will this give me any problems?</li>\n</ul>\n","viewcount":5857,"dups":[],"title":"How to restore internal flash storage after reformatting?","tags":["internal-storage","factory-reset"],"userid":"11219","related":["8485","19912"],"score":3,"answers":["47411","32439","32109"],"acceptedanswer":"32109","creationdate":"2012-10-17T02:00:02.517","favoritecount":0,"comments":["41366","41445"]},"77774":{"body":"<p>So is there no way for me to move a file from internal memory to the external SD card in Android KitKat version? I used to use Wifi Transfer style apps to move stuff from my laptop to the internal memory, and then move them to the SD Card using one of the many explorer apps for Android. Is this not possible at all anymore??</p>\n\n<p>Seems like an uncalled for restriction!</p>\n","viewcount":159,"dups":["64381"],"title":"Writing to external SD card in KitKat","tags":["4.4-kitkat"],"userid":"67863","related":["64381"],"score":-1,"answers":["77776"],"acceptedanswer":"77776","creationdate":"2014-07-21T22:27:03.303","favoritecount":0,"comments":["101060","101063","101082"]},"31928":{"body":"<p>While using alternative ROMs like CyanogenMod 9(as i currently am), one flashes an additional zip file called gApps which contains apps provided by Google.</p>\n\n<p>As Google releases newer versions of applications, will the newer versions be updated via Google Play or do I need to manually flash a newer version of the gapps.zip?</p>\n\n<p>I'm asking because an update to the Google Play market app was recently released (which includes the ability to remove apps from the ALL MY APPS section) but I still haven't seen my market app updating itself.</p>\n","viewcount":2254,"dups":[],"title":"Do apps included in the gApps zip get updated via Google Play?","tags":["cyanogenmod","update","google-apps"],"userid":"1250","related":[],"score":3,"answers":["31956","31935"],"acceptedanswer":"31956","creationdate":"2012-10-17T05:56:53.583","favoritecount":0,"comments":["41341"]},"75737":{"body":"<p>Why cant I move twitter over to my SD card? I have a 16gb SD and all installed apps are there,exept for some, like twitter. Is it possible to move those apps over to SD card?</p>\n","viewcount":178,"dups":[],"title":"I cant move apps like twitter over to SD card?","tags":["sd-card","twitter"],"userid":"65723","related":[],"score":1,"answers":["75744","75742"],"acceptedanswer":false,"creationdate":"2014-07-07T13:50:53.327","favoritecount":0,"comments":["98836","98843","98844"]},"75732":{"body":"<p>I have an LG P700.</p>\n\n<p>Yesterday I tried to use LG PC Suite to back it up. PC Suite got stuck at some point of the process and asked me to disconnect the phone and restart it, in spite that the screen of the phone had a warning not to touch it. I rashly followed the PC Suite instructions and restarted the phone. After doing so, I found that no backup had been created and all the events in Google Calendar had disappeared. Everything else in the phone seems to be working fine. I was using the phone local calendar, and I didn't have it synchronized to the cloud.</p>\n\n<p>About an hour before I started the PC Suite backup I set up the Backup &amp; Reset options for my Google account (Settings -> Backup &amp; Reset), so I understand that the phone started to back up itself automatically at that point. I don't know if this might help.</p>\n\n<p>So, is there any way to recover my lost events? I'm really crossing my fingers here 'cause I lost around 400 - 500 events.</p>\n","viewcount":57,"dups":[],"title":"Can I recover the events deleted from my phone local calendar?","tags":["backup","recovery-mode","calendar","bugs","lg"],"userid":"65719","related":[],"score":0,"answers":["75743"],"acceptedanswer":"75743","creationdate":"2014-07-07T12:51:14.843","favoritecount":0,"comments":["98838","98890"]},"75730":{"body":"<p>I've got a samsung galaxy tab 8, and a few days ago it started making a notification sound but with no notification banner.. I don't know what app is doing it and I didn't install anything around the time in started..</p>\n\n<p>Is there a way to trace this back to the source app somehow?</p>\n\n<p>Thanks</p>\n","viewcount":58,"dups":["62749"],"title":"Find out which app is making notification sounds?","tags":["notifications","audio","samsung-galaxy-tab"],"userid":"65718","related":["62749"],"score":0,"answers":["75751"],"acceptedanswer":false,"creationdate":"2014-07-07T12:42:02.120","favoritecount":0,"comments":[]},"75739":{"body":"<p>Im trying to open my stock rom file that i downloaded from sam firmware and when I try open it with winrar it says: The archive is either in unknown format or damaged. so i tried taking the .md5 extension away and still no luck? Other people have managed to do this besides me?</p>\n","viewcount":889,"dups":[],"title":"Cant open tar.md5 files to view the .img files","tags":["rom"],"userid":"65725","related":[],"score":2,"answers":["75745","75741"],"acceptedanswer":false,"creationdate":"2014-07-07T14:12:51.497","favoritecount":0,"comments":[]},"4649":{"body":"<p>Is it possible to use the Samsung Galaxy Tab as a wifi-hotspot so that non-3G iPads can use the Samsungs connection to the phone network?</p>\n","viewcount":16511,"dups":[],"title":"Can the Samsung Galaxy Tab be used as a wifi-hotspot?","tags":["samsung-galaxy-tab","wifi-tethering","wifi-hotspot"],"userid":"2085","related":[],"score":3,"answers":["4672","4652"],"acceptedanswer":"4652","creationdate":"2011-01-12T14:11:22.307","favoritecount":0,"comments":[]},"4641":{"body":"<p>When I have my samsung galaxy 9000 (with Android 2.2) on a flat surface (table) and start an application, then the application is shown in landscape mode, even when the start/home screen was in portrait mode.</p>\n\n<p>This does not happen when I hold the phone in my hands.</p>\n\n<p>Is there a way to disable this behavior?</p>\n\n<p><strong>Update:</strong> I think I got something wrong: the home screen is never rotated, so the problem is simply that the galaxy thinks it is in landscape-mode when it is lying flat.</p>\n","viewcount":1069,"dups":[],"title":"Screen orientation on Samsung Galaxy 9000","tags":["samsung-galaxy-s","screen","orientation"],"userid":"1260","related":[],"score":0,"answers":["4643","4645"],"acceptedanswer":false,"creationdate":"2011-01-12T12:04:15.033","favoritecount":0,"comments":["4941","5001","5002","5005"]},"4647":{"body":"<p>I really hate that the sleep/mute key button is the same that wakes up the phone; I would want to be able to wake it up by pressing any key on the phone. Any ideas?</p>\n","viewcount":687,"dups":[],"title":"How to change the wake up Button on the Motorola Droid Pro to be any keyboard key?","tags":["buttons","motorola-droid-pro"],"userid":"2013","related":["1080","730","671"],"score":2,"answers":[],"acceptedanswer":false,"creationdate":"2011-01-12T13:09:31.300","favoritecount":0,"comments":["4922","4925"]},"4644":{"body":"<p>I'm trying to gather information regarding ANT+ hardware support in Android phones. Basically, <strong>what Android phones have ANT wireless hardware?</strong></p>\n\n<p>ANT and ANT+ ( <a href=\"http://thisisant.com/\" rel=\"nofollow\">http://thisisant.com/</a> ) as wireless protocols are quite promising, especially with potential open source support for ANT+ ready-made fitness devices ( see <a href=\"http://www.thisisant.com/news/stories/ant-enabled-live-google-data-feed\" rel=\"nofollow\">http://www.thisisant.com/news/stories/ant-enabled-live-google-data-feed</a> ).</p>\n\n<p>For now only Sony Ericsson has officially stated they have it in X10 mini pro, X10 mini, X8 and upcoming Xperia Arc (and AFAIK \"plain\" X10 is not included) - <a href=\"http://blogs.sonyericsson.com/developerworld/2011/01/06/use-your-sony-ericsson-phone-with-ant-enabled-health-and-fitness-products/\" rel=\"nofollow\">http://blogs.sonyericsson.com/developerworld/2011/01/06/use-your-sony-ericsson-phone-with-ant-enabled-health-and-fitness-products/</a> . Also it is known that Texas Instruments WiLink 6 and WiLink 7 module support ANT as well (some sources state Motorola Droid and Motorola Droid X have it, and therefore interesting too).</p>\n\n<p>Any other? Please, share if you find others!</p>\n\n<p>UPDATE: Sony Ericsson support seems to made its way to users, here the list of phones regarding Android ANT+ API ( <a href=\"http://www.thisisant.com/pages/developer-zone/android-api\" rel=\"nofollow\">http://www.thisisant.com/pages/developer-zone/android-api</a> ). Still waiting for any official or unofficial support for non-SE phones.</p>\n\n<p>UPDATE 2: list of supported phones from the directory of mobile phones and devices - <a href=\"http://www.thisisant.com/directory/\" rel=\"nofollow\">http://www.thisisant.com/directory/</a></p>\n\n<p>ANT+ enabled phones: Any device with USB Host feature and a connected ANT USB stick.</p>\n\n<p>Currently supported mobile phones and devices:</p>\n\n<ul>\n<li><p>Monterra (Garmin)</p></li>\n<li><p>HTC Rhyme (HTC)</p></li>\n<li><p>GALAXY Note 3 Lite (Samsung Electronics)</p></li>\n<li><p>GALAXY TabPRO 12.2 (Samsung Electronics)</p></li>\n<li><p>GALAXY Note 3 Neo (Samsung Electronics)</p></li>\n<li><p>GALAXY TabPRO 8.4 (Samsung Electronics)</p></li>\n<li><p>GALAXY TabPRO 10.1 (Samsung Electronics)</p></li>\n<li><p>GALAXY NotePRO 12.2 (Samsung Electronics)</p></li>\n<li><p>GALAXY S5 (Samsung Electronics)</p></li>\n<li><p>GALAXY Grand 2 (LTE) (Samsung Electronics)</p></li>\n<li><p>GALAXY J (Samsung Electronics)</p></li>\n<li><p>GALAXY Note 10.1 (2014 Edition) (Samsung Electronics)</p></li>\n<li><p>GALAXY S4 (Android 4.3 and up) (Samsung Electronics)</p></li>\n<li><p>GALAXY Note 3 (Samsung Electronics)</p></li>\n<li><p>Xperia T2 Ultra (Sony Mobile)</p></li>\n<li><p>Xperia Z2 Tablet (Sony Mobile)</p></li>\n<li><p>Xperia M2 (Sony Mobile)</p></li>\n<li><p>Xperia Z2 (Sony Mobile)</p></li>\n<li><p>Xperia Z1 S (Sony Mobile)</p></li>\n<li><p>Xperia Z1 Compact (Sony Mobile)</p></li>\n<li><p>Xperia Z1 (Sony Mobile)</p></li>\n<li><p>Xperia Z Ultra (Sony Mobile)</p></li>\n<li><p>Xperia SL (Sony Mobile)</p></li>\n<li><p>Xperia acro S (Sony Mobile)</p></li>\n<li><p>Xperia X8 (Sony Mobile)</p></li>\n<li><p>Xperia x10 mini pro (Sony Mobile)</p></li>\n<li><p>Xperia S (Sony Mobile)</p></li>\n<li><p>Xperia x10 mini (Sony Mobile)</p></li>\n<li><p>Xperia ray (Sony Mobile)</p></li>\n<li><p>Xperia pro (Sony Mobile)</p></li>\n<li><p>Xperia neo V (Sony Mobile)</p></li>\n<li><p>Xperia neo (Sony Mobile)</p></li>\n<li><p>Xperia mini pro (Sony Mobile)</p></li>\n<li><p>Xperia mini (Sony Mobile)</p></li>\n<li><p>Xperia ion LTE (Sony Mobile)</p></li>\n<li><p>Xperia ion HSPA (Sony Mobile)</p></li>\n<li><p>Xperia arc S (Sony Mobile)</p></li>\n<li><p>Xperia arc (Sony Mobile)</p></li>\n<li><p>Live with Walkman (Sony Mobile)</p></li>\n<li><p>Xperia active (Sony Mobile)</p></li>\n</ul>\n","viewcount":78464,"dups":[],"title":"What Android phones are ANT+ hardware enabled?","tags":["wi-fi","hardware","ant+"],"userid":"2058","related":[],"score":17,"answers":["54695","54970","34153","42428","64980","5701","34639","4648"],"acceptedanswer":false,"creationdate":"2011-01-12T12:31:18.290","favoritecount":13,"comments":["95482","96492"]},"5153":{"body":"<p>I've been thinking about getting a pre-owned Samsung Fascinate from Verizon for $40. I can't afford a $30/month unlimited data plan, but I was considering the $15/month 150MB data plan.</p>\n\n<p>I'm planning on using it primarily as a phone/PMP, without heavy use of internet-related features. Most of my data usage will probably come from these things:</p>\n\n<ul>\n<li>Downloading apps</li>\n<li>Occassionally checking weather, maps, etc.</li>\n<li>Texting through Google Voice. I plan all cancelling my texting plan and moving all my texting activities to Google Voice. I only use around ~300 texts (sent and received) per month.</li>\n</ul>\n\n<p>Is it reasonable to expect these activities to remain within 150MB/month? On a related note, I am usually on my university's campus, which has wi-fi. Can I use the wi-fi network to avoid suffering data charges?</p>\n\n<p>Update: Verizon ran a promotion this weekend. For upgrading to a smartphone with unlimited data plan, you got a $10/month credit for the next 24 months. So the $30/unlimited data plan effectively becomes $20/unlimited, and I went with that instead of the $15/150MB plan.</p>\n","viewcount":1311,"dups":[],"title":"Is 150 MB / month enough for limited use?","tags":["wi-fi","data-traffic"],"userid":"1829","related":["1624"],"score":6,"answers":["5165","5157","5156"],"acceptedanswer":"5157","creationdate":"2011-01-24T19:29:03.213","favoritecount":1,"comments":["5542","5543","5545","5556","5561","5577","5610"]},"5155":{"body":"<p>I have many PDFs that I would like to read on my Galaxy Tab and then take notes. Preferably the notes would be attached to the document (may be like <a href=\"http://skim-app.sourceforge.net/\">Skim</a> does), but as a workaround I can also imagine to copy a relevant piece of text into a separate note taking application.</p>\n\n<p>Preferably the reader should handle PDFs directly, but if there is no PDF solution I might also start converting the documents (maybe with <a href=\"http://android.stackexchange.com/questions/3751/best-way-to-read-pdfs-on-android/3767#3767\">Calibre</a>) for an epub reader.</p>\n\n<p>I tried Adobe Reader, ThinkFree Office and Aldiko, all of which have acceptable performance loading the PDFs, but aside from <a href=\"http://android.stackexchange.com/questions/2188/best-way-to-read-programming-technical-math-pdfs-on-android-device\">cumbersome zooming</a> they also lack the ability to copy or adding notes.</p>\n","viewcount":8968,"dups":[],"title":"Is there a PDF (or epub) reader that allows to take notes (or at least to copy text)?","tags":["pdf","ebook-reader","notes","epub"],"userid":"2113","related":["3751","2188","2736"],"score":9,"answers":["12289","5198","8279","5158"],"acceptedanswer":"5158","creationdate":"2011-01-24T20:18:41.770","favoritecount":4,"comments":["56193"]},"5154":{"body":"<p><strong>I find that the minimum in-call volume on my HTC Desire is still far to loud on some calls.</strong></p>\n\n<p>Since I got the phone, I have flashed several different custom ROMs, radio updates, etc, and have had the issue throughout.</p>\n\n<p><strong>Do you know of any way (setting, hack, app, whatever) to reduce the minimum volume?</strong></p>\n\n<p>My device is rooted and I am currently running one of the CyanogenMod 7 (Gingerbread) nightly builds.</p>\n","viewcount":1840,"dups":[],"title":"Reduce minimum in call volume","tags":["calls","volume-control","oncall"],"userid":"86","related":["4113"],"score":6,"answers":["5167","5190","5340"],"acceptedanswer":"5340","creationdate":"2011-01-24T19:30:32.300","favoritecount":1,"comments":["5541","5550","5554","5586","5589"]},"112":{"body":"<p>When I use Android in business I have some secret data on my phone. So if I lose my phone this can easily be stolen.</p>\n\n<p>Is there any way I can secure my phone? E.g. adding password for unlocking it. Any recommendations? apps? or best-practice?</p>\n","viewcount":678,"dups":[],"title":"How to improve the security on my Android phone?","tags":["security","lost-phone","authorization"],"userid":"7","related":[],"score":8,"answers":["11305","11330","40748","1640","117"],"acceptedanswer":"117","creationdate":"2010-09-13T19:59:04.337","favoritecount":3,"comments":[]},"118":{"body":"<p>Can it be done?  I'd like to be able to set clock limits based on a number of conditions, such as battery temperature, charging/not charging, and what radios are turned on.  I'm aware that there are apps for rooted phones that will allow me to do this, but I'm wondering if there are any that don't need my phone to be rooted.</p>\n","viewcount":252,"dups":[],"title":"Running an over/under-clocking app without rooting","tags":["clock-speed"],"userid":"79","related":[],"score":2,"answers":["120"],"acceptedanswer":"120","creationdate":"2010-09-13T20:01:46.333","favoritecount":0,"comments":[]},"36329":{"body":"<p>Unfortunately, the power button doesn't work and I'm not able to power off the device.</p>\n\n<p>The only way, is physically pull out the battery, but if I'll do so, I wont be able to power it on again.</p>\n\n<p>The cellular network doesn't work , and the Wi-Fi seems to, too.</p>\n\n<p>The device is up for 53:21:59 hours!! (and seems to count..)</p>\n\n<p>I must force somehow a reboot.</p>\n\n<p>Is there shell command (and if so - how to access it?) , or application that forcing reboot? </p>\n\n<p>Thanks.</p>\n","viewcount":5068,"dups":[],"title":"How to reboot an android device?","tags":["2.3-gingerbread","samsung-galaxy-s","reboot"],"userid":"25705","related":["1106"],"score":4,"answers":["36336","36331"],"acceptedanswer":"36331","creationdate":"2012-12-28T16:30:42.960","favoritecount":2,"comments":["47451","47454"]},"36324":{"body":"<p>I'm using my Android device to scan receipts for warranty receipts, or for expensive stuffs. I'm uploading the receipts to Google Drive which works well, except that it's a long process to scanning each receipt.</p>\n\n<p>I open the Google Drive, enter the right folder, click the button for creating a new file, choose to take a new picture, take the picture, then rename the newly created file to something more fitting i.e. name of item or store name and date, and then enter my Gallery and delete the picture from the camera roll because I don't want it there.</p>\n\n<p>Well, you get the picture. Is there a better way of doing this?</p>\n\n<p>Also, if possible I'd like to crop the image, or even stitch 2 pics together if the receipt is too long.</p>\n\n<p>Is there a good app for this perhaps? I searched Google Play but couldn't really find anything fitting.</p>\n\n<p>And a related question: does the following rule apply when uploading pictures to Google Drive, since Picasa and Drive share the same space now?</p>\n\n<blockquote>\n  <p>If you're signed up for Google+, photos up to 20482048 pixels and videos up to 15 minutes long won't count towards this free storage limit. And Google will automatically resize photos for you when you upload them to Google+, so they stay under the free size limit.</p>\n  \n  <p>That means only photos uploaded directly to Picasa Web Albums over the 20482048 size will count towards the 1 GB of free storage, explains Google. And when that limit is reached, photos will be automatically resized.</p>\n  \n  <p>Meanwhile, for non-Google+ users, there are slightly stricter rules: photos up to 800800 and videos up to 15 minutes wont count towards free storage. Again, when the 1 GB limit is reached, larger photos will be resized down.</p>\n</blockquote>\n","viewcount":355,"dups":[],"title":"Scanning receipts for paperless environment","tags":["images","google-drive","document-scanner"],"userid":"25124","related":[],"score":5,"answers":["36332","36326"],"acceptedanswer":false,"creationdate":"2012-12-28T14:09:08.907","favoritecount":0,"comments":["47446","47448"]},"36321":{"body":"<p>I have a storex ezeetab702 tablet. My Google Play Store was working very well until a few weeks ago, when it start saying \"error retrieving information from server DF-DFERH-01\".</p>\n\n<p>I tried to clear the cache, clear the data, force stop, and downloading another Google Play Store, but I'm still having the same problem.</p>\n\n<p>How can I fix this issue?</p>\n","viewcount":1885,"dups":[],"title":"Keep getting message error retrieving information from server DF-DFERH-01 from the play store","tags":["google-play-store","system-error"],"userid":"25695","related":[],"score":3,"answers":["37763"],"acceptedanswer":false,"creationdate":"2012-12-28T12:48:05.340","favoritecount":0,"comments":["47488","50809"]},"36323":{"body":"<p>On my Google Nexus 7, I want to stream music from the Google cloud to a wireless speaker or airplay. I have found lots of apps that can stream to airplay, but none of them can see my Google music which I have uploaded to the cloud. </p>\n","viewcount":5530,"dups":[],"title":"Streaming from Google music cloud to wireless speaker or airplay","tags":["streaming","google-play-music"],"userid":"25699","related":[],"score":5,"answers":["37688"],"acceptedanswer":"37688","creationdate":"2012-12-28T14:03:05.710","favoritecount":1,"comments":[]},"45857":{"body":"<p>Recently, whenever I power on my phone, a toast appears saying \"phone booted!!!\". What does that mean? Is it a virus? I haven't installed any apps in a week or so. </p>\n\n<p><img src=\"http://i.stack.imgur.com/tynHW.png\" alt=\"enter image description here\"></p>\n","viewcount":1271,"dups":[],"title":"Why does \"Phone booted!!!\" toast message show up on start up?","tags":["samsung-galaxy-nexus","toast-notifications"],"userid":"15141","related":[],"score":2,"answers":["54234","64575"],"acceptedanswer":false,"creationdate":"2013-05-21T14:46:11.960","favoritecount":0,"comments":["61824","61825","61826","61827","61828","61829","61831","61832","61833","61834","61836"]},"15893":{"body":"<p>I recently installed File Expert on my Samsung Galaxy Ace and I'm not sure how to configure its Web Sharing feature. I clicked on <code>Share My Contents-&gt;Start Share Via Web</code> which gave me the URL, username and password. When I tried the URL in my web browser I got the timeout error, though. Is there any separate configuration required to make this work?</p>\n\n<p>I am using mobile Internet to connect to File Expert's Web Sharing. Is that the problem?</p>\n","viewcount":518,"dups":[],"title":"How do I configure File Expert's Web Sharing feature?","tags":["file-transfer","samsung-galaxy-ace"],"userid":"9554","related":[],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2011-11-21T18:43:48.273","favoritecount":0,"comments":["18760","18768","18778"]},"15894":{"body":"<p>I installed a CM7.1 over a custom 2.3.5 installation on my Samsung Galaxy S I9000.  I did a full wipe through CWM as well as wiping the cache, as explained in the <a href=\"http://wiki.cyanogenmod.com/wiki/Samsung_Galaxy_S%3a_Full_Update_Guide#Method_via_Recovery\" rel=\"nofollow\">SGS installation instructions</a>.  The installation completed without any errors, but when the phone booted the process <em>com.android.phone</em> force-closed.  When I dismissed the error, it force-closed again within less than a second, and continued doing so.</p>\n\n<p>I rebooted into recovery and made sure to wipe everything, but nothing helped.  I finally reverted to my previous ROM in disappointment.</p>\n\n<p>What could be the causing these force-closes?  How can I install CM7.1 successfully?  Is there any specific kernel I should install?  Any specific modem?</p>\n","viewcount":475,"dups":[],"title":"com.android.phone force closes constantly after a clean install of CM7.1 in SGS1","tags":["samsung-galaxy-s","cyanogenmod","force-close"],"userid":"344","related":["14430"],"score":1,"answers":["28308"],"acceptedanswer":"28308","creationdate":"2011-11-21T19:14:04.420","favoritecount":0,"comments":["18758","18762","18764","18767","35324"]},"15895":{"body":"<blockquote>\n  <p><strong>Possible Duplicate:</strong><br>\n  <a href=\"http://android.stackexchange.com/questions/17152/where-can-i-find-stock-or-custom-roms-for-my-android-device\">Where can I find stock or custom ROMs for my Android device?</a>  </p>\n</blockquote>\n\n\n\n<p><a href=\"http://forum.xda-developers.com/wiki/index.php?title=HTC_Supersonic/ROMs\" rel=\"nofollow\">http://forum.xda-developers.com/wiki/index.php?title=HTC_Supersonic/ROMs</a> is a great page for ROM listings for HTC. Is there a similar page out there somewhere listing details on custom ROM's compatible with my Samsung?  Thanks.</p>\n","viewcount":1421,"dups":[],"title":"Samsung Epic Touch 4G - ROM Listing","tags":["custom-rom"],"userid":"9532","related":[],"score":2,"answers":["15914"],"acceptedanswer":false,"creationdate":"2011-11-21T19:32:07.877","favoritecount":1,"comments":[]},"15899":{"body":"<p>It seems like copying a file onto the SD card ought to be easy, but for the life of me I can't figure out how to do it. I have an (International) Motorola Xoom Wifi running stock Moto Android 3.2.</p>\n\n<p>If I insert an SD card with content on it, I can see the contents of the card show up in the tablet's Gallery app. I can also go into the built-in Files app and browse the contents of the SD card. Using the Files app I can select files and copy them from the SD card to the internal storage.</p>\n\n<p>However when I browse the tablet's internal storage with the Files app and select and <kbd>Copy</kbd> a file, if I then navigate to the SD card the <kbd>Paste Here</kbd> option is grayed out.</p>\n\n<p>Using File Manager HD, I can't even find the SD card. It looks (from the Files app) like the SD card is at <code>/mnt/external1/</code> but I can't see any way to get there. Is there something I'm missing in File Manager HD to find the SD card, or is there a deficiency in File Manager HD that another file manager could solve?</p>\n\n<p>Also strangely I can delete files from the SD card using the gallery app, but not using the Files file manager app!</p>\n","viewcount":3811,"dups":[],"title":"How can I copy files onto an SD card with a Honeycomb tablet?","tags":["external-sd","file-transfer","3.2-honeycomb"],"userid":"156","related":[],"score":3,"answers":["15900","15970"],"acceptedanswer":"15970","creationdate":"2011-11-21T21:43:57.157","favoritecount":0,"comments":["18782","18784"]},"57778":{"body":"<p>Using <code>adb shell</code> or a terminal emulator on the device, entering this will clear all notifications (requires <code>su</code>)</p>\n\n<pre><code>service call notification 1\n</code></pre>\n\n<p>This will send an sms (doesn't require <code>su</code>)</p>\n\n<pre><code>service call isms 5 s16 \"PhoneNumber\" i32 0 i32 0 s16 \"BodyText\"\n</code></pre>\n\n<p>Where can I learn more about <code>service call</code>? I've found <a href=\"https://stackoverflow.com/questions/17719898/service-call-isms-with-adb-shell-android-sdk\">this question</a> on StackOverflow and appreciate the answer's breakdown as to what everything means. But where can I find info on what method <code>notification 2</code> might be trying to call?</p>\n\n<p>Running <code>service call</code> was incomplete and printed this usage:</p>\n\n<pre><code>Usage: service [-h|-?]\n       service list\n       service check SERVICE\n       service call SERVICE CODE [i32 INT | s16 STR] ...\nOptions:\n   i32: Write the integer INT into the send parcel.\n   s16: Write the UTF-16 string STR into the send parcel.\n</code></pre>\n\n<p>I ran <code>service list</code> and it came back with 78 services for my device including <code>isms</code> and <code>notification</code> and for most services will print what seems to be a namespace (<code>com.android.internal.telephony.ISms</code> for <code>isms</code> and <code>android.app.INotificationManager</code> for <code>notification</code>). How can I use this information to find out what I can do with each of these services?</p>\n","viewcount":17,"dups":["34625"],"title":"Where to find info on the \"service call\" shell command?","tags":["shell"],"userid":"5479","related":["34625"],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2013-11-26T20:24:51.153","favoritecount":0,"comments":["78406","78409"]},"37499":{"body":"<p>I have a very simple problem: when I run <code>Wifi Tether</code> on my Galaxy S3 the computer won't get the IP address unless I disable <code>DroidWall</code> firewall.</p>\n\n<p>DW runs in whitelist mode, but I ran across its menu to enable all wireless related applications it found. Nothing. I have to stop it at all to make DHCP server work.</p>\n\n<p>What application in Android 4.1, or at least in the stock GS3 ROM, governs DHCP in wireless tethering and should be enabled with DroidWall?</p>\n\n<p>Or else, how do I find it out without try-and-fail across a large number of applications.</p>\n","viewcount":4451,"dups":[],"title":"DroidWall and Wireless Tethering","tags":["wifi-tethering","firewall","dhcp"],"userid":"7813","related":[],"score":2,"answers":["67311","74621","37502"],"acceptedanswer":"67311","creationdate":"2013-01-12T19:03:19.907","favoritecount":0,"comments":[]},"18919":{"body":"<blockquote>\n  <p><strong>Possible Duplicate:</strong><br>\n  <a href=\"http://android.stackexchange.com/questions/17482/how-can-i-install-vanilla-android-on-the-kindle-fire\">How can I install vanilla Android on the Kindle Fire?</a>  </p>\n</blockquote>\n\n\n\n<p>I have a Kindle Fire device and I want to install the vanilla Android OS on it.</p>\n\n<p>Please help me how to flush out the original ROM and how to install new vanilla Android on it.</p>\n","viewcount":2574,"dups":["17482"],"title":"How to install vanilla Android OS on Kindle Fire?","tags":["rom","amazon-kindle-fire","vanilla-android"],"userid":"12073","related":["17584","17338","17482"],"score":2,"answers":["18920"],"acceptedanswer":false,"creationdate":"2012-01-31T09:05:10.320","favoritecount":0,"comments":["21887","21928"]},"18917":{"body":"<p>I'm outside the US so don't have access to Google Voice.</p>\n\n<p>On the GMail web page, if you enable chat, you can see a \"Call Phone\" option which allows you to call land line phones from the web page. </p>\n\n<p>Is there any way, to make use of this functionality to make outbound calls on Android? </p>\n","viewcount":690,"dups":[],"title":"Is it possible to use the GMail \"Call Phone\" functionality on Android without Google Voice?","tags":["gmail","calls","google-voice"],"userid":"297","related":[],"score":6,"answers":["27067"],"acceptedanswer":false,"creationdate":"2012-01-31T01:14:18.117","favoritecount":1,"comments":["21876","21878"]},"37496":{"body":"<p>In the People app, if I delete a portion of a contacts information (like their address or phone number) the information will disappear for a time, but the next time I view my contacts, the information is back. Plus, I noticed that no changes were made to the contact's information in gmail, but it should have been; the phone is set to sync automatically with my gmail account. </p>\n\n<p>HTC DNA. </p>\n","viewcount":108,"dups":[],"title":"When I delete contact item (phone, email, etc), the item deletes but reappears","tags":["sync","gmail","people-app"],"userid":"26632","related":[],"score":2,"answers":[],"acceptedanswer":false,"creationdate":"2013-01-12T18:11:34.333","favoritecount":0,"comments":["49390"]},"37497":{"body":"<p>We will develop applications for android 2.3.4 (gingerbread) and because the emulator of my laptop is very unusable and the android x86 is not supported in my laptop, i'm planning to invest an android device to test the applications that we are going to create.</p>\n\n<p>Since android ICS is the recent version of android OS, i plan to buy a phone running it. </p>\n\n<p>Would their be any compatibility issue i might encounter during my development? Or i could survive using that phone smoothly till the end?</p>\n","viewcount":172,"dups":[],"title":"Can I use an android phone running Ice Cream Sandwich to test apps created in Gingerbread?","tags":["4.0-ice-cream-sandwich","2.3-gingerbread","android-emulator","usb-debugging"],"userid":"26634","related":[],"score":1,"answers":["37544"],"acceptedanswer":"37544","creationdate":"2013-01-12T18:56:45.093","favoritecount":0,"comments":["49365","49368"]},"37490":{"body":"<p>I'd like to have several audiobooks and/or podcasts on my Nexus 7, but every time I put any MP3 files onto the device, even if I make my own folder for it or some such, Google Music detects them and then adds them to its list of files.</p>\n\n<p>This is a problem, because I'd love to be able to use the \"Shuffle All\" feature, but then it ends up shuffling in chapters from the Audiobook. I don't want it to do that at all.</p>\n\n<p>Any advice?</p>\n","viewcount":3046,"dups":[],"title":"How do you prevent Google Music from importing all .mp3 files on the device?","tags":["google-play-music"],"userid":"26630","related":[],"score":4,"answers":["43192","48564"],"acceptedanswer":false,"creationdate":"2013-01-12T17:36:46.267","favoritecount":0,"comments":["49342","49361","49388","49389","52570","57852"]},"37491":{"body":"<p>I rooted my 2.3.5 and then returned my Samsung Captive i897 to stock 2.1 update 1 ROM. But now I want to put cyanogen 9 ICS -- but the CWM recovery does not work anymore.</p>\n\n<p>Where do I find one for 2.1? Kies does not want to update my phone to gingerbread. Eclair has no good apps, NONE, I am bored.</p>\n","viewcount":953,"dups":[],"title":"Where do i find cwm recovery for samsung captivate?","tags":["2.1-eclair","clockworkmod","samsung-captivate"],"userid":"25642","related":[],"score":1,"answers":[],"acceptedanswer":false,"creationdate":"2013-01-12T17:42:31.063","favoritecount":0,"comments":["49345","49346","49356","49358"]},"37492":{"body":"<p>I have a non-rooted Droid X2 that is in <strong>permanent</strong> \"Safe mode\", but I want to recover SMS messages.  SMS Backup and Restore will NOT work because safe mode only allows system apps to run.</p>\n\n<p><code>adb shell</code> will get me into the phone, but does not allow me to get to the SMS database:</p>\n\n<pre>\n[rjt@pc232 workspace]$ adb shell\n$ cat /proc/version\nLinux version 2.6.32.9-00008-gc406305 (hudsoncm@il93lnxdroid80) (gcc version 4.4.0 (GCC) ) #2 SMP PREEMPT Tue Jan 24 22:54:19 CST 2012\n\n$ cd /data/data/com.android.providers.telephony/databases/\n$ pwd\n/data/data/com.android.providers.telephony/databases\n$ ls\nopendir failed, Permission denied\n$ su -l root\nsu: permission denied\n$ sudo\nsudo: permission denied\n$ sudo su -\nsudo: permission denied\n$ sudo su -l root\nsudo: permission denied\n$\n</pre>\n\n<p>Since SMS Backup and Restore is allowed to access my SMS messages when in normal mode, is \"Safe mode\" blocking my access or the fact that this phone is not rooted?   </p>\n\n<p>Can I root the phone without losing my existing SMS messages?</p>\n","viewcount":5102,"dups":[],"title":"Can adb be used to recover SMS messages while in permanent \"Safe Mode\"?","tags":["sms","backup","adb","safe-mode"],"userid":"6382","related":[],"score":1,"answers":["37494","37495"],"acceptedanswer":"37495","creationdate":"2013-01-12T17:44:17.537","favoritecount":1,"comments":[]},"30648":{"body":"<p>Is it possible to add a computer to Firefox Sync if I have my already configured Android phone with me?</p>\n\n<p>All the online tutorials cover the case where your computer is configured and you want to add your android phone to sync, but phone -> computer is much more useful since the phone is the thing you carry with you. I haven't been able to find the option in Firefox Mobile, is it at all possible?</p>\n","viewcount":23,"dups":[],"title":"Is it possible to add a computer to Firefox Sync if I have my already configured Android phone with me?","tags":["sync","firefox"],"userid":"8564","related":[],"score":1,"answers":[],"acceptedanswer":false,"creationdate":"2012-10-10T08:30:59.140","favoritecount":0,"comments":[]},"30649":{"body":"<p>In my 2.3.7 Android phone, when I use the Google Calendar application, I can see all the events that are listed in my Google account, as I would see them in the browser in my computer, but when I create a new event using the phone -- it shows as 'PC Sync', the new item won't sync up to the calendar as I see it in the browser. I have tried cleaning the cache and data for the 'Calendar' and 'Calendar Storage' application, and manually re-syncing the Google account from the phone, but it still won't show up. Any ideas?</p>\n\n<p>EDIT: If the event is under 'PC Sync', where should they appear in Google Calendar?</p>\n","viewcount":995,"dups":[],"title":"Google Calendar events created on the phone won't sync","tags":["2.3-gingerbread","sync","calendar"],"userid":"5699","related":[],"score":2,"answers":["30659"],"acceptedanswer":"30659","creationdate":"2012-10-10T09:46:15.343","favoritecount":1,"comments":["39890","39895"]},"30647":{"body":"<p>I had <a href=\"http://www.sainsmart.com/android-mini-pc/sainsmart-ss808-pc-on-a-stick-for-android-4-1-dual-core-1-6-ghz-a9-processor-1gb-ddr3-8gb-internal-storage-dual-wifi-module-on-board.html\" rel=\"nofollow\">this mini pc</a> from a friend. But I cannot power it up.</p>\n\n<p>When I connect it to TV with HDMI cable, the light is blue, but I got nothing show on the TV screen. I've tried some different HDMI cables, but it will not put a picture out to the TV.</p>\n\n<p>Can anyone suggest what the problem might be?</p>\n","viewcount":2210,"dups":[],"title":"How can I get my MK808 mini Android PC to output to my TV?","tags":["hdmi","android-mini-pc"],"userid":"21238","related":[],"score":1,"answers":["31930"],"acceptedanswer":false,"creationdate":"2012-10-10T08:09:44.233","favoritecount":1,"comments":["39892","39893","42802"]},"30642":{"body":"<p>When I got the tablet, new version of play store was pre-installed and was working fine. Initially my 3G dongle was not connecting to Internet. After complaining to customer care, I was provided a firmware with which I updated my tablet. Then onwards, I could connect to Internet but Play store was gone. I managed to download it and installed it on tablet but now it opens and closes without any error message.</p>\n\n<p>I have already tried:</p>\n\n<ol>\n<li>Re installing the given ROM</li>\n<li>Done factory reset</li>\n<li>Tried to install different versions (v3.5.19, v3.7.16, etc) of Play Store app.</li>\n</ol>\n\n<p>None of the above solved the probelm. Please help.</p>\n","viewcount":1898,"dups":[],"title":"BSNL Penta TPad 701C Android ICS - Play store closes immediately after opening.","tags":["applications","4.0-ice-cream-sandwich","google-play-store","update"],"userid":"21235","related":[],"score":3,"answers":["30644"],"acceptedanswer":"30644","creationdate":"2012-10-10T06:00:36.417","favoritecount":0,"comments":["39877","39878","39879","39880","44814"]},"7641":{"body":"<p>When I select Phone app and go to keypad tab, on keys I see alphabets besides each number key. How to use them? </p>\n\n<p>I suppose it should find a contact already in my contacts. When I type key 7 twice it types two 7s and it doesn't show any contact starting from Q.</p>\n\n<p>Note: I've upgraded to Froyo using steps mentioned at  <a href=\"http://theandroidfans.blogspot.com/2011/01/how-to-install-android-22-froyo-latest.html\" rel=\"nofollow\">http://theandroidfans.blogspot.com/2011/01/how-to-install-android-22-froyo-latest.html</a></p>\n","viewcount":5129,"dups":[],"title":"How to use alphabets on keypad in Phone App? - Samsung Galaxy 3 I5801","tags":["applications","2.2-froyo","contacts","samsung-galaxy-apollo","dialer"],"userid":"1229","related":[],"score":0,"answers":["7695","7643","7642"],"acceptedanswer":"7643","creationdate":"2011-03-29T11:19:37.573","favoritecount":1,"comments":["9014","9024","9404"]},"7647":{"body":"<p>I'm considering getting a G1 from T-Mobile (in the US), and am wondering, I can update to new versions of Android as they come out, even ones targeted towards newer Android phones, correct? For example, would I be able to update my G1 to Android 2.0 when it is available? Thanks.</p>\n","viewcount":678,"dups":[],"title":"G1 - Can I Update to Newer Versions of Android?","tags":["update","htc-dream"],"userid":"1693","related":["2696","7150"],"score":4,"answers":["7674","7671","7649","7648"],"acceptedanswer":false,"creationdate":"2009-10-29T05:50:55.630","favoritecount":0,"comments":["8987","8992","9008","9016","9042"]},"7646":{"body":"<p>This is related to another question I posed recently, but I thought I should keep issues separate and specific.</p>\n\n<p>On a desktop computer running Firefox, one can create a file called \"userContent.css\" and have the CSS in that file over ride the CSS for specific web sites.</p>\n\n<p>I'd like to be able to do the same thing on my Android 2.2 phone, especially since there are so many sites not optimized for mobile viewing.</p>\n\n<p>I am agnostic about how this is done, whether it's an app, or a setting in the Android default browser, or something else.</p>\n\n<p>PS: I've tried downloading the Firefox beta for my phone (HTC Magic), but it seems that it is not available for my model.</p>\n\n<p>Thanks for any advice.</p>\n","viewcount":932,"dups":[],"title":"Can CSS be over ridden on Android the same way userContent.css works on Firefox?","tags":["browser","applications"],"userid":"5892","related":[],"score":7,"answers":["13151","74979"],"acceptedanswer":"13151","creationdate":"2011-03-28T11:42:44.853","favoritecount":3,"comments":["14559","14566"]},"7644":{"body":"<p>I tried to send a <strong>text message</strong> - <strong>attaching a photo</strong> already on my phone ( the first time ) and attaching a picture taken at time of send ( the second time ).</p>\n\n<p>However, <strong>when I try to send this text message</strong> - the status remains <code>sending</code> ( <em>an my correspondent does not receive the message</em> ).</p>\n\n<p>Is this a problem with my phone company, you think, or can I have changed some setting somehow. Is there a setting that can be set, anyhow ?</p>\n\n<p>I did send picture attachments with text message before , some weeks ago , but not after upgrading to Froyo 2.2.1 ( just to be complete - can't think this has anything to do with it ).</p>\n\n<p><strong>------------- [ UPDATE ]-------------------------</strong></p>\n\n<p>Something I noticed but did not mention before : if I view a <strong>text message with a picture attached</strong>, and press the image to 'view' it,*a sort of movie view is started*e.g. with the picture at the top of the screen, and a <code>Start</code>, <code>Rewind</code> and <code>Forward</code> button at the bottom. Pressing the <code>Start</code> will <strong>'play'</strong> the picture as move of about 5 seconds - since it is a picture, of course the image does not change. I am pretty sure this was not the case when I sent some image messages a couple of weeks ago. To be complete: even the image messages I did send before now show this 'movie' type of action.</p>\n","viewcount":64451,"dups":[],"title":"I can't send a picture attachment together with a text message any more ( Samsung Galaxy S). Any idea why?","tags":["samsung-galaxy-s","sms","attachment"],"userid":"594","related":[],"score":9,"answers":["8035","15818","15819","17522","18615","8079","7965","7951","7645"],"acceptedanswer":"8035","creationdate":"2011-03-29T11:53:18.360","favoritecount":0,"comments":["9719"]},"37142":{"body":"<blockquote>\n  <p><strong>Possible Duplicate:</strong><br>\n  <a href=\"http://android.stackexchange.com/questions/16657/does-any-version-of-android-support-ad-hoc-connections\">Does any version of Android support ad-hoc connections?</a>  </p>\n</blockquote>\n\n\n\n<p>Which versions of Android do support Ad-Hoc (peer-to-peer) Wi-Fi? Or neither? Where to read about it? May be some table somewhere?</p>\n\n<p>P.S. I mean without rooting.</p>\n","viewcount":25,"dups":["16657"],"title":"Android Ad-Hoc Wi-Fi support","tags":["wi-fi","ad-hoc-networks"],"userid":"13785","related":["16657"],"score":1,"answers":[],"acceptedanswer":false,"creationdate":"2013-01-08T11:39:26.300","favoritecount":0,"comments":["48712","48755","48758"]},"37143":{"body":"<p>I have a weird problem. My headset works with music, but not with calls. The headset icon shows, but the sound still comes from the phone (instead of the headset) when I make a call. Music works fine with the headset.</p>\n\n<p>This is what I'm using:</p>\n\n<p><img src=\"http://i.stack.imgur.com/XK8rT.jpg\" alt=\"enter image description here\"></p>\n","viewcount":378,"dups":[],"title":"Headset works on music but not on call","tags":["2.3-gingerbread","cyanogenmod","audio","samsung-galaxy-ace","headphones"],"userid":"14890","related":[],"score":1,"answers":[],"acceptedanswer":false,"creationdate":"2013-01-08T12:44:57.397","favoritecount":0,"comments":["48706","48707","48708","48710","48715","48756","48759","57682"]},"37141":{"body":"<p>I would like to extend a WiFi signal. I could buy a WiFi repeater, but a much cheaper solution would be using an older Android 4 device, which I own and don't use. The Android device is capable of creating a WiFi AP. So if I bought an external WiFi USB adapter for it, with a large antenna used as the receiver and the Android device itself as the AP, I could bridge the network.</p>\n\n<p>The hardware should be possible. But how about the Android software? Will there be any issues, or any considerations I need to take note of?</p>\n","viewcount":6647,"dups":[],"title":"Android as WiFi bridge with AP","tags":["wi-fi","wifi-hotspot"],"userid":"26358","related":["24139"],"score":3,"answers":["63096","37183","37146"],"acceptedanswer":"37146","creationdate":"2013-01-08T11:27:30.717","favoritecount":1,"comments":["48704","48779","48954"]},"37145":{"body":"<p>I recently bought the Samsung S950C Galaxy S phone from Walmart and am considering returning it. (I wanted the Galaxy SII but was told by a sales person that it wouldn't work in my area (03813)). The S950C uses Verizon towers, and the Galaxy SII uses AT&amp;T. </p>\n\n<p>The problem is...when I'm in my house, I only get from 0 to 3 white bars, and on a rare occasion, I'll get 4, never all 5 (I forgot to notice the bars when I've been out on the main road, 8 mins. away.). I do live in a pretty rural area of Center Conway, NH.</p>\n\n<p>So is this issue a Straight Talk signal issue, or do I have a lousy signal from Verizon's towers? What would cause this issue, and who should I call about it...Straight Talk or Verizon? Do you think it could be this particular phone, and that I should return it and get the same thing, or wouldn't that change the signal? Another problem is that when downloading apps, wallpaper, etc., it sometimes times-out many many times. </p>\n\n<p>Well, thanks in advance for your help.</p>\n","viewcount":557,"dups":[],"title":"Poor signal strengths on Samsung S950C Galaxy S Inside the house","tags":["signal"],"userid":"26360","related":[],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2013-01-08T13:02:48.227","favoritecount":0,"comments":["48713","48746","48752","48777","48782"]},"3308":{"body":"<p>Is there anyway to list all the applications installed on your phone and the permissions they require all on one page, or export the list so it can easily be audited?</p>\n","viewcount":1166,"dups":[],"title":"Audit app permissions easily in one place?","tags":["applications","security","permissions","privacy"],"userid":"137","related":["605"],"score":19,"answers":["3417","3309","13851"],"acceptedanswer":"3309","creationdate":"2010-12-02T11:40:15.003","favoritecount":4,"comments":[]},"40579":{"body":"<p><br/>\nI got a problem with my Samsung Galaxy S2 I9100.<br/>\nI have it for round about 8 monthts now and experimented with some custom roms. I installed cynogenmod 9, 10, 10.1 tested Syah Kernel and installed AOKP in DualBoot and so on. <br/>\nEverything was fine until I installed CM10.1 as single boot. <br/> \nThere my phone started to turn off randomly and I thought that it would be a software mistake and reinstalled the Samsung stock rom. But the problem is still existing. <br/> \nI dont use a firewall or antivirus program and did not checked up anything. <br/> \nCan you help me with this issue or tell me how I should start detecting or solving the problem? <br/> \nThanks for your help!\n<br/> <br/>\nEdit: <br/>\nI installed awg Antivirus and scanned my phone. Beside SWFPlayer there was no app which is \"dangerous\". And my \"marked\" settings were \"Enable Debugging\", \"Allow Third Party Apps\".</p>\n\n<p>Edit 2: <br/>\nI now updated my phone via Kies to Android 4.1.2 but the problem still exists.\n<br/> <br/>\nEdit 3: <br/>\nI think I got the problem. I already wrote it in my last comment. The batterie infalted and I think  that's the problem. I ordered a new batterie and hope that's it. If not I don't know what it might be...</p>\n","viewcount":441,"dups":[],"title":"Galaxy S2 turns off randomly","tags":["4.0-ice-cream-sandwich","samsung-galaxy-s-2","power-on","troubleshooting"],"userid":"28965","related":[],"score":1,"answers":[],"acceptedanswer":false,"creationdate":"2013-03-01T19:37:44.250","favoritecount":1,"comments":["55087","55090","55094","55104","55106","55111","55735","55745","56088"]},"44898":{"body":"<p>I've bought an adapter for watching movies and tv shows from my smartphone (galaxy s3) to the big screen tv. </p>\n\n<p>For some reason, all of the video player apps I've tried so far have problems with showing Hebrew subtitles: either they become gibberish, or they have punctuations marks being put on the wrong places (for example \".\" in the beginning of the sentence instead of at the end).</p>\n\n<p>Here's a screenshot of MX-Player app, showing a subtitle :</p>\n\n<p><img src=\"http://i.stack.imgur.com/CaMAo.png\" alt=\"enter image description here\"></p>\n\n<p>In Hebrew, the \".\" should be placed on the left of the sentence since you read from right to left. Same goes with any other mark (such as \"?\" , \"!\", \",\" ,...).</p>\n\n<p>On a PC, it's hard to find any app that has such problems.</p>\n\n<p>Maybe it's because it's an RTL (right to left) language, and Android doesn't support such languages well (on 4.2 i think the situation has changed though).</p>\n\n<p>Anyway, is there anything one can do about this? Does it require a special video player to shows Hebrew subtitles well?</p>\n","viewcount":564,"dups":[],"title":"How to watch videos with Hebrew subtitles?","tags":["applications","video","hebrew"],"userid":"33392","related":[],"score":2,"answers":["70162"],"acceptedanswer":false,"creationdate":"2013-05-04T10:40:45.800","favoritecount":0,"comments":["60709","60719","60723","60736","60740","60741","100938"]},"40571":{"body":"<p>Hello fellow Android enthusasts,</p>\n\n<p>I recently bought a Nexus7 that I want to use for development. The thing is, every time I connect it to my USB, in order to test some apps on it, it starts charging. Now, i know that this is absolutely normal for every device, but I am also concerned that the constant charge/discharge cycles can shorten the life of the battery. What do I do?</p>\n\n<p>Do I need to get concerned at all? I mean, if it reduces battery life with something like 1% per year, I am totally fine with it. Yet, if it is a significant drain, how can I prevent it from charging unless I am charging from a charger?</p>\n","viewcount":423,"dups":[],"title":"How to prevent Nexus 7 of charging the battery every time when connected to a USB?","tags":["battery","battery-life","charging","nexus-7"],"userid":"29340","related":["1020"],"score":1,"answers":["40572"],"acceptedanswer":false,"creationdate":"2013-03-01T16:11:57.247","favoritecount":0,"comments":["55074"]},"40575":{"body":"<p>I recently moved to X-gamer, a gb based stock rom. I flashed gapps for gb thinking I would get back voice search and talk. However it seems only talk got installed. Voice search link on Google play shows 'item not found'. How do I install Google voice search? </p>\n","viewcount":219,"dups":[],"title":"How do I install Google voice search on a rooted gb custom rom?","tags":["2.3-gingerbread","google-apps"],"userid":"18752","related":[],"score":1,"answers":[],"acceptedanswer":false,"creationdate":"2013-03-01T18:11:51.367","favoritecount":0,"comments":[]},"40574":{"body":"<p>My phone has been stuck in a boot loop and I need to safely retrieve the contents via card-to-PC transfer, then PC-to-new card, then new card-to-phone, etc. I read somewhere on here that <strong>you must reformat your SD card before you can connect it to your PC to copy its contents. Is this true?</strong></p>\n\n<p>If so, <strong>will I lose my stuff from reformatting my card?</strong> Every time I've tried reformatting my card, I get a dialog box that tells me all my card's contents could be destroyed if I go ahead, so I refrain.</p>\n\n<p>Seems like it would be pointless to try and retrieve my card's contents if I must destroy them first. I'm fairly new to this stuff, so please excuse my lack of knowledge for it.</p>\n\n<p>Also, once I get all of my content into my new SD card, <strong>do I need to format the new card when inserted in my phone?</strong> I notice that whenever I put an SD card with files on it into a new phone, I get a prompt saying that all contents could be destroyed if I format, even though I want these files on my phone and certainly <em>not</em> destroyed. </p>\n\n<p>Thanks for any and all questions answered, I appreciate it. </p>\n","viewcount":1086,"dups":[],"title":"Do you have to reformat an SD Card before you can copy its contents to your PC?","tags":["boot-loop","external-sd","formatting"],"userid":"29281","related":["40536"],"score":4,"answers":["40577"],"acceptedanswer":"40577","creationdate":"2013-03-01T17:43:31.393","favoritecount":1,"comments":[]},"14413":{"body":"<p>When playing back MP4 video files my Acer Iconia A500 will drop frames and produce video artifacts. Does it just not support MP4, or is there a better MP4 player I can download?</p>\n\n<p><strong>Update</strong>: Turns out it was just an issue with 1080p video. 720p video plays back great.</p>\n","viewcount":1723,"dups":[],"title":"Is there a solution for poor Acer Iconia A500 playback of MP4 video?","tags":["video","acer-iconia-a500","mp4"],"userid":"4847","related":[],"score":2,"answers":["15485","14580","14521","14414"],"acceptedanswer":"14580","creationdate":"2011-10-10T17:18:26.193","favoritecount":0,"comments":[]},"14411":{"body":"<p>I have a PIN to lock the phone so in case someone else gets my phone, they will be deterred from accessing any personal info that might be on it.</p>\n\n<p>But I don't really need this everywhere. When I am at my desk, I always keep the phone there, and I would like for it to not to lock, or to lock less often. (At times, I will be adjusting music, or using the stopwatch or whatever)</p>\n\n<p>Is there a way to change the PIN lock timeout depending on GPS location? If I am not at home or the office, it might as well be on instant lock as soon as the screen goes off.</p>\n","viewcount":854,"dups":[],"title":"Change auto-lock timeout by GPS?","tags":["gps","lock-screen"],"userid":"6016","related":[],"score":4,"answers":["14412"],"acceptedanswer":"14412","creationdate":"2011-10-10T16:26:25.660","favoritecount":0,"comments":["17085"]},"58362":{"body":"<p>I have a Motorola Droid Razr Maxx HD (Verizon), and it is running firmware version 4.1.2 (not rooted).</p>\n\n<p>I don't have Google Now on my device, even though it is running 4.1. Why isn't Google Now installed? How can I get this app on my device?</p>\n","viewcount":39,"dups":[],"title":"\"Google Now\" missing on Motorola Droid Razr","tags":["google-now","motorola-droid-razr"],"userid":"47675","related":[],"score":0,"answers":[],"acceptedanswer":false,"creationdate":"2013-12-05T18:26:47.610","favoritecount":0,"comments":["79205","79206"]},"14417":{"body":"<p>I'm trying to stream satellite TV from my desktopPC to my Android phone.</p>\n\n<p>I'm using <a href=\"http://www.dvbdream.org/\" rel=\"nofollow\">DVB Dream</a>, the software is transmitting on <code>udp://@</code>. I've already tried downloadingVLC for Android, but it seems like UDP streaming is not supported.</p>\n\n<p>Do you have any idea that could help me solve this riddle?</p>\n","viewcount":2752,"dups":[],"title":"StreamingUDP protocol on Android","tags":["video","streaming"],"userid":"8681","related":[],"score":6,"answers":["18798"],"acceptedanswer":false,"creationdate":"2011-10-10T20:53:42.933","favoritecount":2,"comments":["17127","17128"]},"14416":{"body":"<p>I sometimes want to export a downloaded podcast to my computer, but I've yet to find the location where <strong>Google Listen</strong> stores them.  Does anyone know?</p>\n","viewcount":97,"dups":[],"title":"Where are my Google Listen podcasts","tags":["podcast","google-listen"],"userid":"1744","related":[],"score":2,"answers":["14418"],"acceptedanswer":"14418","creationdate":"2011-10-10T21:04:31.987","favoritecount":1,"comments":[]},"5490":{"body":"<p>We know that Google Calendar application has a way to set reminder / alarm. However, there are times (well, almost every time) when I forgot to set reminder and I missed it :(.</p>\n\n<p>My question is, is there an application (preferably free, as I don't have CC and Google's Android market doesn't support PayPal, yet) that can help me set defult reminder for every event I have? So that if I forgot to set it on calendar application, this application will help me remind events.</p>\n\n<p>I've already test <code>Calendar Snooze</code>. But, it require me to set an alarm first.</p>\n","viewcount":1332,"dups":[],"title":"Application To Set Default Calendar Reminder","tags":["calendar","alarm"],"userid":"1679","related":[],"score":1,"answers":["5501","5492","5542"],"acceptedanswer":"5542","creationdate":"2011-02-01T03:23:24.750","favoritecount":0,"comments":[]},"13829":{"body":"<p>For the PC there is a plugin for the google calendar so that edits to the calendar can be made offline. On my Android 2.1 there does not seem such an option. </p>\n\n<p>I am using the calendar though the browser and not an app. On the app market place I cannot find the app so I am using the browser..</p>\n","viewcount":3034,"dups":[],"title":"Is there an 'offline' version of Google calendar for Android?","tags":["calendar","offline","google-calendar"],"userid":"7753","related":[],"score":2,"answers":["13932","13831"],"acceptedanswer":"13932","creationdate":"2011-09-25T22:10:10.270","favoritecount":0,"comments":["16572","16577","16608","16611","92181"]},"13828":{"body":"<p>When I try to update the swype beta via the Swype Installer app, it starts downloading the Swype Installer, but then I get the error message \"Parse error\".</p>\n\n<p>I tried downloading a new Swype Installer from beta.swype.com/android/get, but had not had any luck with that either. (same result)</p>\n\n<p>Swype however does not let me keep using they swiping technology (or whatever it's called) and tells me I should update. (While having no built-in update functionality)</p>\n\n<p>I am currently using Swype version 3.6.84.26668.t100.26701 (who uses version numbers like that, seriously...) and the Swype Installer version 1.1.26483 (12.15)</p>\n\n<p>My phone is a branded HTC desire with Android 2.2</p>\n\n<p>How can I update Swype or get a new version of Swype without losing my dictionary.</p>\n\n<p><strong>Update:</strong></p>\n\n<p>I uninstalled and reinstalled the Swype installer (now v 12.16), but now it seems to think my version is up to date and does not provide me a possibility to update. (only the ususal menu - watch video, etc) My Swype however still is in the old version and gives me a warning.</p>\n","viewcount":1189,"dups":[],"title":"\"Parse error\" when updating swype","tags":["update","swype"],"userid":"8283","related":[],"score":1,"answers":["13832"],"acceptedanswer":false,"creationdate":"2011-09-25T20:47:58.240","favoritecount":0,"comments":[]},"13822":{"body":"<p>My phone is Sony Ericsson Xperia X10. </p>\n\n<p>I just updated my phone's software to the latest Android version (2.3.3), however, I've found that I can't download some applications. It would start the download and within 5 seconds, I get a message (from my notification bar) informing me that the \"download was unsucessful\" I have tried downloading it several times after with the same result. Please advice!</p>\n","viewcount":112,"dups":[],"title":"Can't download some apps from Google market after phone software update","tags":["applications","google-play-store"],"userid":"8275","related":[],"score":0,"answers":["13825"],"acceptedanswer":false,"creationdate":"2011-09-25T13:32:46.173","favoritecount":0,"comments":[]},"13821":{"body":"<p>Any idea how can I connect my Samsung Galaxy S II to Freebox server? I have no idea how to set up wifi connection between them. Please note that I want to connect my phone to Freebox server as described here, I just want to get pictures straight off of my phone onto the Freebox server to TV.</p>\n","viewcount":321,"dups":[],"title":"Galaxy S II via Freebox server to TV","tags":["samsung-galaxy-s-2"],"userid":"8273","related":[],"score":0,"answers":["13886"],"acceptedanswer":false,"creationdate":"2011-09-25T12:40:14.110","favoritecount":0,"comments":["16574"]},"13827":{"body":"<p>Can I search for  Android APPs that are in Hebrew or Kurdish?\nor are all apps automatically translated into all languages?</p>\n","viewcount":60,"dups":[],"title":"Search for apps based on language","tags":["applications","google-play-store","2.3-gingerbread","3.0-honeycomb","languages"],"userid":"5253","related":[],"score":1,"answers":["13834"],"acceptedanswer":false,"creationdate":"2011-09-25T17:53:14.483","favoritecount":0,"comments":[]},"13826":{"body":"<p>I'm using HTC desire HD with sense UI.  Lately my wallpaper is being changed by the system at random (the images are some random scenery). I have checked all the recent apps I have installed, all from Google Android Market, nothing from unauthorized source. I'm suspecting It could be some malware.</p>\n\n<p>Is there any way to check which process is changing the wallpaper?</p>\n\n<p>Any malware check tool I can use to diagnose this problem?</p>\n","viewcount":131,"dups":[],"title":"Wallpaper changing randomly","tags":["htc-desire-hd","malware","wallpaper"],"userid":"129","related":[],"score":1,"answers":[],"acceptedanswer":false,"creationdate":"2011-09-25T16:24:34.307","favoritecount":0,"comments":["29906"]},"5632":{"body":"<p>Is there any app, or other method, that lets me automatically turn on Bluetooth if USB is also connected, and turn it off when USB is disconnected?</p>\n","viewcount":596,"dups":[],"title":"Turn on bluetooth when USB is connected?","tags":["bluetooth","usb"],"userid":"2019","related":[],"score":1,"answers":["5635","5633"],"acceptedanswer":"5633","creationdate":"2011-02-04T01:21:37.197","favoritecount":0,"comments":[]},"38348":{"body":"<p>With the growing number of Android devices in all sorts of different form factors (dev boards like Raspberry Pi/ODroid, Android-on-a-stick, etc), it seems like it would be great to be able to actually do development work <em>on</em> Android and not just simply <em>for</em> Android. For example, having the standard Linux build tools available would let me easily run a server.</p>\n","viewcount":721,"dups":[],"title":"Is there any easy way to get GNU build tools on Android? If not... why not?","tags":["linux","development"],"userid":"24531","related":[],"score":0,"answers":["78928","38365","38358"],"acceptedanswer":"38365","creationdate":"2013-01-25T10:04:16.997","favoritecount":1,"comments":["51899","51913","51926","51927"]},"38340":{"body":"<blockquote>\n  <p><strong>Possible Duplicate:</strong><br>\n  <a href=\"http://android.stackexchange.com/questions/3521/is-it-possible-to-install-android-on-a-pc\">Is it possible to install Android on a PC?</a>  </p>\n</blockquote>\n\n\n\n<p>Can we install Android OS on to a desktop? If yes can some one share the same thing. I have tried steps from <a href=\"http://www.howtogeek.com/howto/22665/run-android-on-your-netbook-or-desktop/\">How-To-Geek</a> and from <a href=\"http://www.android-x86.org/documents/installhowto\" rel=\"nofollow\">Android-x86 - Porting Android to x86</a>. Whenever I try to boot from the USB it says \"error: unknown filesystem.\" and stays on grub rescue prompt.</p>\n","viewcount":1590,"dups":["3521"],"title":"how to install android OS on desktop pc?","tags":["android-x86"],"userid":"27300","related":["3521"],"score":0,"answers":["38341"],"acceptedanswer":false,"creationdate":"2013-01-25T06:57:03.433","favoritecount":0,"comments":["52309"]}}