 {"11542": {"body": "<p>I can't speak specifically to the Defy, but if you've got the stock Android Contacts app and you're syncing to Google, you can tell the phone which groups to display.</p>\n\n<p>From the Contacts app <code>Menu | Display options | {account}</code>. Then check the groups you want to see, and the uncheck the ones you don't. \"My Contacts\" is going to be pretty much everything under your account. If memory serves, this is only for display; the contact info is still on the phone.</p>\n", "userid": "267", "comments": ["13961", "21324"], "score": 2, "parentid": "11541", "creationdate": "2011-07-17T13:15:06.457"}, 
 "11678": {"body": "<p>I found <a href=\"http://www.appbrain.com/app/dialer-one/kz.mek.DialerOne\" rel=\"nofollow\">Dialer One</a> which works exactly how I want : display in the contact list only the groups I want to display, with a big phone icon on the right to initiate the call.</p>\n", "userid": "6666", "comments": [], "score": 1, "parentid": "11541", "creationdate": "2011-07-22T10:41:40.797"}, 
"11601": {"body": "<p>To populate /dev, use a bind mount (rbind=recursive bind, to catch <code>/dev/pts</code>):</p>\n\n<pre><code>outside# mount --rbind /dev /path/to/chroot/dev\n</code></pre>\n\n<p>You may also want to bind other things, like <code>/home</code> and <code>/tmp</code> (to make sharing files easier). Just remember to unmount them before <code>rm -Rf</code>'ing your chroot!</p>\n\n<p>You can put bind mounts in fstab. I believe that'd look something like this:</p>\n\n<pre><code>/dev   /chroot/dev   none   rbind   0   0\n</code></pre>\n\n<p>You may need to set up <code>udev</code> to set proper permissions on your USB device. For example, here are the udev rules I use for my phone:</p>\n\n<pre><code>$ cat /etc/udev/rules.d/local-android.rules\nACTION!=\"add\", GOTO=\"local-android_rules_end\"\nSUBSYSTEM==\"usb_device\", GOTO=\"local-android_rules_real\"\nSUBSYSTEM==\"usb\", GOTO=\"local-android_rules_real\"\nGOTO=\"local-android_rules_end\"\n\nLABEL=\"local-android_rules_real\"\n\n# Mot Droid X\nATTR{idVendor}==\"22b8\", ATTR{idProduct}==\"428c\", MODE=\"660\", GROUP=\"plugdev\"\n\nLABEL=\"local-android_rules_end\"\n</code></pre>\n", "userid": "3141", "comments": ["34933"], "score": 2, "parentid": "11546", "creationdate": "2011-07-19T16:34:25.297"},
"11549": {"body": "<p>Hang on a second, you wanted to hard reset your phone because your splash screen didn't look like the one on YouTube?</p>\n\n<ol>\n<li>It is very common for carriers to change things like splash screens.</li>\n<li>You don't say where you bought your phone or who your carrier is. Can't tell you if it is a fake.</li>\n<li>If it is legit, you don't say if you bought your phone new or used or if you or a previous owner has rooted it and flashed a custom ROM. That would almost certainly change your boot splash screen.</li>\n<li>I've never owned an Android phone that required pushing the back button during a hard reset. Here is the only method of hard resetting that I have ever needed:</li>\n</ol>\n\n<p>From the main home screen, tap menu\nTap Settings, then Privacy\nTap Factory data reset\nTap Reset phone\nEnter your password if required, then tap Erase everything to confirm</p>\n", "userid": "6670", "comments": ["13781"], "score": 1, "parentid": "11547", "creationdate": "2011-07-17T15:31:51.223"},
"11585": {"body": "<p>Out of the 3 Android phones I've had, one had an \"Android\" startup splash screen, one had a manufacturer startup splash screen, and one originally had a phone network (Vodafone) startup splash screen, but was changed to a manufacturer splash screen in one of the (official) firmware updates.All were bought new and legitimate with manufacturer/carrier supplied firmware.</p>\n\n<p>I don't think you can judge anything by what the splash screen shows, especially as this can be changed by carriers and changed in official firmware updates. You need to compare it to an identical hardware model, supplied through the same channel that is running the same firmware/OS version. It is unlikely that a random Youtube video happens to be identical to yours in all those ways.</p>\n", "userid": "156", "comments": [], "score": 1, "parentid": "11547", "creationdate": "2011-07-19T10:19:51.847"},
"11553": {"body": "<p><a href=\"https://market.android.com/details?id=com.noser.droidinfo16\" rel=\"nofollow\">DROIDInfo</a> has some benchamrking features.</p>\n", "userid": "1204", "comments": [], "score": 0, "parentid": "11545", "creationdate": "2011-07-17T22:00:45.423"}, 
"5989": {"body": "<p>There are two different kinds of Widget in Android:</p>\n\n<ul>\n<li>AppWidget: a small view of an application (e.g. Weather widget) that can be embedded inside another application (e.g. Home Screen)</li>\n<li>GUI Widget: buttons, textbox, etc; any visual interface element. </li>\n</ul>\n\n<p>I believe you're talking about the former (AppWidget). An AppWidget always belongs to an App. An App that acts as a AppWidgetHost (e.g. HomeScreen apps) can lend a part of its UI to be managed by the App that provides an AppWidget.</p>\n\n<p>In short, it is a way of embedding an application inside another application.</p>\n\n<p>An AppWidget is usually used as a \"smart shortcut\"; a shortcut that provides additional logic other than just being clickable and launching an Activity. Typical examples of AppWidget is Recent Email/SMS/Facebook/Twitter/whatever-your-favorite-messaging-app Widgets, Astrid's Task List, Calendar Widget, etc. </p>\n\n<p>An AppWidget is conceptually a GUI Widget, except that AppWidget is a GUI Widget that is not provided by Android's framework, instead it is provided by some other application installed in the system.</p>\n", "userid": "482", "comments": ["6690"], "score": 10, "parentid": "5988", "creationdate": "2011-02-15T07:10:19.787"},
"19432": {"body": "<p>As far as I know, a fully updated N1 won't have any exploitable vulnerabilities to allow you to root the device. Most of the older \"one click\" and similar methods used things like Gingerbreak, which were holes in Android that eventually got patched. I have not seen a root exploit on vanilla Android since Gingerbreak.</p>\n\n<p>XDA's wiki has a couple of different options regarding the N1 which work but require unlocking the bootloader, and unlocking will perform a factory reset automatically. <a href=\"http://forum.xda-developers.com/wiki/Nexus_One/Guides_&amp;_Tutorials#Root\" rel=\"nofollow\">They can be found here</a> and basically amount to:</p>\n\n<ol>\n<li>Unlock the bootloader from fastboot mode with <code>fastboot oem unlock</code></li>\n<li>Flash a custom recovery (usually ClockworkMod)</li>\n<li>Flash a zip file from recovery that will install <code>su</code> and Superuser for you</li>\n<li>Reboot</li>\n</ol>\n", "userid": "981", "comments": [], "score": 1, "parentid": "19398", "creationdate": "2012-02-13T13:58:45.510"},
"20172": {"body": "<p>I found an app <a href=\"https://market.android.com/details?id=org.lagoscript.bookmarkhome\" rel=\"nofollow\">Bookmark Home</a> which adds <em>Add bookmark</em> to the share list. If you send a bookmark to it, it will be stored in the apps own storage, but there is an export option to save all of them in the Browser bookmarks.</p>\n", "userid": "3366", "comments": ["23364"], "score": 3, "parentid": "19397", "creationdate": "2012-03-03T14:41:52.927"}, "6310": {"body": "<p>You can change the Sense 'skin' (Menu -> Personalize -> Skin), which at least changes the dock's style, but I'm afraid if you want to keep the Sense widgets you're stuck with the Sense Launcher and its dock.</p>\n", "userid": "1274", "comments": [], "score": 1, "parentid": "6298", "creationdate": "2011-02-23T18:21:24.557"},
"20300": {"body": "<p>WARNING: THIS IS COMPLETELY SPECULATIVE - I DON'T USE WINDOWS</p>\n\n<p>It's possible that Verizon is using <a href=\"https://en.wikipedia.org/wiki/OS_fingerprinting\" rel=\"nofollow\">OS Fingerprinting</a> to determine that you're tethering.</p>\n\n<p>Windows 7 (and possibly Vista) <a href=\"http://technet.microsoft.com/en-us/library/ee126135%28WS.10%29.aspx\" rel=\"nofollow\">also connects to a particular Microsoft site</a> to attempt to determine if an \"additional log on\" is required - if it doesn't get an expected response back, it surmises you're in a captive portal and warns you. Verizon can look for that network request.</p>\n\n<p>(You can configure this behavior to ping any site you want instead of Microsoft's; see the KB article.)</p>\n\n<p>With Ubuntu...the OS fingerprint would show the system as Linux, which is no different than Android.</p>\n\n<p>Another guess: Verizon can see that the TTL of your packets has increased by one , so that it could figure out there's a hop beyond your phone. This would have to depend on how the OS uses the phone as a network device - it's possible Windows treats the phone as a gateway. I know Linux treats the phone as a network card.</p>\n", "userid": "6830", "comments": [], "score": 1, "parentid": "5983", "creationdate": "2012-03-05T22:13:02.540"},
"21414": {"body": "<p>A lot of mobile network operators perform network analysis (deep packet inspection) of all transfered data. In that way they are able to identify which protocols are used. </p>\n\n<p>Identifiable protocols that indicate a desktop PC are for example:</p>\n\n<ul>\n<li>Windows Update</li>\n<li>Virus scanner update</li>\n<li>Broadcasts sent by Windows</li>\n</ul>\n\n<p>Another very easy and common way to identify the system is to read the UserAgent string the web-browser sends in each request. There are add-ons available for Firefox to fake the user-agent may you should try it and fake your browser to something unknown.</p>\n", "userid": "2241", "comments": ["25341"], "score": 2, "parentid": "5983", "creationdate": "2012-04-05T11:35:22.687"},
"19395": {"body": "<p>The Amazon Kindle Store and the Google Android Market are different stores.  Apps you buy in one store are not honored in the other store.</p>\n\n<p>You can install the Amazon Store on your Nexus One pretty easily, so you'll be able to use Apps you buy on your Fire on your Nexus One.  But going the other way is more trouble (it currently requires you've rooted your Kindle Fire).  See <a href=\"http://android.stackexchange.com/questions/17338/how-can-i-get-the-android-market-installed-on-my-kindle-fire\">How can I get the Android Market installed on my Kindle Fire?</a></p>\n", "userid": "8244", "comments": [], "score": 10, "parentid": "19394", "creationdate": "2012-02-12T08:44:55.703"}, 
"27615": {"body": "<p>If your Galaxy Nexus is rooted, install this app: <a href=\"https://play.google.com/store/apps/details?id=eu.chainfire.stickmount\" rel=\"nofollow\">StickMount</a>. Then connect your USB to a USB-to-MicroUSB cable (such as <a href=\"http://rads.stackoverflow.com/amzn/click/B002HMWQE2\" rel=\"nofollow\">this one</a>), and plug the micro usb into the phone, a popup will appear asking you what application do you want to open, select StickMount. Using a file manager, such as <a href=\"https://play.google.com/store/apps/details?id=pl.solidexplorer\" rel=\"nofollow\">this one</a>, navigate to: <strong>/sdcard/usbStorage/</strong> you will find your USB files there.</p>\n\n<p>Note: If your phone is not rooted, you cannot do this.</p>\n", "userid": "6072", "comments": [], "score": 0, "parentid": "19390", "creationdate": "2012-08-14T17:30:01.397"},
"37529": {"body": "<p>You must be looking for <a href=\"http://www.samsung.com/us/mobile/cell-phones-accessories/ET-R205UBEGSTA\" rel=\"nofollow\">this</a>. Though it is costly, you can get local cables from radio shack or so. Then, use stickmount app. Note that this works only after rooting.</p>\n\n<p>P.S. Rooting is not as complex as it sounds. You are just gaining access to your own phone. In Galaxy Nexus, you can unroot as well!</p>\n", "userid": "24568", "comments": [], "score": 0, "parentid": "19390", "creationdate": "2013-01-13T05:12:24.947"},
 "82458": {"body": "<p>Because that website is providing an <code>Invalid Certificate</code> when opened. Use Chrome/Firefox and add a security exception to open the page i.e. click on <code>Continue anyway</code> when prompted.</p>\n", "userid": "68295", "comments": ["105602"], "score": 0, "parentid": "82448", "creationdate": "2014-09-12T16:08:09.887"}, 
"82444": {"body": "<p>Try this link first - <a href=\"http://www.lg.com/uk/support-mobile/lg-LGE410I#\" rel=\"nofollow\">LG L1 Support Page</a> and checkout the manuals provided. If you don't find what you need then try <code>Live Chat</code> provided below in the same page to ask them directly about this problem. If no chat agents available at that time try emailing them.</p>\n", "userid": "68295", "comments": [], "score": 1, "parentid": "82442", "creationdate": "2014-09-12T12:07:18.820"},
"46138": {"body": "<p>I had a similar issue - only seemed to happen when power had got really low and wifi was on. the way I got around it was:</p>\n\n<p>Connect to charger\nShut down nexus\nHold \"volume down\" and power button until it wakes up\nOn the bootloader screen, press up until it says \"recovery mode\"\nPress power\nYou should see the Android logo with a red exclamation mark \nPress and hold power, and then press \"volume up\" which should take you to the recovery menu. \nOnce in recovery mode, leave plugged in and fully charge (several hours). \nOnce fully charged shut down and restart and it <em>should</em> get past the X.</p>\n\n<p>Good luck!</p>\n", "userid": "34662", "comments": [], "score": 1, "parentid": "46136", "creationdate": "2013-05-26T17:06:40.013"},
"46154": {"body": "<p>Search for terminal in google play, the first thst appears has ssh on it,i use it to.It is made by Jack Palevich. I can't give you direct link because i am writeing from my phone.\nThe problem is, I think you need to be rooted</p>\n", "userid": "33346", "comments": [], "score": 1, "parentid": "46133", "creationdate": "2013-05-26T22:29:40.253"},
"46225": {"body": "<p>The best Terminal Emulator out there currently is:</p>\n\n<p><a href=\"https://play.google.com/store/apps/details?id=jackpal.androidterm\" rel=\"nofollow\">https://play.google.com/store/apps/details?id=jackpal.androidterm</a></p>\n\n<p><img src=\"http://i.stack.imgur.com/eFa1B.png\" alt=\"enter image description here\"></p>\n\n<p>Here is it's wiki:</p>\n\n<p><a href=\"http://github.com/jackpal/Android-Terminal-Emulator/wiki\" rel=\"nofollow\">http://github.com/jackpal/Android-Terminal-Emulator/wiki</a></p>\n\n<p>Regards,</p>\n", "userid": "14103", "comments": [], "score": 3, "parentid": "46133", "creationdate": "2013-05-28T07:07:33.057"},
"39206": {"body": "<p>You better go to Cellshopes, get \"Root\" on your Adroid device, but it's too risky and oftentimes warranty will be voided once it happen.</p>\n", "userid": "28089", "comments": ["53096"], "score": -1, "parentid": "36706", "creationdate": "2013-02-08T04:44:33.447"},
"19975": {"body": "<p>This is a way of <a href=\"http://stackoverflow.com/questions/4967669/android-install-apk-programmatically/4969421#4969421\">programatically installing APKs</a></p>\n\n<p>the code snippet you're looking for is:</p>\n\n<pre><code>Intent intent = new Intent(Intent.ACTION_VIEW);\nintent.setDataAndType(Uri.fromFile(new File(Environment.getExternalStorageDirectory() + \"/download/\" + \"app.apk\")),\"application/vnd.android.package-archive\");\nstartActivity(intent);\n</code></pre>\n", "userid": "1353", "comments": ["23118"], "score": 0, "parentid": "19973", "creationdate": "2012-02-27T16:48:58.717"},
 "19972": {"body": "<p>If you install a completely original ROM for the device, it will be unrooted. flashing the correct Stock ROM for your device will revert it back to its original factory state. Remember to Wipe both the Cache and Data when you flash. </p>\n\n<p>in the post you linked it also says:</p>\n\n<blockquote>\n  <p>Notice: These are NOT rooted, and contain radio/hboot rom updates</p>\n</blockquote>\n", "userid": "1951", "comments": [], "score": 3, "parentid": "19970", "creationdate": "2012-02-27T16:23:35.420"},
"20003": {"body": "<p>I'm not sure about Vietnamese, but for example in Finnish, there are some extended characters that are problematic. This is because some pages are encoded as ISO-8859-15 and some are UTF-8. If autodetection in the browser fails, they will be displayed as boxes or garbage. The same thing happens if the font only supports one encoding and the page uses the other. I'd recommend to check the encoding of the font and the encoding of the pages you tried, and change the font if necessary.</p>\n", "userid": "475", "comments": [], "score": 4, "parentid": "19977", "creationdate": "2012-02-28T06:17:26.317"},
"12017": {"body": "<p>If the bootloader comes locked, <a href=\"http://forum.xda-developers.com/showthread.php?t=875580\" rel=\"nofollow\">it can be easily unlocked</a>.  Google doesn't let the flagship devices be sold any other way, since they are designed for development.</p>\n\n<p><a href=\"http://www.engadget.com/2011/07/24/atandt-google-nexus-s-on-sale-today-exclusive-to-best-buy/\" rel=\"nofollow\">Endgadget says</a> it's SIM locked. <a href=\"http://reviews.bestbuy.com/3545a/2356115/samsung-google-nexus-s-mobile-phone-black-reviews/reviews.htm?reviewID=5109791\" rel=\"nofollow\">This review</a> says it's unlocked, but I bet they didn't buy it with a contract.</p>\n\n<p>The specs for Best Buy's <a href=\"http://www.bestbuy.com/site/Google+-+Nexus+S+Mobile+Phone+-+Black+%28T-Mobile%29/1484107.p?id=1218262482328&amp;skuId=1484107&amp;st=nexus%20s&amp;cp=1&amp;lp=1&amp;contract_desc=\" rel=\"nofollow\">\"T-Mobile version\"</a> state that it works for EDGE (2.5G) on the 850 and 1900 MHz frequency bands, in addition to others, which are what AT&amp;T uses.  So EDGE should be usable on any GSM network in the world (I can't find the specs to see if the AT&amp;T version is likewise compatible).  3G/HSPA won't work on AT&amp;T and some others, though, since it's limited to the 900/1700/2100 bands used by T-Mobile.  <a href=\"http://www.google.com/phone/detail/nexus-s\" rel=\"nofollow\">Google</a> confirms this info.</p>\n", "userid": "1465", "comments": ["14363"], "score": 2, "parentid": "12016", "creationdate": "2011-08-02T20:22:08.060"},
"12418": {"body": "<p>A review on <a href=\"http://reviews.bestbuy.com/3545a/2356115/samsung-google-nexus-s-mobile-phone-black-reviews/reviews.htm?reviewID=5149993\" rel=\"nofollow\">Best Buy's website</a> suggested that the AT&amp;T Nexus S is SIM unlocked. The author of the review claims that he was able to insert a T-Mobile SIM card immediately after purchasing the phone without any issues. This make sense since Google touts the lack of a SIM lock on (its Nexus S feature page](http://www.google.com/nexus/#/features).</p>\n\n<p>All information that I can find online supports the idea that the AT&amp;T version, even if it bought subsidized, is SIM unlocked. The only source I could find suggesting otherwise is the <a href=\"http://www.engadget.com/2011/07/24/atandt-google-nexus-s-on-sale-today-exclusive-to-best-buy/\" rel=\"nofollow\">Engadget article previously mentioned</a>, but that claim seems unsourced (and therefore likely incorrect).</p>\n\n<p>Since the <a href=\"http://android.stackexchange.com/questions/8606/what-is-meant-by-the-nexus-s-being-a-developer-phone\">Nexus S is intended to be a developer phone</a>, all models should have bootloaders that are easily unlocked.</p>\n", "userid": "7263", "comments": [], "score": 2, "parentid": "12016", "creationdate": "2011-08-12T23:02:06.307"},
"13915": {"body": "<p>Have you try with <a href=\"http://www.youtube.com/watch?v=Cy0WWgipkUw&amp;feature=player_embedded\" rel=\"nofollow\">Fring</a>, i don't know about the bandwidth but it does allow Google Talk.</p>\n\n<p>You can also check <a href=\"http://www.youtube.com/watch?v=fNKV40vlnls&amp;feature=relmfu\" rel=\"nofollow\">What is Fring</a></p>\n\n<p>If fring does not convinced you try <a href=\"https://market.android.com/details?id=com.truphone.andrd\" rel=\"nofollow\">TruPhone</a></p>\n\n<p>Although if you ask me i'm quite sure that you won't be able to win skype app bandwidth usage on their own application, i mean they must (or should) know their stuff.</p>\n\n<p>Let Me know</p>\n", "userid": "7094", "comments": [], "score": 1, "parentid": "12011", "creationdate": "2011-09-28T10:55:32.733"}, "5568": {"body": "<p>You need two other applications from the market to to this</p>\n\n<ul>\n<li>A file browser (astro, ...)</li>\n<li>A application installer (appinstaller, ...)</li>\n</ul>\n\n<p>First, you must go to Settings -> Applications -> check \"install application from untrusted sources\"</p>\n\n<p>Then, you can navigate to the apk file (you must have copy the apk file to your SD card) with the file manager and launch it with appinstaller</p>\n", "userid": "2608", "comments": ["6080", "6113"], "score": 2, "parentid": "5566", "creationdate": "2011-02-02T13:59:39.120"},
 "14726": {"body": "<p>Bandwidth consumption depends on the codec that the app will use. Skype uses SILK or G729 (see wikipedia for their bandwidth consumption).</p>\n\n<p>You can see here <a href=\"http://searchvoip.techtarget.com.au/articles/23239-VoIP-codecs-Day-Three-Low-bandwidth-codecs\" rel=\"nofollow\">http://searchvoip.techtarget.com.au/articles/23239-VoIP-codecs-Day-Three-Low-bandwidth-codecs</a> more low bandwidth codecs and search for an application that support one of them.</p>\n\n<p>I have used SipDroid that has support for SILK and Speex too.\nFor linux client you can use SFLphone or ekiga. I have used both with Asterisk and SipDroid and worked quite well.</p>\n", "userid": "8925", "comments": [], "score": 4, "parentid": "12011", "creationdate": "2011-10-18T20:42:36.130"},
"13923": {"body": "<p>Get the <a href=\"https://github.com/pcgod/mumble-android/downloads\" rel=\"nofollow\">pcgod's mumble client for android</a> (don't get it from the market because the market one is not the pcgod uploader and is very old and not updated). </p>\n\n<p>Mumble is an open source VOIP client that is available for windows and linux. However, this VOIP is a client-server one , hence requires both the clients to connect to a server. While you may choose a public server in the list when launching the desktop application of mumble, it's better to configure and setup your own mumble server so that you have more choice of freedom and you can even set the voice quality and codec that can use lesser bandwidth. Further, mumble is more like Push to Talk, so it uses very little bandwidth (I was torrenting on my 256k connection while using mumble with just 2 people in the room and still it was fine!)</p>\n", "userid": "5501", "comments": ["17261"], "score": 4, "parentid": "12011", "creationdate": "2011-09-28T15:30:00.293"},
"28568": {"body": "<p>This doesn't happen when you run ssh as root.</p>\n\n<p>/sdcard is an <strong>unsafe(!)</strong> location for ssh client config and valuable keys (some users don't even encrypt their keys for reasons of laziness). Each app has read access to that location, so this is most probably set deliberately <strong>not to /sdcard/.ssh</strong> for security reasons. </p>\n\n<p>If you have root access, create a symlink from /data/ssh_data or /data/.ssh to /data/jackpal.androidterm/ or create the folder with appropriate access rights for the terminal app (not system wide read/write though!).</p>\n\n<p>By the way:<br>\nThis might be fixed soon. See CyanogenMod's github commit log <ahref=\"https://github.com/CyanogenMod/android_external_openssh/commit/0a8617ed5af2f0248d0e9648e26b224e16ada742\" rel=\"nofollow\">here</a>. Excerpt:</p>\n\n<blockquote>\n  <p>Some users have / as home directory, some /data. This commit fixes ssh\n  and ssh-keygen trying to create /.ssh which is volatile and read-only\n  anyway.</p>\n  \n  <p>To allow an app (e.g. Android Terminal Emulator) to use ssh\n  /data/ssh_client still has to exist and owner permissions need to be\n  set to the app user. This could be fixed by using the real data\n  directory (/data/data/\"app\") in a later commit.</p>\n</blockquote>\n", "userid": "15713", "comments": [], "score": 2, "parentid": "17258", "creationdate": "2012-08-31T07:55:22.187"},
"64677": {"body": "<p>Well AOSP [pure android from google's kitchen] is the Android Open Source Project which is the father and the mother of all ROMS out there, it is the base android code.</p>\n\n<p>AOKP is kanged [copied/stolen], its based on AOSP or derived from AOSP with some mods.</p>\n\n<p>Differences are mostly UX and UI based, for example HTC Sense and Samsung TouchWiz are all just skins on top of pure android. Ok not pure android there is a lot of stuff modified by the big banners. The basic idea is this, AOSP is what google gives and AOKP is what people build with features on top of AOSP.</p>\n\n<p>EDIT : <a href=\"http://forum.xda-developers.com/showpost.php?p=35178313&amp;postcount=5\" rel=\"nofollow\">XDA-Developers</a>\nThe above mentioned thread has a lot of info if you the patience to scroll through!</p>\n", "userid": "6204", "comments": [], "score": 1, "parentid": "64676", "creationdate": "2014-03-03T06:33:18.827"},
"64682": {"body": "<p>There is a clause in the OpenStreetMap <a href=\"http://wiki.openstreetmap.org/wiki/Tile_usage_policy\" rel=\"nofollow\">Tile usage policy</a> which does not allow offline storage:</p>\n\n<blockquote>\n  <p>Bulk downloading is strongly discouraged. Do not download tiles\n  unnecessarily.</p>\n  \n  <p>In particular, downloading significant areas of tiles at zoom levels\n  17 and higher for offline or later usage is forbidden without prior\n  consultation with a System Administrator. These tiles are generally\n  not available (cached) on the server in advance, and have to be\n  rendered specifically for those requests, putting an unjustified\n  burden on the available resources.<br>\n  ...</p>\n</blockquote>\n\n<p>From Locus itself, you can also see that OSM is not downloadable, versus Google's (assumed to have limits, as mentioned in their TOS).</p>\n\n<p><img src=\"http://i.stack.imgur.com/0BgQi.jpg\" alt=\"enter image description here\"></p>\n", "userid": "5342", "comments": ["87705", "87802"], "score": 1, "parentid": "64670", "creationdate": "2014-03-03T07:53:10.490"},
"64688": {"body": "<p>Yup. If your contacts were successfully synced with your Google Account you can easily move them to your new phone using the same Google Account. Any Android phone from any company can be used to restore the accounts synced with your Google Account.</p>\n", "userid": "31626", "comments": [], "score": 1, "parentid": "64673", "creationdate": "2014-03-03T09:18:16.230"}, "60509": {"body": "<p>the apk file is stored in the internal memory still, it's in the 'data' folder.  I don't think you can do much about that with earlier versions of android but if you find a way then please let me know!</p>\n", "userid": "50117", "comments": ["81937"], "score": -1, "parentid": "48715", "creationdate": "2014-01-06T02:08:40.017"},
"17257": {"body": "<p>If you check this post and the answer by Google employee : <a href=\"http://www.google.com/support/forum/p/Google+Mobile/thread?tid=61ec816cf6ebd668&amp;hl=en\" rel=\"nofollow\">http://www.google.com/support/forum/p/Google+Mobile/thread tid=61ec816cf6ebd668&amp;hl=en</a> , its known limitation rather than a security feature.</p>\n\n<p>The alternative as per this post by Osky: <a href=\"http://www.google.ru/support/forum/p/Google+Mobile/thread?tid=2f07884f917d86eb&amp;hl=en\" rel=\"nofollow\">http://www.google.ru/support/forum/p/Google+Mobile/thread?tid=2f07884f917d86eb&amp;hl=en</a></p>\n\n<blockquote>\n  <p>This is a known limitation. There are a couple of ways around it depending on what you seek to achieve:</p>\n  \n  <ol>\n  <li><p>Logon from your browser and select delete forever from the web app.</p></li>\n  <li><p>Don’t sync the Deleted items label </p></li>\n  </ol>\n  \n  <p>I’ve chosen the second option but on the other hand I very rarely delete and am not that affected by this curious lack of feature.</p>\n  \n  <p>Thing is that trashed mails should be deleted after 30 days, and since I selected to only sync 4 days worth of garbage it should only be present in the cloud for 26 of those days.</p>\n  \n  <p>To sum it up, the trash function is flawed. If it’s a viable option for you, you can chose not to sync that label and messages that you delete from trash will not show up again on your phone.</p>\n  \n  <p>See Eth@n from Google comment on it in the referenced thread, looks like we can hope for the future :)</p>\n</blockquote>\n", "userid": "8197", "comments": [], "score": 6, "parentid": "17250", "creationdate": "2011-12-21T06:06:42.437"}}
