{
    "51829": {
        "body": "<p>I want to send files to android tablet with a application from PC. - I can send files directly to tablet (2.3 android OS) PC see it as a external usb drive. - But i can't send files to tablet (4.2 android OS), because PC see it as a portable media player.(MTP) - How can i fix this problem ? - How can show my device as a external drive? my application that sent files written via Delphi.</p>\n",
        "viewcount": 341,
        "dups": [],
        "title": "How can show android tablet as a external storage to PC?",
        "tags": ["usb-connection-mode"],
        "userid": "39933",
        "related": [],
        "score": 1,
        "answers": [],
        "acceptedanswer": false,
        "creationdate": "2013-08-23T13:17:44.483",
        "favoritecount": 0,
        "comments": ["69862", "69873"]
    },
    "11541": {
        "body": "<p>I am playing around with my brand new Motorola Defy and trying to find a way to manage my contacts.\nOf course it synced every contact in my Google account... I want to hide some of them, you know, those people you don't contact often but whose coordinates you want to keep in case you ever need to. I haven't had any luck so far.</p>\n\n<p>I have 3 apps on my phone that deal with contacts :</p>\n\n<ul>\n<li>one called Contacts that is just for managing contacts (no tabs like dial or favorites) -- you can call someone after selecting them, then selecting the phone number, then call -- in there I can select groups I want to hide but too many clicks to call someone</li>\n<li>the dialer (my phone is in French so it's called \"Appeler\" = Call) with tabs : call, recent, contacts, favorites -- works as I'd want to but display all contacts with a phone number, and I haven't find a way to hide some groups (and it does display \"visibility: hidden\" when you select the contact)</li>\n<li>Go contacts, that I installed in hope it would be everything I wanted, but I can't hide groups, as when I try remove a group from the app it deletes it from Google</li>\n</ul>\n\n<p>I don't know if the 2 apps that came bundled with my phone (contacts and dialer) are stock Android or Motorola. BTW, I skipped the configuration of Motoblur so no Motoblur account or anything like that. And it's running Froyo (already installed when I got it).</p>\n\n<p>Does anyone have a solution for me ?</p>\n",
        "viewcount": 1912,
        "dups": [],
        "title": "How can I hide some contacts from dialer?",
        "tags": ["2.2-froyo", "contacts", "dialer", "motorola-defy"],
        "userid": "6666",
        "related": [],
        "score": 3,
        "answers": ["11542", "11678"],
        "acceptedanswer": "11678",
        "creationdate": "2011-07-17T10:58:21.367",
        "favoritecount": 0,
        "comments": []
    },
    "11546": {
        "body": "<p>I've managed to setup the chroot but I'm unsure how to get the chroot to recognise usb devices. I'll be doing so work with microcontrollers hence I neeed to to recognise my usb based programmer.</p>\n\n<p>For starters how do I populate the dev directory with the host dev directory(android)?</p>\n\n<p>Is it then just a matter of getting the right kernel modules loaded?</p>\n\n<p>I'm running prime1.5 firmware on the asus transformer</p>\n",
        "viewcount": 1224,
        "dups": [],
        "title": "Android chroot ubuntu - is it possible to get ubuntu to recognise usb devices",
        "tags": ["linux", "file-system", "usb-drivers", "usb-peripherals"],
        "userid": "6609",
        "related": [],
        "score": 2,
        "answers": ["11601"],
        "acceptedanswer": false,
        "creationdate": "2011-07-17T14:02:22.700",
        "favoritecount": 0,
        "comments": []
    },
    "11547": {
        "body": "<p>I bought a Sony Ericsson X8 and saw on YouTube that when we turn on this phone a page is supposed to come up and mention the name of Sony Ericsson. When I turn on my phone just it says Android and that's all.</p>\n\n<p>When I wanted to hard restart it or upgrade it, I pressed the back button but nothing happens. When I hold left and right keys together, the same situation when I release.</p>\n\n<p>Is my phone a fake? Why it is like that?</p>\n",
        "viewcount": 213,
        "dups": [],
        "title": "Android doesn't say it's Ericsson, hard restart does nothing",
        "tags": ["sony-ericsson-xperia-x8"],
        "userid": false,
        "related": [],
        "score": 0,
        "answers": ["11549", "11585"],
        "acceptedanswer": false,
        "creationdate": "2011-07-17T14:08:43.370",
        "favoritecount": 0,
        "comments": []
    },
    "11545": {
        "body": "<p>I want to do a comparison of different types of configurations of roms kernels etc. What are the best tools that I can use to do this.</p>\n\n<p>I know this cannot be done with one tool, seperate is fine. The Tools that I am using now are as follow:</p>\n\n<p>Rom/kernel: Quadrant Standard Edition, Linpack for Android\nwifi: wifi-analizer\nwifi/3g: speetest.net app</p>\n\n<p>But are these tools good to do benchmarking, or are there other tools that do a better job. I heard that some of the rom/kernels produce fake results for these tools.</p>\n",
        "viewcount": 238,
        "dups": [],
        "title": "Best tool for benchmarking roms/kernels/wifi/3g",
        "tags": ["benchmarks"],
        "userid": "5832",
        "related": [],
        "score": 0,
        "answers": ["11553"],
        "acceptedanswer": "11553",
        "creationdate": "2011-07-17T13:46:15.820",
        "favoritecount": 0,
        "comments": ["13782", "13783", "13791"]
    },
    "5988": {
        "body": "<p>What distinguishes a widget from an app or a shortcut? I can understand the concept of an app, as something that runs on Android to provide a particular use or function. I can also understand the concept of a shortcut, to provide a way of accessing an app.</p>\n\n<p>Is a widget a special type of app or a special type of shortcut or is it characterised in a way that is distinct from both an app and a shortcut?</p>\n",
        "viewcount": 227,
        "dups": [],
        "title": "What is a widget?",
        "tags": ["widgets"],
        "userid": "1112",
        "related": [],
        "score": 9,
        "answers": ["5989"],
        "acceptedanswer": "5989",
        "creationdate": "2011-02-15T06:22:53.293",
        "favoritecount": 0,
        "comments": []
    },
    "19398": {
        "body": "<p>Following <a href=\"http://forum.xda-developers.com/showthread.php?t=736271\" rel=\"nofollow\">the link</a> taken from <a href=\"http://android.stackexchange.com/questions/1184/how-do-i-root-my-device\">this question</a>, I got the following error.</p>\n\n<pre><code>$ ./freenexus\n[*] Android local root exploid (C) The Android Exploid Crew\n[*] Modified by ak for HTC Nexus One\n[+] Using basedir=/data/local/tmp, path=/data/local/tmp/freenexus\n[+] opening NETLINK_KOBJECT_UEVENT socket\n[+] sending add message ...\n[-] sendmsg: Connection refused\n</code></pre>\n\n<p>Does this mean that method is now outdated?</p>\n",
        "viewcount": 323,
        "dups": [],
        "title": "\"sendmsg: Connection refused\" trying to root a Nexus One",
        "tags": ["rooting", "nexus-one"],
        "userid": "2665",
        "related": ["1184"],
        "score": 0,
        "answers": ["19432"],
        "acceptedanswer": "19432",
        "creationdate": "2012-02-12T09:54:18.740",
        "favoritecount": 0,
        "comments": ["22458", "22460", "22461", "22466", "22467", "22478"]
    },
    "19397": {
        "body": "<p>Is there any way of having a \"Bookmark\" as part of the items in the \"Share\" options that show when one clicks \"Share\" on a given app?</p>\n",
        "viewcount": 96,
        "dups": [],
        "title": "Share to bookmark",
        "tags": ["bookmarks", "share-menu"],
        "userid": "5699",
        "related": ["19374"],
        "score": 8,
        "answers": ["20172"],
        "acceptedanswer": "20172",
        "creationdate": "2012-02-12T09:42:30.050",
        "favoritecount": 0,
        "comments": []
    },
    "5983": {
        "body": "<p>I have a Motorola Droid 1 with Android 2.2 on it. I found something odd that I don't understand why it works.</p>\n\n<p>If I plug my phone into my home computer which is Windows 7 and I turn on the tethering ability, I am met with a Verizon captive portal and it tells me I need to pay for a tethering plan (which I don't have).</p>\n\n<p>Now the weird thing, if I plug the same phone into my Ubuntu 10.10 laptop and enable tethering it works and can get on the internet with no captive portal showing up.</p>\n\n<p>The only thing I could notice that was different about the connections was Windows connected to the phone with an NDIS driver and Linux connected to the phone with what I think is a raw device mapping.</p>\n\n<p>Would that have anything to do with it?</p>\n",
        "viewcount": 560,
        "dups": [],
        "title": "Why can I tether to Ubuntu for free but not Windows?",
        "tags": ["tethering"],
        "userid": "7325",
        "related": [],
        "score": 5,
        "answers": ["20300", "21414"],
        "acceptedanswer": false,
        "creationdate": "2011-02-14T21:54:38.390",
        "favoritecount": 0,
        "comments": ["6670", "6671", "6672"]
    },
    "19394": {
        "body": "<p>I bought \"Cut the Rope\" on my Nexus One cellphone from the Android Market. When I open this game on my Kindle Fire it asks me to buy it but I expected it to be \"Purchased\".</p>\n\n<p>How can I add my Google account to Kindle Fire's Amazon appstore account list?</p>\n",
        "viewcount": 140,
        "dups": [],
        "title": "How can I use an app purchased from the Market on a Kindle Fire?",
        "tags": ["google-play-store", "amazon-kindle-fire", "accounts"],
        "userid": "198",
        "related": ["17338"],
        "score": 5,
        "answers": ["19395"],
        "acceptedanswer": "19395",
        "creationdate": "2012-02-12T08:34:46.670",
        "favoritecount": 0,
        "comments": []
    },
    "19390": {
        "body": "<p>Is it possible to make my Samsung Galaxy Nexus connect to a USB memory stick?</p>\n\n<p>I have the USB Connect. How can I do that?</p>\n",
        "viewcount": 1139,
        "dups": [],
        "title": "Is it possible to make my Samsung Galaxy Nexus use external usb storage like memory sticks?",
        "tags": ["samsung-galaxy-nexus", "usb-peripherals"],
        "userid": "12472",
        "related": [],
        "score": 4,
        "answers": ["27615", "37529"],
        "acceptedanswer": false,
        "creationdate": "2012-02-12T06:07:20.930",
        "favoritecount": 2,
        "comments": ["22509", "30831", "30832", "30833"]
    },
    "82448": {
        "body": "<p>I can't show this <a href=\"https://celcatfsi.ups-tlse.fr/FSIpargroupes/g771.html\" rel=\"nofollow\">page</a> using my Android device. I have used many browser but none of them show the timetable. I guess that my phone is missing something but what?</p>\n\n<p>I'm using Android 2.3.7.</p>\n",
        "viewcount": 17,
        "dups": [],
        "title": "Why my Android phone not correctly show a web page",
        "tags": ["browser", "firefox", "dolphin-browser"],
        "userid": "65382",
        "related": [],
        "score": 0,
        "answers": ["82458"],
        "acceptedanswer": false,
        "creationdate": "2014-09-12T13:11:50.293",
        "favoritecount": 0,
        "comments": []
    },
    "82442": {
        "body": "<p>We just got a new Android smartphone. It is an LG L1 II E410i. The provider is <a href=\"https://www.hotmobile.co.il/HOTmobile_en/Pages/default.aspx\" rel=\"nofollow\">HOT mobile</a>.</p>\n\n<p>The phone's default language is Hebrew, and I can't seem to change it. The normal Android settings app is not available - they seem to have replaced it with their own.</p>\n\n<p>Is it possible to get the settings app back?</p>\n",
        "viewcount": 13,
        "dups": [],
        "title": "Restore the default Android settings app",
        "tags": ["settings", "hebrew"],
        "userid": "73043",
        "related": [],
        "score": 0,
        "answers": ["82444"],
        "acceptedanswer": "82444",
        "creationdate": "2014-09-12T11:49:43.200",
        "favoritecount": 0,
        "comments": ["105577"]
    },
    "82440": {
        "body": "<p>I am using karbonn A5i.while installing apps it says no space to install though the sd card has sufficient space.please  help  me.</p>\n",
        "viewcount": 13,
        "dups": ["23010"],
        "title": "problem in installing apps in karbonn A5i",
        "tags": ["google-account", "insufficient-memory"],
        "userid": "73042",
        "related": ["23010"],
        "score": -1,
        "answers": [],
        "acceptedanswer": false,
        "creationdate": "2014-09-12T11:32:29.637",
        "favoritecount": 0,
        "comments": ["105590"]
    },
    "82447": {
        "body": "<p>On all the Android devices I've ever had, I've never seen one that could actually allow flash music streaming or YouTube to run in the background on a minimized window.</p>\n\n<p>For example, if you are on a music streaming website, as long as that web page is in the foreground the audio will play. However, if you need to minimize that window and open another tab, for example, the flash stream stops.</p>\n\n<p>It's the exact same way for YouTube; as long as the video is open in the foreground window the music will play.</p>\n\n<p>Is there any way to put those in background, but have their sound continue to play?</p>\n",
        "viewcount": 16,
        "dups": [],
        "title": "Enabling Flash Player to run in the background",
        "tags": ["samsung-galaxy-s", "youtube", "adobe-flash"],
        "userid": "64834",
        "related": [],
        "score": 0,
        "answers": [],
        "acceptedanswer": false,
        "creationdate": "2014-09-12T12:54:24.913",
        "favoritecount": 0,
        "comments": ["105586", "105589", "105605"]
    },
    "46136": {
        "body": "<p>My Nexus 7 will not boot up past the start-up animation (colorful X)-it's not a power problem as it charges up OK-just will not get past the X. I've powered it up and down several times but it hasn't solved the problem.</p>\n",
        "viewcount": 3361,
        "dups": [],
        "title": "Nexus 7 won't boot up after the colorful X",
        "tags": ["nexus-7", "boot"],
        "userid": "34693",
        "related": [],
        "score": 1,
        "answers": ["46138"],
        "acceptedanswer": false,
        "creationdate": "2013-05-26T16:36:41.810",
        "favoritecount": 0,
        "comments": []
    },
    "46133": {
        "body": "<p>I want to install a bash terminal emulation on my factory Android Gingerbread mobile? Is this even possible without a rooted gingerbread? Where can I find a good bash terminal emulation? I need it for remote server application.</p>\n",
        "viewcount": 4627,
        "dups": [],
        "title": "How can I find a good bash terminal emulation for Android Gingerbread?",
        "tags": ["2.3-gingerbread", "terminal", "bash"],
        "userid": "34689",
        "related": [],
        "score": 0,
        "answers": ["46154", "46225"],
        "acceptedanswer": false,
        "creationdate": "2013-05-26T15:58:28.860",
        "favoritecount": 0,
        "comments": ["62212", "62227", "62291"]
    },
    "36706": {
        "body": "<p>I'm using LG L3 E405, and when I see memory usage in App Manager. I see there three sections: First is system memory (just about 200M), second is internal memory (1 GB) and last is my sd card (8GB). </p>\n\n<p>I know difference between internal memory (is internal sd card) and normal sd card. But I don't know purpose of system memory. It's too low, and often applications are installed to there. After install, I must move those apps again to internal memory, but not all I can do this.</p>\n\n<p>Please help me figure out this point.</p>\n",
        "viewcount": 3883,
        "dups": [],
        "title": "LG L3 : difference between system memory and internal memory",
        "tags": ["internal-storage", "ram"],
        "userid": "26005",
        "related": [],
        "score": 0,
        "answers": ["39206"],
        "acceptedanswer": false,
        "creationdate": "2013-01-02T18:46:51.673",
        "favoritecount": 0,
        "comments": ["48003", "53097"]
    },
    "19973": {
        "body": "<p>I would like to mass install few apps at one time from a single FTP server - from Android phone, without using adb command.</p>\n\n<p>The phone will be rooted and will have and the option to install non-Market apps turned on.</p>\n\n<p>I know it is possible to install many apps using single adb command (http://www.androidsim.net/2011/06/how-to-18-mass-installing-multiple.html) but I would like to do this <strong>using an Android app</strong> that would download all the apps and install them.\nI am looking for a ready-made solution (app/code snippet) or a clues for implementing FTP connection.</p>\n",
        "viewcount": 186,
        "dups": [],
        "title": "Mass install apps using FTP/HTTP",
        "tags": ["installation", "adb", "file-transfer"],
        "userid": "12854",
        "related": [],
        "score": 0,
        "answers": ["19975"],
        "acceptedanswer": "19975",
        "creationdate": "2012-02-27T16:40:42.813",
        "favoritecount": 0,
        "comments": []
    },
    "19971": {
        "body": "<blockquote>\n  <p><strong>Possible Duplicate:</strong><br>\n  <a href=\"http://android.stackexchange.com/questions/17152/where-can-i-find-stock-or-custom-roms-for-my-android-device\">Where can I find stock or custom ROMs for my Android device?</a>  </p>\n</blockquote>\n\n\n\n<p>I've just received an HTC Flyer which I intend on rooting and putting a custom ROM on.  Normally I would look at CyanogenMod, but it seems that there isn't a port for the Flyer, so I was wondering if there is any resource where I can see a list of ROMs available for a given device?  </p>\n",
        "viewcount": 56,
        "dups": ["17152"],
        "title": "List of ROMs for HTC Flyer",
        "tags": ["rom", "htc-flyer"],
        "userid": "1353",
        "related": ["17152"],
        "score": 0,
        "answers": [],
        "acceptedanswer": false,
        "creationdate": "2012-02-27T16:20:31.390",
        "favoritecount": 0,
        "comments": ["23114", "23115", "23119"]
    },
    "19970": {
        "body": "<p>I have a rooted HTC Hero with the latest Cyanogen mod installed on it.</p>\n\n<p>I'd like to get it back to its stock status, restoring the original, official ROM and unrooting it. Is this possible? I have found <a href=\"http://forum.xda-developers.com/showthread.php?t=559622\" rel=\"nofollow\">this thread</a> with what seems to be stock ROMs, however, I don't know whether that will do the job and also unroot the phone.</p>\n",
        "viewcount": 780,
        "dups": [],
        "title": "Can I restore my HTC Hero to its stock ROM?",
        "tags": ["cyanogenmod", "rom-flashing", "stock-android", "unrooting", "htc-hero"],
        "userid": "5133",
        "related": [],
        "score": 1,
        "answers": ["19972"],
        "acceptedanswer": "19972",
        "creationdate": "2012-02-27T16:03:47.963",
        "favoritecount": 0,
        "comments": []
    },
    "19977": {
        "body": "<p>I changed the system font (by Font Changer) to Ubuntu font (0.8). This font has Latin-Extended support and can display Vietnamese just fine (I tested this on <a href=\"http://font.ubuntu.com/\" rel=\"nofollow\">http://font.ubuntu.com/</a>). \nHowever, after I changed to this font, Vietnamese chars are replaced by boxes.</p>\n\n<p>Can anyone explain this for me? Any idea on how to fix this?</p>\n",
        "viewcount": 289,
        "dups": [],
        "title": "Ubuntu font cannot display latin extended characters",
        "tags": ["fonts", "stock-browser"],
        "userid": "12943",
        "related": [],
        "score": 3,
        "answers": ["20003"],
        "acceptedanswer": "20003",
        "creationdate": "2012-02-27T18:56:15.533",
        "favoritecount": 0,
        "comments": []
    },
    "12016": {
        "body": "<p>I know this is a bit localized, but I can't find ANY information on this at all on the internet, because all of the information for the Nexus S assumes the T-Mobile band version.</p>\n\n<p>I would only purchase this phone to immediately unlock the bootloader for custom ROM development.</p>\n\n<p>Is the only difference between the two phones the bands the 3G radio uses?</p>\n",
        "viewcount": 241,
        "dups": [],
        "title": "AT&T Nexus S: is this sold SIM locked / boot-loader locked?",
        "tags": ["samsung-nexus-s"],
        "userid": "6830",
        "related": ["8606"],
        "score": 1,
        "answers": ["12017", "12418"],
        "acceptedanswer": "12017",
        "creationdate": "2011-08-02T20:12:47.287",
        "favoritecount": 0,
        "comments": []
    },
    "12011": {
        "body": "<p>I have measured Skype's bandwidth consumption:</p>\n\n<ul>\n<li>When just running Skype: ~0.09 KB/s</li>\n<li>When talking to someone through Skype: ~9 KB/s</li>\n</ul>\n\n<p>Is there any VoIP software available in the Android Market that consumes less bandwidth? </p>\n\n<p><strong>NOTE</strong>: I'd like to be able to talk to someone on Ubuntu with this client, so it should also have a Linux version or be compatible with another Linux client/network.</p>\n\n<p>P.S.: Are my measurements correct?</p>\n",
        "viewcount": 3778,
        "dups": [],
        "title": "Is there any low bandwidth VoIP software for Android?",
        "tags": ["skype", "voip", "bandwidth"],
        "userid": "4895",
        "related": [],
        "score": 7,
        "answers": ["13915", "14726", "13923"],
        "acceptedanswer": false,
        "creationdate": "2011-08-02T16:52:07.150",
        "favoritecount": 2,
        "comments": ["14338", "14886", "16575", "16578", "17184"]
    },
    "17258": {
        "body": "<p>When I try using Terminal emulator's ssh I get</p>\n\n<blockquote>\n  <p>ssh: Warning: failed creating /data/.ssh: Permission denied.</p>\n</blockquote>\n\n<p>or since 2012-08-19:</p>\n\n<blockquote>\n  <p>Could not create directory '/data/ssh_client'.</p>\n</blockquote>\n\n<p>But when I type:</p>\n\n<pre><code>echo $HOME\n/sdcard\n</code></pre>\n\n<p>Why isn't ssh checking <code>/sdcard/.ssh</code> or <code>/sdcard/ssh_data</code>?</p>\n",
        "viewcount": 1226,
        "dups": [],
        "title": "Terminal emulator's ssh trying to read /data/.ssh instead of $HOME/.ssh",
        "tags": ["ssh", "terminal"],
        "userid": "940",
        "related": [],
        "score": 6,
        "answers": ["28568"],
        "acceptedanswer": false,
        "creationdate": "2011-12-21T06:44:42.423",
        "favoritecount": 1,
        "comments": ["20156", "20188", "35688"]
    },
    "64676": {
        "body": "<p>I've been flashing ROMs but I don't really see the difference between them. I'm on KitKat 4.4.2 for the Nexus 4.</p>\n",
        "viewcount": 400,
        "dups": ["50491"],
        "title": "What is the difference between AOSP and CM/AOKP?",
        "tags": ["nexus-4", "4.4-kitkat"],
        "userid": "54203",
        "related": ["50491"],
        "score": 0,
        "answers": ["64677"],
        "acceptedanswer": false,
        "creationdate": "2014-03-03T05:42:26.253",
        "favoritecount": 0,
        "comments": []
    },
    "64670": {
        "body": "<p>I am going to develop an app for Android, and I'm trying to understand whether it is possible to store maps for offline usage (anyway I am not sure this is a question for developers).</p>\n\n<p>Google Maps TOS is enough explicit about the fact that maps can't be stored (if not with some strict limitation), see <a href=\"https://developers.google.com/maps/terms?csw=1\" rel=\"nofollow\">https://developers.google.com/maps/terms?csw=1</a> (10.1.3): </p>\n\n<pre><code>(b) No Pre-Fetching, Caching, or Storage of Content. You must not pre-fetch, cache, or\n store any Content, except that you may store: (i) limited amounts of Content for the \n purpose of improving the performance of your Maps API Implementation if you do so \n temporarily (and in no event for more than 30 calendar days), securely, and in a manner \n that does not permit use of the Content outside of the Service;\n</code></pre>\n\n<p>while OSM provide public free API and resources for the exploiting of its knowledge base.</p>\n\n<p>Now, I am really confused about the Locus Tweak behaviour. It allows me to easily store tiled maps by Google maps even for wide areas with good definition, when it would be supposed not to be allowed, on the other hand when I try to store OSM maps, the answer is: </p>\n\n<p><img src=\"http://i.stack.imgur.com/mWNfo.png\" alt=\"enter image description here\"></p>\n\n<p>Searching on Internet and the page <a href=\"http://support.locusmap.eu/hc/en-us/articles/200090132\" rel=\"nofollow\">http://support.locusmap.eu/hc/en-us/articles/200090132</a> is not of help, what am I missing here?</p>\n\n<p>In conclusion: I would like to understand how an app downloaded by 100.000+ users can use this way Google Maps, and OSM which would have been my second choice, seems not to allow it.</p>\n",
        "viewcount": 717,
        "dups": [],
        "title": "Locus Tweak allows Google Maps download, not OSM!",
        "tags": ["applications", "google-maps", "offline-map"],
        "userid": "54924",
        "related": [],
        "score": 1,
        "answers": ["64682"],
        "acceptedanswer": false,
        "creationdate": "2014-03-03T03:04:20.427",
        "favoritecount": 1,
        "comments": []
    },
    "64671": {
        "body": "<p>Can anyone tell me if the Samsung Galaxy S3 LTE model SCH-R530 can use any other non-contract carriers besides U.S. Cellular?  I have searched, and I am getting frustrated with trying to find a way to unlock it. I thought this particular phone didn't use a SIM card.</p>\n",
        "viewcount": 1529,
        "dups": [],
        "title": "How to unlock Samsung Galaxy S3 SCH-R530?",
        "tags": ["samsung-galaxy-s-3", "sim-unlocking"],
        "userid": "55108",
        "related": [],
        "score": 1,
        "answers": [],
        "acceptedanswer": false,
        "creationdate": "2014-03-03T03:14:51.187",
        "favoritecount": 0,
        "comments": []
    },
    "64673": {
        "body": "<p>I had a android phone a while back an i sync it to my gmail so i could save contacts.but being its been so long and i'm not sure of the g mail account will i still have the contacts there if i can remember or find the right gmail account and will i be able to move them to my new phone even though i'm with a new company? i tried contacting old cell company to ask them for help and still no reply.</p>\n",
        "viewcount": 11,
        "dups": [],
        "title": "old phone contacts and e mail",
        "tags": ["google-backup"],
        "userid": "55113",
        "related": [],
        "score": 0,
        "answers": ["64688"],
        "acceptedanswer": false,
        "creationdate": "2014-03-03T04:43:09.350",
        "favoritecount": 0,
        "comments": []
    },
    "17250": {
        "body": "<p>Android 2.2 on an LG GT540. If I delete an email from my inbox in the default Gmail application then the email is in the trash, OK. But why isn't there any options to delete the e-mail from my trash? </p>\n\n<p>Is it a security feature or what?</p>\n",
        "viewcount": 3467,
        "dups": [],
        "title": "Why doesn't the Gmail app delete my e-mails permanently?",
        "tags": ["gmail"],
        "userid": "4895",
        "related": [],
        "score": 4,
        "answers": ["17257"],
        "acceptedanswer": false,
        "creationdate": "2011-12-21T03:57:41.773",
        "favoritecount": 0,
        "comments": []
    }
}